[Killed] BooleanLiteral
src/Virastar.ts:14:24
   private readonly options: VirastarOptions = {}
 
   private readonly defaultOptions: VirastarOptions = {
-    cleanupExtraMarks: true,
+    cleanupExtraMarks: false,
     cleanupKashidas: true,
     cleanupLineBreaks: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟؟؟!!!!!!!"

[Killed] BooleanLiteral
src/Virastar.ts:15:22
 
   private readonly defaultOptions: VirastarOptions = {
     cleanupExtraMarks: true,
-    cleanupKashidas: true,
+    cleanupKashidas: false,
     cleanupLineBreaks: true,
     cleanupRightToLeftMarks: true,
killedBy: Virastar #cleanup() should remove all kashida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلامت"
Received: "سلامـــت"

[Survived] BooleanLiteral
src/Virastar.ts:16:24
   private readonly defaultOptions: VirastarOptions = {
     cleanupExtraMarks: true,
     cleanupKashidas: true,
-    cleanupLineBreaks: true,
+    cleanupLineBreaks: false,
     cleanupRightToLeftMarks: true,
     cleanupSpacing: true,

[Survived] BooleanLiteral
src/Virastar.ts:17:30
     cleanupExtraMarks: true,
     cleanupKashidas: true,
     cleanupLineBreaks: true,
-    cleanupRightToLeftMarks: true,
+    cleanupRightToLeftMarks: false,
     cleanupSpacing: true,
     cleanupZeroWidthNonJoiners: true,

[Killed] BooleanLiteral
src/Virastar.ts:18:21
     cleanupKashidas: true,
     cleanupLineBreaks: true,
     cleanupRightToLeftMarks: true,
-    cleanupSpacing: true,
+    cleanupSpacing: false,
     cleanupZeroWidthNonJoiners: true,
     decodeHtmlEntities: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪  ۴۵۶"

[Killed] BooleanLiteral
src/Virastar.ts:19:33
     cleanupLineBreaks: true,
     cleanupRightToLeftMarks: true,
     cleanupSpacing: true,
-    cleanupZeroWidthNonJoiners: true,
+    cleanupZeroWidthNonJoiners: false,
     decodeHtmlEntities: true,
     replaceSuffixSpacing: true,
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیبا‌تر و درست‌تری بنویسید."

[Killed] BooleanLiteral
src/Virastar.ts:20:25
     cleanupRightToLeftMarks: true,
     cleanupSpacing: true,
     cleanupZeroWidthNonJoiners: true,
-    decodeHtmlEntities: true,
+    decodeHtmlEntities: false,
     replaceSuffixSpacing: true,
     normalizeEllipsis: true,
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] BooleanLiteral
src/Virastar.ts:21:27
     cleanupSpacing: true,
     cleanupZeroWidthNonJoiners: true,
     decodeHtmlEntities: true,
-    replaceSuffixSpacing: true,
+    replaceSuffixSpacing: false,
     normalizeEllipsis: true,
     normalizeEndOfLines: true,
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیبا تر و درست تری بنویسید."

[Killed] BooleanLiteral
src/Virastar.ts:22:24
     cleanupZeroWidthNonJoiners: true,
     decodeHtmlEntities: true,
     replaceSuffixSpacing: true,
-    normalizeEllipsis: true,
+    normalizeEllipsis: false,
     normalizeEndOfLines: true,
     normalizeJalaliDates: true,
killedBy: Virastar #cleanup(): Additional should normalize ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "…"
Received: "………"

[Survived] BooleanLiteral
src/Virastar.ts:23:26
     decodeHtmlEntities: true,
     replaceSuffixSpacing: true,
     normalizeEllipsis: true,
-    normalizeEndOfLines: true,
+    normalizeEndOfLines: false,
     normalizeJalaliDates: true,
     normalizeKashidas: true,

[Killed] BooleanLiteral
src/Virastar.ts:24:27
     replaceSuffixSpacing: true,
     normalizeEllipsis: true,
     normalizeEndOfLines: true,
-    normalizeJalaliDates: true,
+    normalizeJalaliDates: false,
     normalizeKashidas: true,
     normalizeMarkDownBraces: true,
killedBy: Virastar #cleanup(): Additional extra: normalizeDates(): reorders date parts with slash as delimiter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۳۵۵/۱۰/۲۳"
Received: "۲۳/۱۰/۱۳۵۵"

[Killed] BooleanLiteral
src/Virastar.ts:25:24
     normalizeEllipsis: true,
     normalizeEndOfLines: true,
     normalizeJalaliDates: true,
-    normalizeKashidas: true,
+    normalizeKashidas: false,
     normalizeMarkDownBraces: true,
     normalizeMarkDownLists: true,
killedBy: Virastar #cleanup() should replace kashidas to ndash in parenthetic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "– که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم –"
Received: "ـ که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم ـ"

[Killed] BooleanLiteral
src/Virastar.ts:26:30
     normalizeEndOfLines: true,
     normalizeJalaliDates: true,
     normalizeKashidas: true,
-    normalizeMarkDownBraces: true,
+    normalizeMarkDownBraces: false,
     normalizeMarkDownLists: true,
     normalizeThreeDots: true,
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name] (https://example.com/media/image.jpg)"

[Survived] BooleanLiteral
src/Virastar.ts:27:29
     normalizeJalaliDates: true,
     normalizeKashidas: true,
     normalizeMarkDownBraces: true,
-    normalizeMarkDownLists: true,
+    normalizeMarkDownLists: false,
     normalizeThreeDots: true,
     preserveCurlyBraces: false,

[Killed] BooleanLiteral
src/Virastar.ts:28:25
     normalizeKashidas: true,
     normalizeMarkDownBraces: true,
     normalizeMarkDownLists: true,
-    normalizeThreeDots: true,
+    normalizeThreeDots: false,
     preserveCurlyBraces: false,
     preserveFrontMatter: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند…"
Received: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند. . ."

[Killed] BooleanLiteral
src/Virastar.ts:29:26
     normalizeMarkDownBraces: true,
     normalizeMarkDownLists: true,
     normalizeThreeDots: true,
-    preserveCurlyBraces: false,
+    preserveCurlyBraces: true,
     preserveFrontMatter: true,
     preserveHtmlComments: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه»، {    آکولاد   }، [کروشه] و (پرانتز) تنظیم می‌کند."

[Survived] BooleanLiteral
src/Virastar.ts:30:26
     normalizeMarkDownLists: true,
     normalizeThreeDots: true,
     preserveCurlyBraces: false,
-    preserveFrontMatter: true,
+    preserveFrontMatter: false,
     preserveHtmlComments: true,
     preserveHtmlEntities: true,

[Survived] BooleanLiteral
src/Virastar.ts:31:27
     normalizeThreeDots: true,
     preserveCurlyBraces: false,
     preserveFrontMatter: true,
-    preserveHtmlComments: true,
+    preserveHtmlComments: false,
     preserveHtmlEntities: true,
     preserveHtmlTags: true,

[Survived] BooleanLiteral
src/Virastar.ts:32:27
     preserveCurlyBraces: false,
     preserveFrontMatter: true,
     preserveHtmlComments: true,
-    preserveHtmlEntities: true,
+    preserveHtmlEntities: false,
     preserveHtmlTags: true,
     preserveNonBreakingSpaces: true,

[Killed] BooleanLiteral
src/Virastar.ts:33:23
     preserveFrontMatter: true,
     preserveHtmlComments: true,
     preserveHtmlEntities: true,
-    preserveHtmlTags: true,
+    preserveHtmlTags: false,
     preserveNonBreakingSpaces: true,
     preserveSquareBrackets: false,
killedBy: Virastar #cleanup(): Additional should preserve all HTML tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<strong title=\"نباید تغییر کند!!!!!\">سلام جهان</strong>"
Received: "<strong title= «نباید تغییر کند!» >سلام جهان</strong>"

[Survived] BooleanLiteral
src/Virastar.ts:34:32
     preserveHtmlComments: true,
     preserveHtmlEntities: true,
     preserveHtmlTags: true,
-    preserveNonBreakingSpaces: true,
+    preserveNonBreakingSpaces: false,
     preserveSquareBrackets: false,
     preserveUris: true,

[Killed] BooleanLiteral
src/Virastar.ts:35:29
     preserveHtmlEntities: true,
     preserveHtmlTags: true,
     preserveNonBreakingSpaces: true,
-    preserveSquareBrackets: false,
+    preserveSquareBrackets: true,
     preserveUris: true,
     preserveMarkDownCodeBlocks: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [   کروشه  ] و (پرانتز) تنظیم می‌کند."

[Killed] BooleanLiteral
src/Virastar.ts:36:19
     preserveHtmlTags: true,
     preserveNonBreakingSpaces: true,
     preserveSquareBrackets: false,
-    preserveUris: true,
+    preserveUris: false,
     preserveMarkDownCodeBlocks: true,
     removeDiacritics: false,
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "![alt name](https: //example.com/media/image. jpg)"

[Survived] BooleanLiteral
src/Virastar.ts:37:33
     preserveNonBreakingSpaces: true,
     preserveSquareBrackets: false,
     preserveUris: true,
-    preserveMarkDownCodeBlocks: true,
+    preserveMarkDownCodeBlocks: false,
     removeDiacritics: false,
     removeLeadingAndTrailingSpaces: true,

[Killed] BooleanLiteral
src/Virastar.ts:38:23
     preserveSquareBrackets: false,
     preserveUris: true,
     preserveMarkDownCodeBlocks: true,
-    removeDiacritics: false,
+    removeDiacritics: true,
     removeLeadingAndTrailingSpaces: true,
     removeSpacingForPunctuations: true,
killedBy: Virastar #cleanup() should not put space after dots in numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پوسته دوهزارونوزده، حداقل به نسخه وردپرس ۴٫۷ نیاز دارد. شما نسخه %s را اجرا می‌کنید. لطفاً وردپرس خود را ارتقا دهید و دوباره سعی کنید."
Received: "پوسته دوهزارونوزده، حداقل به نسخه وردپرس ۴٫۷ نیاز دارد. شما نسخه %s را اجرا می‌کنید. لطفا وردپرس خود را ارتقا دهید و دوباره سعی کنید."

[Killed] BooleanLiteral
src/Virastar.ts:39:37
     preserveUris: true,
     preserveMarkDownCodeBlocks: true,
     removeDiacritics: false,
-    removeLeadingAndTrailingSpaces: true,
+    removeLeadingAndTrailingSpaces: false,
     removeSpacingForPunctuations: true,
     replaceArabicNumbers: true,
killedBy: Virastar #cleanup() should replace more than one space with just a single one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام جهان، من ویراستار هستم!"
Received: " سلام جهان، من ویراستار هستم!"

[Killed] BooleanLiteral
src/Virastar.ts:40:35
     preserveMarkDownCodeBlocks: true,
     removeDiacritics: false,
     removeLeadingAndTrailingSpaces: true,
-    removeSpacingForPunctuations: true,
+    removeSpacingForPunctuations: false,
     replaceArabicNumbers: true,
     replaceDashes: true,
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید ."

[Killed] BooleanLiteral
src/Virastar.ts:41:27
     removeDiacritics: false,
     removeLeadingAndTrailingSpaces: true,
     removeSpacingForPunctuations: true,
-    replaceArabicNumbers: true,
+    replaceArabicNumbers: false,
     replaceDashes: true,
     replaceDiacritics: true,
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "٠١٢٣٤٥٦٧٨٩"

[Killed] BooleanLiteral
src/Virastar.ts:42:20
     removeLeadingAndTrailingSpaces: true,
     removeSpacingForPunctuations: true,
     replaceArabicNumbers: true,
-    replaceDashes: true,
+    replaceDashes: false,
     replaceDiacritics: true,
     replaceEnglishNumbers: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (–) و سه علامت منهای پی در پی را به خط کشیده بلند (—) تبدیل می‌کند."
Received: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (--) و سه علامت منهای پی در پی را به خط کشیده بلند (---) تبدیل می‌کند."

[Killed] BooleanLiteral
src/Virastar.ts:43:24
     removeSpacingForPunctuations: true,
     replaceArabicNumbers: true,
     replaceDashes: true,
-    replaceDiacritics: true,
+    replaceDiacritics: false,
     replaceEnglishNumbers: true,
     replaceEnglishQuotes: true,
killedBy: Virastar #cleanup(): Additional extra: fixDiacritics():‌ cleans more than one diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "لطفاً"
Received: "لطفاًً"

[Killed] BooleanLiteral
src/Virastar.ts:44:28
     replaceArabicNumbers: true,
     replaceDashes: true,
     replaceDiacritics: true,
-    replaceEnglishNumbers: true,
+    replaceEnglishNumbers: false,
     replaceEnglishQuotes: true,
     replaceEnglishQuotesPairs: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "1. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] BooleanLiteral
src/Virastar.ts:45:27
     replaceDashes: true,
     replaceDiacritics: true,
     replaceEnglishNumbers: true,
-    replaceEnglishQuotes: true,
+    replaceEnglishQuotes: false,
     replaceEnglishQuotesPairs: true,
     replaceHamzeh: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نق

[Survived] BooleanLiteral
src/Virastar.ts:46:32
     replaceDiacritics: true,
     replaceEnglishNumbers: true,
     replaceEnglishQuotes: true,
-    replaceEnglishQuotesPairs: true,
+    replaceEnglishQuotesPairs: false,
     replaceHamzeh: true,
     replaceHamzehArabic: false,

[Killed] BooleanLiteral
src/Virastar.ts:47:20
     replaceEnglishNumbers: true,
     replaceEnglishQuotes: true,
     replaceEnglishQuotesPairs: true,
-    replaceHamzeh: true,
+    replaceHamzeh: false,
     replaceHamzehArabic: false,
     replaceMiscNonPersianChars: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام می‌شوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
Received: "۵. در ترکیباتی مانند «خانه‌ی پدری» که با «ه» تمام می‌شوند نشانه «ی» کسره‌ی اضافه را به «هٔ» تبدیل می‌کند."

[Survived] BooleanLiteral
src/Virastar.ts:48:26
     replaceEnglishQuotes: true,
     replaceEnglishQuotesPairs: true,
     replaceHamzeh: true,
-    replaceHamzehArabic: false,
+    replaceHamzehArabic: true,
     replaceMiscNonPersianChars: true,
     replaceMiscSpacing: true,

[Killed] BooleanLiteral
src/Virastar.ts:49:33
     replaceEnglishQuotesPairs: true,
     replaceHamzeh: true,
     replaceHamzehArabic: false,
-    replaceMiscNonPersianChars: true,
+    replaceMiscNonPersianChars: false,
     replaceMiscSpacing: true,
     replaceNumeralSymbols: true,
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."

[Survived] BooleanLiteral
src/Virastar.ts:50:25
     replaceHamzeh: true,
     replaceHamzehArabic: false,
     replaceMiscNonPersianChars: true,
-    replaceMiscSpacing: true,
+    replaceMiscSpacing: false,
     replaceNumeralSymbols: true,
     replacePersianGlyphs: true,

[Killed] BooleanLiteral
src/Virastar.ts:51:28
     replaceHamzehArabic: false,
     replaceMiscNonPersianChars: true,
     replaceMiscSpacing: true,
-    replaceNumeralSymbols: true,
+    replaceNumeralSymbols: false,
     replacePersianGlyphs: true,
     replacePrefixSpacing: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲% ۴۵۶"

[Survived] BooleanLiteral
src/Virastar.ts:52:27
     replaceMiscNonPersianChars: true,
     replaceMiscSpacing: true,
     replaceNumeralSymbols: true,
-    replacePersianGlyphs: true,
+    replacePersianGlyphs: false,
     replacePrefixSpacing: true,
     replacePunctuations: true,

[Killed] BooleanLiteral
src/Virastar.ts:53:27
     replaceMiscSpacing: true,
     replaceNumeralSymbols: true,
     replacePersianGlyphs: true,
-    replacePrefixSpacing: true,
+    replacePrefixSpacing: false,
     replacePunctuations: true,
     replaceQuestionMarks: true,
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می کند تا متون فارسی زیباتر و درست‌تری بنویسید."

[Killed] BooleanLiteral
src/Virastar.ts:54:26
     replaceNumeralSymbols: true,
     replacePersianGlyphs: true,
     replacePrefixSpacing: true,
-    replacePunctuations: true,
+    replacePunctuations: false,
     replaceQuestionMarks: true,
     replaceSpacingForBracesAndQuotes: true,
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند, مثلا تبدیل کامای انگلیسی به ویرگول (,), یا نق

[Killed] BooleanLiteral
src/Virastar.ts:55:27
     replacePersianGlyphs: true,
     replacePrefixSpacing: true,
     replacePunctuations: true,
-    replaceQuestionMarks: true,
+    replaceQuestionMarks: false,
     replaceSpacingForBracesAndQuotes: true,
     replaceSuffixMisc: true,
killedBy: Virastar #cleanup(): Additional should normalize question/exclamation marks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست؟!"
Received: "عادت به تنهایی… این دیگر از آن حرف‌هاست?!"

[Killed] BooleanLiteral
src/Virastar.ts:56:39
     replacePrefixSpacing: true,
     replacePunctuations: true,
     replaceQuestionMarks: true,
-    replaceSpacingForBracesAndQuotes: true,
+    replaceSpacingForBracesAndQuotes: false,
     replaceSuffixMisc: true,
     skip_markdown_ordered_lists_numbers_conversion: false,
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (، )، یا ن

[Killed] BooleanLiteral
src/Virastar.ts:57:24
     replacePunctuations: true,
     replaceQuestionMarks: true,
     replaceSpacingForBracesAndQuotes: true,
-    replaceSuffixMisc: true,
+    replaceSuffixMisc: false,
     skip_markdown_ordered_lists_numbers_conversion: false,
   }
killedBy: Virastar #cleanup(): Additional extra: fixSuffixMisc()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ای بر روی آب"
Received: "خانه‌یی بر روی آب"

[Survived] BooleanLiteral
src/Virastar.ts:58:53
     replaceQuestionMarks: true,
     replaceSpacingForBracesAndQuotes: true,
     replaceSuffixMisc: true,
-    skip_markdown_ordered_lists_numbers_conversion: false,
+    skip_markdown_ordered_lists_numbers_conversion: true,
   }
 

[Killed] BlockStatement
src/Virastar.ts:69:46
    * Initializes a new instance of Virastar with the given options.
    * @param {VirastarOptions} [options] - The options to configure the Virastar instance.
    */
-  constructor(options: VirastarOptions = {}) {
-    this.options = this.parseOptions(options)
-
-    this.preserverFactory = new PreserverFactory()
-    this.processorFactory = new ProcessorFactory()
-  }
+  constructor(options: VirastarOptions = {}) {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'createPreserver')

[Killed] ConditionalExpression
src/Virastar.ts:86:9
    */
   public process(text: string, options?: VirastarOptions) {
     // Don't bother if it's empty or whitespace
-    if (!text.trim()) {
+    if (true) {
       return text
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيبا تر و درست تري بنويسيد ."

[Killed] BooleanLiteral
src/Virastar.ts:86:9
    */
   public process(text: string, options?: VirastarOptions) {
     // Don't bother if it's empty or whitespace
-    if (!text.trim()) {
+    if (text.trim()) {
       return text
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيبا تر و درست تري بنويسيد ."

[Survived] BlockStatement
src/Virastar.ts:97:38
     text = ` ${text} `
 
     // Preserves front-matter data in the text
-    if (opts['preserveFrontMatter']) {
-      text = this.preserverFactory
-        .createPreserver('preserveFrontMatter')
-        .prepare(text)
-    }
+    if (opts['preserveFrontMatter']) {}
 
     // Preserves all HTML tags in the text

[Survived] ConditionalExpression
src/Virastar.ts:97:9
     text = ` ${text} `
 
     // Preserves front-matter data in the text
-    if (opts['preserveFrontMatter']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveFrontMatter')

[Killed] ConditionalExpression
src/Virastar.ts:104:9
     }
 
     // Preserves all HTML tags in the text
-    if (opts['preserveHtmlTags']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveHtmlTags')
killedBy: Virastar #cleanup(): Additional should preserve all HTML tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<strong title=\"نباید تغییر کند!!!!!\">سلام جهان</strong>"
Received: "<strong title= «نباید تغییر کند!» >سلام جهان</strong>"

[Killed] BlockStatement
src/Virastar.ts:104:35
     }
 
     // Preserves all HTML tags in the text
-    if (opts['preserveHtmlTags']) {
-      text = this.preserverFactory
-        .createPreserver('preserveHtmlTags')
-        .prepare(text)
-    }
+    if (opts['preserveHtmlTags']) {}
 
     // Preserves all HTML comments in the text
killedBy: Virastar #cleanup(): Additional should preserve all HTML tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<strong title=\"نباید تغییر کند!!!!!\">سلام جهان</strong>"
Received: "<strong title= «نباید تغییر کند!» >سلام جهان</strong>"

[Survived] ConditionalExpression
src/Virastar.ts:111:9
     }
 
     // Preserves all HTML comments in the text
-    if (opts['preserveHtmlComments']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveHtmlComments')

[Survived] BlockStatement
src/Virastar.ts:111:39
     }
 
     // Preserves all HTML comments in the text
-    if (opts['preserveHtmlComments']) {
-      text = this.preserverFactory
-        .createPreserver('preserveHtmlComments')
-        .prepare(text)
-    }
+    if (opts['preserveHtmlComments']) {}
 
     // Preserves strings inside square brackets (`[]`)

[Killed] StringLiteral
src/Virastar.ts:113:26
     // Preserves all HTML comments in the text
     if (opts['preserveHtmlComments']) {
       text = this.preserverFactory
-        .createPreserver('preserveHtmlComments')
+        .createPreserver("")
         .prepare(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid preserver type

[Killed] ConditionalExpression
src/Virastar.ts:118:9
     }
 
     // Preserves strings inside square brackets (`[]`)
-    if (opts['preserveSquareBrackets']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveSquareBrackets')
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}،  __BRACKETS__PRESERVER__  و (پرانتز) تنظیم می‌کند."

[Survived] ConditionalExpression
src/Virastar.ts:118:9
     }
 
     // Preserves strings inside square brackets (`[]`)
-    if (opts['preserveSquareBrackets']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveSquareBrackets')

[Killed] StringLiteral
src/Virastar.ts:120:26
     // Preserves strings inside square brackets (`[]`)
     if (opts['preserveSquareBrackets']) {
       text = this.preserverFactory
-        .createPreserver('preserveSquareBrackets')
+        .createPreserver("")
         .prepare(text)
     }
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: Error: Invalid preserver type

[Killed] ConditionalExpression
src/Virastar.ts:125:9
     }
 
     // Preserves strings inside curly braces (`{}`)
-    if (opts['preserveCurlyBraces']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveCurlyBraces')
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه»،  __BRACES__PRESERVER__، [کروشه] و (پرانتز) تنظیم می‌کند."

[Survived] BlockStatement
src/Virastar.ts:125:38
     }
 
     // Preserves strings inside curly braces (`{}`)
-    if (opts['preserveCurlyBraces']) {
-      text = this.preserverFactory
-        .createPreserver('preserveCurlyBraces')
-        .prepare(text)
-    }
+    if (opts['preserveCurlyBraces']) {}
 
     // Preserves all URI strings in the text

[Killed] ConditionalExpression
src/Virastar.ts:132:9
     }
 
     // Preserves all URI strings in the text
-    if (opts['preserveUris']) {
+    if (true) {
       text = this.preserverFactory.createPreserver('preserveUris').prepare(text)
     }
killedBy: Virastar cleanup should preserve frontmatter data when preserveFrontMatter is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  ---
- title: My Awesome Title
+  __URI__PRESERVER__  My Awesome Title
