[Killed] ConditionalExpression
src/Virastar.ts:132:9
     }
 
     // Preserves all URI strings in the text
-    if (opts['preserveUris']) {
+    if (false) {
       text = this.preserverFactory.createPreserver('preserveUris').prepare(text)
     }
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "![alt name](https: //example.com/media/image. jpg)"

[Killed] StringLiteral
src/Virastar.ts:133:52
 
     // Preserves all URI strings in the text
     if (opts['preserveUris']) {
-      text = this.preserverFactory.createPreserver('preserveUris').prepare(text)
+      text = this.preserverFactory.createPreserver("").prepare(text)
     }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid preserver type

[Survived] ConditionalExpression
src/Virastar.ts:137:9
     }
 
     // Preserves all Markdown code blocks in the text
-    if (opts['preserveMarkDownCodeBlocks']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveMarkDownCodeBlocks')

[Survived] BlockStatement
src/Virastar.ts:137:45
     }
 
     // Preserves all Markdown code blocks in the text
-    if (opts['preserveMarkDownCodeBlocks']) {
-      text = this.preserverFactory
-        .createPreserver('preserveMarkDownCodeBlocks')
-        .prepare(text)
-    }
+    if (opts['preserveMarkDownCodeBlocks']) {}
 
     // Preserves all no-break space entities in the text

[Killed] ConditionalExpression
src/Virastar.ts:144:9
     }
 
     // Preserves all no-break space entities in the text
-    if (opts['preserveNonBreakingSpaces']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveNonBreakingSpaces')
killedBy: Virastar cleanup should return the same string when all cleanup options are disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&nbsp;امروز&nbsp;۲۰&nbsp;مرداد&nbsp;۱۴۰۰&nbsp;"
Received: " __NBSPS__PRESERVER__ امروز __NBSPS__PRESERVER__ ۲۰ __NBSPS__PRESERVER__ مرداد __NBSPS__PRESERVER__ ۱۴۰۰ __NBSPS__PRESERVER__ "

[Survived] BlockStatement
src/Virastar.ts:144:44
     }
 
     // Preserves all no-break space entities in the text
-    if (opts['preserveNonBreakingSpaces']) {
-      text = this.preserverFactory
-        .createPreserver('preserveNonBreakingSpaces')
-        .prepare(text)
-    }
+    if (opts['preserveNonBreakingSpaces']) {}
 
     // Decode HTML entities if specified

[Killed] StringLiteral
src/Virastar.ts:146:26
     // Preserves all no-break space entities in the text
     if (opts['preserveNonBreakingSpaces']) {
       text = this.preserverFactory
-        .createPreserver('preserveNonBreakingSpaces')
+        .createPreserver("")
         .prepare(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid preserver type

[Killed] ConditionalExpression
src/Virastar.ts:151:9
     }
 
     // Decode HTML entities if specified
-    if (opts['decodeHtmlEntities']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('decodeHtmlEntities')
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] BlockStatement
src/Virastar.ts:151:37
     }
 
     // Decode HTML entities if specified
-    if (opts['decodeHtmlEntities']) {
-      text = this.processorFactory
-        .createProcessor('decodeHtmlEntities')
-        .process(text)
-    }
+    if (opts['decodeHtmlEntities']) {}
 
     // preserves all html entities in the text
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] StringLiteral
src/Virastar.ts:153:26
     // Decode HTML entities if specified
     if (opts['decodeHtmlEntities']) {
       text = this.processorFactory
-        .createProcessor('decodeHtmlEntities')
+        .createProcessor("")
         .process(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/Virastar.ts:159:9
 
     // preserves all html entities in the text
     // @props: @substack/node-ent
-    if (opts['preserveHtmlEntities']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveHtmlEntities')
killedBy: Virastar cleanup should return the same string when all cleanup options are disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&nbsp;امروز&nbsp;۲۰&nbsp;مرداد&nbsp;۱۴۰۰&nbsp;"
Received: " __ENTITIES__PRESERVER__ امروز __ENTITIES__PRESERVER__ ۲۰ __ENTITIES__PRESERVER__ مرداد __ENTITIES__PRESERVER__ ۱۴۰۰ __ENTITIES__PRESERVER__ "

[Survived] ConditionalExpression
src/Virastar.ts:159:9
 
     // preserves all html entities in the text
     // @props: @substack/node-ent
-    if (opts['preserveHtmlEntities']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveHtmlEntities')

[Killed] BlockStatement
src/Virastar.ts:165:38
         .prepare(text)
     }
 
-    if (opts['normalizeEndOfLines']) {
-      text = this.processorFactory
-        .createProcessor('normalizeEndOfLines')
-        .process(text)
-    }
+    if (opts['normalizeEndOfLines']) {}
 
     if (opts['replacePersianGlyphs']) {
killedBy: Virastar normalizeEOL should replace windows end of lines with unix eol (`\n`)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 2

- متن با سلام
+ متن با سلام
  این یک تست است

[Killed] ConditionalExpression
src/Virastar.ts:165:9
         .prepare(text)
     }
 
-    if (opts['normalizeEndOfLines']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('normalizeEndOfLines')
killedBy: Virastar normalizeEOL should replace windows end of lines with unix eol (`\n`)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 3
+ Received  + 2

- متن با سلام
+ متن با سلام
  این یک تست است

[Killed] BlockStatement
src/Virastar.ts:171:39
         .process(text)
     }
 
-    if (opts['replacePersianGlyphs']) {
-      text = this.processorFactory
-        .createProcessor('replacePersianGlyphs')
-        .process(text)
-    }
+    if (opts['replacePersianGlyphs']) {}
 
     if (opts['replaceDashes']) {
killedBy: Virastar fixPersianGlyphs should replace incorrect persian glyphs with standard characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پ ع خ ک ک ر ل"
Received: "ﭖ ﻉ ﺥ ﮎ ﻛ ﺭ ﻝ"

[Killed] ConditionalExpression
src/Virastar.ts:171:9
         .process(text)
     }
 
-    if (opts['replacePersianGlyphs']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replacePersianGlyphs')
killedBy: Virastar fixPersianGlyphs should replace incorrect persian glyphs with standard characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پ ع خ ک ک ر ل"
Received: "ﭖ ﻉ ﺥ ﮎ ﻛ ﺭ ﻝ"

[Killed] ConditionalExpression
src/Virastar.ts:177:9
         .process(text)
     }
 
-    if (opts['replaceDashes']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replaceDashes')
killedBy: Virastar #cleanup() should cleanup simple sentences #6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (–) و سه علامت منهای پی در پی را به خط کشیده بلند (—) تبدیل می‌کند."
Received: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (--) و سه علامت منهای پی در پی را به خط کشیده بلند (---) تبدیل می‌کند."

[Killed] ConditionalExpression
src/Virastar.ts:177:9
         .process(text)
     }
 
-    if (opts['replaceDashes']) {
+    if (true) {
       text = this.processorFactory
         .createProcessor('replaceDashes')
killedBy: Virastar cleanup should preserve frontmatter data when preserveFrontMatter is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

- ---
+ —
  title: My Awesome Title

[Killed] StringLiteral
src/Virastar.ts:179:26
 
     if (opts['replaceDashes']) {
       text = this.processorFactory
-        .createProcessor('replaceDashes')
+        .createProcessor("")
         .process(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/Virastar.ts:183:9
         .process(text)
     }
 
-    if (opts['normalizeThreeDots']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('normalizeThreeDots')
killedBy: Virastar #cleanup() should cleanup simple sentences #4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند…"
Received: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند. . ."

[Killed] BlockStatement
src/Virastar.ts:183:37
         .process(text)
     }
 
-    if (opts['normalizeThreeDots']) {
-      text = this.processorFactory
-        .createProcessor('normalizeThreeDots')
-        .process(text)
-    }
+    if (opts['normalizeThreeDots']) {}
 
     if (opts['normalizeEllipsis']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند…"
Received: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند. . ."

[Killed] ConditionalExpression
src/Virastar.ts:189:9
         .process(text)
     }
 
-    if (opts['normalizeEllipsis']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('normalizeEllipsis')
killedBy: Virastar #cleanup(): Additional should normalize ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "…"
Received: "………"

[Killed] BlockStatement
src/Virastar.ts:189:36
         .process(text)
     }
 
-    if (opts['normalizeEllipsis']) {
-      text = this.processorFactory
-        .createProcessor('normalizeEllipsis')
-        .process(text)
-    }
+    if (opts['normalizeEllipsis']) {}
 
     if (opts['replaceEnglishQuotesPairs']) {
killedBy: Virastar #cleanup(): Additional should normalize ellipsis
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "…"
Received: "………"

[Killed] ConditionalExpression
src/Virastar.ts:195:9
         .process(text)
     }
 
-    if (opts['replaceEnglishQuotesPairs']) {
+    if (true) {
       text = this.processorFactory
         .createProcessor('replaceEnglishQuotesPairs')
killedBy: Virastar fixBracesSpacingInside should remove inside spaces for “”
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک “تست” است."
Received: "این یک «تست» است."

[Killed] BlockStatement
src/Virastar.ts:195:44
         .process(text)
     }
 
-    if (opts['replaceEnglishQuotesPairs']) {
-      text = this.processorFactory
-        .createProcessor('replaceEnglishQuotesPairs')
-        .process(text)
-    }
+    if (opts['replaceEnglishQuotesPairs']) {}
 
     if (opts['replaceEnglishQuotes']) {
killedBy: Virastar fixEnglishQuotesPairs should replace English quote pairs with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«Hello, World!»"
Received: "“Hello, World!”"

[Killed] ConditionalExpression
src/Virastar.ts:201:9
         .process(text)
     }
 
-    if (opts['replaceEnglishQuotes']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replaceEnglishQuotes')
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نق

[Killed] BlockStatement
src/Virastar.ts:201:39
         .process(text)
     }
 
-    if (opts['replaceEnglishQuotes']) {
-      text = this.processorFactory
-        .createProcessor('replaceEnglishQuotes')
-        .process(text)
-    }
+    if (opts['replaceEnglishQuotes']) {}
 
     if (opts['replaceHamzeh']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نق

[Killed] ConditionalExpression
src/Virastar.ts:207:9
         .process(text)
     }
 
-    if (opts['replaceHamzeh']) {
+    if (false) {
       if (opts['replaceHamzehArabic']) {
         text = this.processorFactory
killedBy: Virastar #cleanup() should cleanup simple sentences #5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام می‌شوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
Received: "۵. در ترکیباتی مانند «خانه‌ی پدری» که با «ه» تمام می‌شوند نشانه «ی» کسره‌ی اضافه را به «هٔ» تبدیل می‌کند."

[Killed] BlockStatement
src/Virastar.ts:207:32
         .process(text)
     }
 
-    if (opts['replaceHamzeh']) {
-      if (opts['replaceHamzehArabic']) {
-        text = this.processorFactory
-          .createProcessor('replaceHamzehArabic')
-          .process(text)
-      }
-
-      text = this.processorFactory
-        .createProcessor('replaceHamzeh')
-        .process(text)
-    } else if (opts['replaceSuffixSpacing']) {
+    if (opts['replaceHamzeh']) {} else if (opts['replaceSuffixSpacing']) {
       if (opts['replaceHamzehArabic']) {
         text = new HamzehArabicAltProcessor().process(text)
killedBy: Virastar #cleanup() should cleanup simple sentences #5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام می‌شوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
Received: "۵. در ترکیباتی مانند «خانه ی پدری» که با «ه» تمام می‌شوند نشانه «ی» کسره ی اضافه را به «هٔ» تبدیل می‌کند."

[Killed] ConditionalExpression
src/Virastar.ts:208:11
     }
 
     if (opts['replaceHamzeh']) {
-      if (opts['replaceHamzehArabic']) {
+      if (false) {
         text = this.processorFactory
           .createProcessor('replaceHamzehArabic')
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کنندهٔ انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کنندة انتهای جمله"

[Killed] BlockStatement
src/Virastar.ts:208:40
     }
 
     if (opts['replaceHamzeh']) {
-      if (opts['replaceHamzehArabic']) {
-        text = this.processorFactory
-          .createProcessor('replaceHamzehArabic')
-          .process(text)
-      }
+      if (opts['replaceHamzehArabic']) {}
 
       text = this.processorFactory
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کنندهٔ انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کنندة انتهای جمله"

[Killed] StringLiteral
src/Virastar.ts:215:26
       }
 
       text = this.processorFactory
-        .createProcessor('replaceHamzeh')
+        .createProcessor("")
         .process(text)
     } else if (opts['replaceSuffixSpacing']) {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/Virastar.ts:217:16
       text = this.processorFactory
         .createProcessor('replaceHamzeh')
         .process(text)
-    } else if (opts['replaceSuffixSpacing']) {
+    } else if (false) {
       if (opts['replaceHamzehArabic']) {
         text = new HamzehArabicAltProcessor().process(text)
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه‌ٔ پدری"

[Killed] BlockStatement
src/Virastar.ts:217:46
       text = this.processorFactory
         .createProcessor('replaceHamzeh')
         .process(text)
-    } else if (opts['replaceSuffixSpacing']) {
-      if (opts['replaceHamzehArabic']) {
-        text = new HamzehArabicAltProcessor().process(text)
-      }
-
-      text = new SuffixSpacingHamzehProcessor().process(text)
-    }
+    } else if (opts['replaceSuffixSpacing']) {}
 
     if (opts['cleanupRightToLeftMarks']) {
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه‌ٔ پدری"

[Killed] BlockStatement
src/Virastar.ts:218:40
         .createProcessor('replaceHamzeh')
         .process(text)
     } else if (opts['replaceSuffixSpacing']) {
-      if (opts['replaceHamzehArabic']) {
-        text = new HamzehArabicAltProcessor().process(text)
-      }
+      if (opts['replaceHamzehArabic']) {}
 
       text = new SuffixSpacingHamzehProcessor().process(text)
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کننده‌ی انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کنندة انتهای جمله"

[Killed] ConditionalExpression
src/Virastar.ts:218:11
         .createProcessor('replaceHamzeh')
         .process(text)
     } else if (opts['replaceSuffixSpacing']) {
-      if (opts['replaceHamzehArabic']) {
+      if (false) {
         text = new HamzehArabicAltProcessor().process(text)
       }
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کننده‌ی انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کنندة انتهای جمله"

[Killed] ConditionalExpression
src/Virastar.ts:225:9
       text = new SuffixSpacingHamzehProcessor().process(text)
     }
 
-    if (opts['cleanupRightToLeftMarks']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('cleanupRightToLeftMarks')
killedBy: Virastar cleanupRLM should replace RLM followed by persian character with ZWNJ
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این‌یک متن فارسی است."
Received: "این‏یک متن فارسی است."

[Killed] BlockStatement
src/Virastar.ts:225:42
       text = new SuffixSpacingHamzehProcessor().process(text)
     }
 
-    if (opts['cleanupRightToLeftMarks']) {
-      text = this.processorFactory
-        .createProcessor('cleanupRightToLeftMarks')
-        .process(text)
-    }
+    if (opts['cleanupRightToLeftMarks']) {}
 
     if (opts['cleanupZeroWidthNonJoiners']) {
killedBy: Virastar cleanupRLM should replace RLM followed by persian character with ZWNJ
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این‌یک متن فارسی است."
Received: "این‏یک متن فارسی است."

[Killed] BlockStatement
src/Virastar.ts:231:45
         .process(text)
     }
 
-    if (opts['cleanupZeroWidthNonJoiners']) {
-      text = this.processorFactory
-        .createProcessor('cleanupZeroWidthNonJoiners')
-        .process(text)
-    }
+    if (opts['cleanupZeroWidthNonJoiners']) {}
 
     if (opts['replaceArabicNumbers']) {
killedBy: Virastar #cleanup(): Additional should convert all soft hyphens into zwnj
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست!"
Received: "عادت به تنهایی… این دیگر از آن حرف­هاست!"

[Killed] ConditionalExpression
src/Virastar.ts:231:9
         .process(text)
     }
 
-    if (opts['cleanupZeroWidthNonJoiners']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('cleanupZeroWidthNonJoiners')
killedBy: Virastar #cleanup(): Additional should convert all soft hyphens into zwnj
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست!"
Received: "عادت به تنهایی… این دیگر از آن حرف­هاست!"

[Killed] ConditionalExpression
src/Virastar.ts:237:9
         .process(text)
     }
 
-    if (opts['replaceArabicNumbers']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replaceArabicNumbers')
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "٠١٢٣٤٥٦٧٨٩"

[Killed] BlockStatement
src/Virastar.ts:237:39
         .process(text)
     }
 
-    if (opts['replaceArabicNumbers']) {
-      text = this.processorFactory
-        .createProcessor('replaceArabicNumbers')
-        .process(text)
-    }
+    if (opts['replaceArabicNumbers']) {}
 
     // word tokenizer
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "٠١٢٣٤٥٦٧٨٩"

[Killed] StringLiteral
src/Virastar.ts:239:26
 
     if (opts['replaceArabicNumbers']) {
       text = this.processorFactory
-        .createProcessor('replaceArabicNumbers')
+        .createProcessor("")
         .process(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] BlockStatement
src/Virastar.ts:246:39
     // word tokenizer
     text = this.wordTokenizer(text, opts)
 
-    if (opts['normalizeJalaliDates']) {
-      text = this.processorFactory
-        .createProcessor('normalizeJalaliDates')
-        .process(text)
-    }
+    if (opts['normalizeJalaliDates']) {}
 
     if (opts['replacePrefixSpacing']) {
killedBy: Virastar #cleanup(): Additional extra: normalizeDates(): reorders date parts with slash as delimiter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۳۵۵/۱۰/۲۳"
Received: "۲۳/۱۰/۱۳۵۵"

[Killed] ConditionalExpression
src/Virastar.ts:246:9
     // word tokenizer
     text = this.wordTokenizer(text, opts)
 
-    if (opts['normalizeJalaliDates']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('normalizeJalaliDates')
killedBy: Virastar #cleanup(): Additional extra: normalizeDates(): reorders date parts with slash as delimiter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۳۵۵/۱۰/۲۳"
Received: "۲۳/۱۰/۱۳۵۵"

[Killed] StringLiteral
src/Virastar.ts:248:26
 
     if (opts['normalizeJalaliDates']) {
       text = this.processorFactory
-        .createProcessor('normalizeJalaliDates')
+        .createProcessor("")
         .process(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/Virastar.ts:252:9
         .process(text)
     }
 
-    if (opts['replacePrefixSpacing']) {
+    if (true) {
       text = this.processorFactory
         .createProcessor('replacePrefixSpacing')
killedBy: Virastar normalizeEOL should replace windows end of lines with unix eol (`\n`)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  متن با سلام
  این یک تست است
  و برای تست

[Killed] BlockStatement
src/Virastar.ts:252:39
         .process(text)
     }
 
-    if (opts['replacePrefixSpacing']) {
-      text = this.processorFactory
-        .createProcessor('replacePrefixSpacing')
-        .process(text)
-    }
+    if (opts['replacePrefixSpacing']) {}
 
     if (opts['replaceSuffixSpacing']) {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می کند تا متون فارسی زیباتر و درست‌تری بنویسید."

[Killed] BlockStatement
src/Virastar.ts:258:39
         .process(text)
     }
 
-    if (opts['replaceSuffixSpacing']) {
-      text = this.processorFactory
-        .createProcessor('replaceSuffixSpacing')
-        .process(text)    }
+    if (opts['replaceSuffixSpacing']) {}
 
     if (opts['replaceSuffixMisc']) {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیبا تر و درست تری بنویسید."

[Killed] ConditionalExpression
src/Virastar.ts:258:9
         .process(text)
     }
 
-    if (opts['replaceSuffixSpacing']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replaceSuffixSpacing')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیبا تر و درست تری بنویسید."

[Killed] StringLiteral
src/Virastar.ts:260:26
 
     if (opts['replaceSuffixSpacing']) {
       text = this.processorFactory
-        .createProcessor('replaceSuffixSpacing')
+        .createProcessor("")
         .process(text)    }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] BlockStatement
src/Virastar.ts:263:36
         .createProcessor('replaceSuffixSpacing')
         .process(text)    }
 
-    if (opts['replaceSuffixMisc']) {
-      text = this.processorFactory
-        .createProcessor('replaceSuffixMisc')
-        .process(text)
-    }
+    if (opts['replaceSuffixMisc']) {}
 
     if (opts['replaceSpacingForBracesAndQuotes']) {
killedBy: Virastar #cleanup(): Additional extra: fixSuffixMisc()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ای بر روی آب"
Received: "خانه‌یی بر روی آب"

[Killed] ConditionalExpression
src/Virastar.ts:263:9
         .createProcessor('replaceSuffixSpacing')
         .process(text)    }
 
-    if (opts['replaceSuffixMisc']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replaceSuffixMisc')
killedBy: Virastar #cleanup(): Additional extra: fixSuffixMisc()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ای بر روی آب"
Received: "خانه‌یی بر روی آب"

[Killed] ConditionalExpression
src/Virastar.ts:269:9
         .process(text)
     }
 
-    if (opts['replaceSpacingForBracesAndQuotes']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replacesExtraSpacesAroundBraces')
killedBy: Virastar #cleanup() should cleanup simple sentences #7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۷. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می»، «تر» و «ترین» یک نیم فاصله قرار می‌دهد. بین ویرگول یا نقطه و کلمه قبل آن فاصله را حذف می‌کند."
Received: "۷. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می»، «تر»و«ترین» یک نیم فاصله قرار

[Killed] ConditionalExpression
src/Virastar.ts:269:9
         .process(text)
     }
 
-    if (opts['replaceSpacingForBracesAndQuotes']) {
+    if (true) {
       text = this.processorFactory
         .createProcessor('replacesExtraSpacesAroundBraces')
killedBy: Virastar cleanup should preserve Markdown links in text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "برای خواندن بیشتر، به [ویکی‌پدیا](https://fa.wikipedia.org) مراجعه کنید."
Received: "برای خواندن بیشتر، به [ویکی‌پدیا] (https://fa.wikipedia.org) مراجعه کنید."

[Killed] ConditionalExpression
src/Virastar.ts:275:9
         .process(text)
     }
 
-    if (opts['cleanupExtraMarks']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('cleanupExtraMarks')
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟؟؟!!!!!!!"
