[Killed] BlockStatement
src/Virastar.ts:275:36
         .process(text)
     }
 
-    if (opts['cleanupExtraMarks']) {
-      text = this.processorFactory
-        .createProcessor('cleanupExtraMarks')
-        .process(text)
-    }
+    if (opts['cleanupExtraMarks']) {}
 
     if (opts['removeSpacingForPunctuations']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟؟؟!!!!!!!"

[Killed] ConditionalExpression
src/Virastar.ts:281:9
         .process(text)
     }
 
-    if (opts['removeSpacingForPunctuations']) {
+    if (true) {
       text = this.processorFactory
         .createProcessor('removeSpacingForPunctuations')
killedBy: Virastar cleanup should return the same string when all cleanup options are disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&nbsp;امروز&nbsp;۲۰&nbsp;مرداد&nbsp;۱۴۰۰&nbsp;"
Received: "&nbsp; امروز&nbsp; ۲۰&nbsp; مرداد&nbsp; ۱۴۰۰&nbsp;"

[Killed] ConditionalExpression
src/Virastar.ts:281:9
         .process(text)
     }
 
-    if (opts['removeSpacingForPunctuations']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('removeSpacingForPunctuations')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید ."

[Killed] BlockStatement
src/Virastar.ts:287:36
         .process(text)
     }
 
-    if (opts['normalizeKashidas']) {
-      text = this.processorFactory
-        .createProcessor('normalizeKashidas')
-        .process(text)
-    }
+    if (opts['normalizeKashidas']) {}
 
     if (opts['cleanupKashidas']) {
killedBy: Virastar #cleanup() should replace kashidas to ndash in parenthetic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "– که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم –"
Received: "ـ که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم ـ"

[Killed] ConditionalExpression
src/Virastar.ts:287:9
         .process(text)
     }
 
-    if (opts['normalizeKashidas']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('normalizeKashidas')
killedBy: Virastar #cleanup() should replace kashidas to ndash in parenthetic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "– که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم –"
Received: "ـ که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم ـ"

[Killed] ConditionalExpression
src/Virastar.ts:293:9
         .process(text)
     }
 
-    if (opts['cleanupKashidas']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('cleanupKashidas')
killedBy: Virastar #cleanup() should remove all kashida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلامت"
Received: "سلامـــت"

[Killed] BlockStatement
src/Virastar.ts:293:34
         .process(text)
     }
 
-    if (opts['cleanupKashidas']) {
-      text = this.processorFactory
-        .createProcessor('cleanupKashidas')
-        .process(text)
-    }
+    if (opts['cleanupKashidas']) {}
 
     if (opts['normalizeMarkDownBraces']) {
killedBy: Virastar #cleanup() should remove all kashida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلامت"
Received: "سلامـــت"

[Killed] ConditionalExpression
src/Virastar.ts:299:9
         .process(text)
     }
 
-    if (opts['normalizeMarkDownBraces']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('normalizeMarkDownBraces')
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name] (https://example.com/media/image.jpg)"

[Killed] BlockStatement
src/Virastar.ts:299:42
         .process(text)
     }
 
-    if (opts['normalizeMarkDownBraces']) {
-      text = this.processorFactory
-        .createProcessor('normalizeMarkDownBraces')
-        .process(text)
-    }
+    if (opts['normalizeMarkDownBraces']) {}
 
     if (opts['normalizeMarkDownLists']) {
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name] (https://example.com/media/image.jpg)"

[Killed] StringLiteral
src/Virastar.ts:301:26
 
     if (opts['normalizeMarkDownBraces']) {
       text = this.processorFactory
-        .createProcessor('normalizeMarkDownBraces')
+        .createProcessor("")
         .process(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] BlockStatement
src/Virastar.ts:305:41
         .process(text)
     }
 
-    if (opts['normalizeMarkDownLists']) {
-      text = this.processorFactory
-        .createProcessor('normalizeMarkDownLists')
-        .process(text)
-    }
+    if (opts['normalizeMarkDownLists']) {}
 
     // doing it again after `fixPunctuationSpacing()`
killedBy: Virastar markdownNormalizeLists should remove extra line between two items list for bulleted lists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

  * item 1
+
  * item 2

[Killed] ConditionalExpression
src/Virastar.ts:305:9
         .process(text)
     }
 
-    if (opts['normalizeMarkDownLists']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('normalizeMarkDownLists')
killedBy: Virastar markdownNormalizeLists should remove extra line between two items list for bulleted lists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

  * item 1
+
  * item 2

[Killed] ConditionalExpression
src/Virastar.ts:312:9
     }
 
     // doing it again after `fixPunctuationSpacing()`
-    if (opts['replaceSpacingForBracesAndQuotes']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replacesSpacesInsideBraces')
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (، )، یا ن

[Killed] BlockStatement
src/Virastar.ts:312:51
     }
 
     // doing it again after `fixPunctuationSpacing()`
-    if (opts['replaceSpacingForBracesAndQuotes']) {
-      text = this.processorFactory
-        .createProcessor('replacesSpacesInsideBraces')
-        .process(text)
-    }
+    if (opts['replaceSpacingForBracesAndQuotes']) {}
 
     if (opts['replaceMiscSpacing']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (، )، یا ن

[Killed] StringLiteral
src/Virastar.ts:314:26
     // doing it again after `fixPunctuationSpacing()`
     if (opts['replaceSpacingForBracesAndQuotes']) {
       text = this.processorFactory
-        .createProcessor('replacesSpacesInsideBraces')
+        .createProcessor("")
         .process(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/Virastar.ts:318:9
         .process(text)
     }
 
-    if (opts['replaceMiscSpacing']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('replaceMiscSpacing')
killedBy: Virastar fixMiscSpacing should remove space before parentheses when given misc cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "مثال(ص) جمله(س) کلمه(ع)"
Received: "مثال (ص) جمله (س) کلمه (ع)"

[Killed] BlockStatement
src/Virastar.ts:318:37
         .process(text)
     }
 
-    if (opts['replaceMiscSpacing']) {
-      text = this.processorFactory
-        .createProcessor('replaceMiscSpacing')
-        .process(text)
-    }
+    if (opts['replaceMiscSpacing']) {}
 
     if (opts['removeDiacritics']) {
killedBy: Virastar fixMiscSpacing should remove space before parentheses when given misc cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "مثال(ص) جمله(س) کلمه(ع)"
Received: "مثال (ص) جمله (س) کلمه (ع)"

[Killed] ConditionalExpression
src/Virastar.ts:324:9
         .process(text)
     }
 
-    if (opts['removeDiacritics']) {
+    if (true) {
       text = this.processorFactory
         .createProcessor('removeDiacritics')
killedBy: Virastar #cleanup() should not put space after dots in numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پوسته دوهزارونوزده، حداقل به نسخه وردپرس ۴٫۷ نیاز دارد. شما نسخه %s را اجرا می‌کنید. لطفاً وردپرس خود را ارتقا دهید و دوباره سعی کنید."
Received: "پوسته دوهزارونوزده، حداقل به نسخه وردپرس ۴٫۷ نیاز دارد. شما نسخه %s را اجرا می‌کنید. لطفا وردپرس خود را ارتقا دهید و دوباره سعی کنید."

[Killed] BlockStatement
src/Virastar.ts:324:35
         .process(text)
     }
 
-    if (opts['removeDiacritics']) {
-      text = this.processorFactory
-        .createProcessor('removeDiacritics')
-        .process(text)
-    } else if (opts['replaceDiacritics']) {
+    if (opts['removeDiacritics']) {} else if (opts['replaceDiacritics']) {
       text = this.processorFactory
         .createProcessor('replaceDiacritics')
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "اذا عمت البلدان الفتن فعلیکم بقم وحوالیها ونواحیها فان البلاء مدفوع عنها"
Received: "اذا عَمَّتِ الْبُلْدانَ الْفِتَنُ فَعَلَیکمْ بِقُمْ وَحَوالیها وَنَواحیها فَانَ الْبَلاءَ مَدْفُوعٌ عَنْها"

[Killed] BlockStatement
src/Virastar.ts:328:43
       text = this.processorFactory
         .createProcessor('removeDiacritics')
         .process(text)
-    } else if (opts['replaceDiacritics']) {
-      text = this.processorFactory
-        .createProcessor('replaceDiacritics')
-        .process(text)
-    }
+    } else if (opts['replaceDiacritics']) {}
 
     if (opts['cleanupSpacing']) {
killedBy: Virastar #cleanup(): Additional extra: fixDiacritics():‌ cleans more than one diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "لطفاً"
Received: "لطفاًً"

[Killed] ConditionalExpression
src/Virastar.ts:328:16
       text = this.processorFactory
         .createProcessor('removeDiacritics')
         .process(text)
-    } else if (opts['replaceDiacritics']) {
+    } else if (false) {
       text = this.processorFactory
         .createProcessor('replaceDiacritics')
killedBy: Virastar #cleanup(): Additional extra: fixDiacritics():‌ cleans more than one diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "لطفاً"
Received: "لطفاًً"

[Killed] BlockStatement
src/Virastar.ts:334:33
         .process(text)
     }
 
-    if (opts['cleanupSpacing']) {
-      text = this.processorFactory
-        .createProcessor('cleanupSpacing')
-        .process(text)
-    }
+    if (opts['cleanupSpacing']) {}
 
     if (opts['cleanupZeroWidthNonJoiners']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪  ۴۵۶"

[Killed] ConditionalExpression
src/Virastar.ts:334:9
         .process(text)
     }
 
-    if (opts['cleanupSpacing']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('cleanupSpacing')
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪  ۴۵۶"

[Killed] BlockStatement
src/Virastar.ts:340:45
         .process(text)
     }
 
-    if (opts['cleanupZeroWidthNonJoiners']) {
-      text = new ZeroWidthNonJoinerLateProcessor().process(text)
-    }
+    if (opts['cleanupZeroWidthNonJoiners']) {}
 
     if (opts['cleanupLineBreaks']) {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیبا‌تر و درست‌تری بنویسید."

[Killed] BlockStatement
src/Virastar.ts:344:36
       text = new ZeroWidthNonJoinerLateProcessor().process(text)
     }
 
-    if (opts['cleanupLineBreaks']) {
-      text = this.processorFactory
-        .createProcessor('cleanupLineBreaks')
-        .process(text)
-    }
+    if (opts['cleanupLineBreaks']) {}
 
     // bringing back entities
killedBy: Virastar cleanupLineBreaks should replace more than two contiguous line-breaks with two line-breaks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  0
+ Received  + 12

  خط ۱

+

[Killed] ConditionalExpression
src/Virastar.ts:344:9
       text = new ZeroWidthNonJoinerLateProcessor().process(text)
     }
 
-    if (opts['cleanupLineBreaks']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('cleanupLineBreaks')
killedBy: Virastar cleanupLineBreaks should replace more than two contiguous line-breaks with two line-breaks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  -  0
+ Received  + 12

  خط ۱

+

[Killed] StringLiteral
src/Virastar.ts:346:26
 
     if (opts['cleanupLineBreaks']) {
       text = this.processorFactory
-        .createProcessor('cleanupLineBreaks')
+        .createProcessor("")
         .process(text)
     }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] BlockStatement
src/Virastar.ts:351:39
     }
 
     // bringing back entities
-    if (opts['preserveHtmlEntities']) {
-      text = this.preserverFactory
-        .createPreserver('preserveHtmlEntities')
-        .restore(text)
-    }
+    if (opts['preserveHtmlEntities']) {}
 
     // bringing back nbsps
killedBy: Virastar cleanup should bring back all preserved html entities
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام &nbsp; جهان"
Received: "سلام  __ENTITIES__PRESERVER__  جهان"

[Killed] ConditionalExpression
src/Virastar.ts:351:9
     }
 
     // bringing back entities
-    if (opts['preserveHtmlEntities']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveHtmlEntities')
killedBy: Virastar cleanup should bring back all preserved html entities
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام &nbsp; جهان"
Received: "سلام  __ENTITIES__PRESERVER__  جهان"

[Killed] ConditionalExpression
src/Virastar.ts:358:9
     }
 
     // bringing back nbsps
-    if (opts['preserveNonBreakingSpaces']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveNonBreakingSpaces')
killedBy: Virastar cleanup should preserve all no-break space entities when `preserveNonBreakingSpaces` is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک &nbsp; متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."
Received: "این یک  __NBSPS__PRESERVER__  متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."

[Killed] BlockStatement
src/Virastar.ts:358:44
     }
 
     // bringing back nbsps
-    if (opts['preserveNonBreakingSpaces']) {
-      text = this.preserverFactory
-        .createPreserver('preserveNonBreakingSpaces')
-        .restore(text)
-    }
+    if (opts['preserveNonBreakingSpaces']) {}
 
     // bringing back Markdown code blocks
killedBy: Virastar cleanup should preserve all no-break space entities when `preserveNonBreakingSpaces` is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک &nbsp; متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."
Received: "این یک  __NBSPS__PRESERVER__  متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."

[Survived] BlockStatement
src/Virastar.ts:365:45
     }
 
     // bringing back Markdown code blocks
-    if (opts['preserveMarkDownCodeBlocks']) {
-      text = this.preserverFactory
-        .createPreserver('preserveMarkDownCodeBlocks')
-        .restore(text)
-    }
+    if (opts['preserveMarkDownCodeBlocks']) {}
 
     // bringing back URIs

[Survived] ConditionalExpression
src/Virastar.ts:365:9
     }
 
     // bringing back Markdown code blocks
-    if (opts['preserveMarkDownCodeBlocks']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveMarkDownCodeBlocks')

[Killed] ConditionalExpression
src/Virastar.ts:372:9
     }
 
     // bringing back URIs
-    if (opts['preserveUris']) {
+    if (false) {
       text = this.preserverFactory.createPreserver('preserveUris').restore(text)
     }
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "![alt name](__MD_LINK__PRESERVER__)"

[Killed] BlockStatement
src/Virastar.ts:372:31
     }
 
     // bringing back URIs
-    if (opts['preserveUris']) {
-      text = this.preserverFactory.createPreserver('preserveUris').restore(text)
-    }
+    if (opts['preserveUris']) {}
 
     // bringing back braces
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "![alt name](__MD_LINK__PRESERVER__)"

[Killed] ConditionalExpression
src/Virastar.ts:377:9
     }
 
     // bringing back braces
-    if (opts['preserveCurlyBraces']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveCurlyBraces')
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{سلام}، این {جمله} یک {تست} است."
Received: " __BRACES__PRESERVER__ ، این  __BRACES__PRESERVER__  یک  __BRACES__PRESERVER__  است."

[Killed] BlockStatement
src/Virastar.ts:377:38
     }
 
     // bringing back braces
-    if (opts['preserveCurlyBraces']) {
-      text = this.preserverFactory
-        .createPreserver('preserveCurlyBraces')
-        .restore(text)
-    }
+    if (opts['preserveCurlyBraces']) {}
 
     // bringing back brackets
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{سلام}، این {جمله} یک {تست} است."
Received: " __BRACES__PRESERVER__ ، این  __BRACES__PRESERVER__  یک  __BRACES__PRESERVER__  است."

[Killed] StringLiteral
src/Virastar.ts:379:26
     // bringing back braces
     if (opts['preserveCurlyBraces']) {
       text = this.preserverFactory
-        .createPreserver('preserveCurlyBraces')
+        .createPreserver("")
         .restore(text)
     }
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: Error: Invalid preserver type

[Killed] BlockStatement
src/Virastar.ts:384:41
     }
 
     // bringing back brackets
-    if (opts['preserveSquareBrackets']) {
-      text = this.preserverFactory
-        .createPreserver('preserveSquareBrackets')
-        .restore(text)
-    }
+    if (opts['preserveSquareBrackets']) {}
 
     // bringing back HTML comments
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[سلام]، این [جمله] یک [تست] است."
Received: " __BRACKETS__PRESERVER__ ، این  __BRACKETS__PRESERVER__  یک  __BRACKETS__PRESERVER__  است."

[Killed] ConditionalExpression
src/Virastar.ts:384:9
     }
 
     // bringing back brackets
-    if (opts['preserveSquareBrackets']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveSquareBrackets')
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[سلام]، این [جمله] یک [تست] است."
Received: " __BRACKETS__PRESERVER__ ، این  __BRACKETS__PRESERVER__  یک  __BRACKETS__PRESERVER__  است."

[Killed] ConditionalExpression
src/Virastar.ts:391:9
     }
 
     // bringing back HTML comments
-    if (opts['preserveHtmlComments']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveHtmlComments')
killedBy: Virastar cleanup should preserve and restore HTML comments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  ↵
        <div>
-         <!-- This is a comment -->

[Killed] BlockStatement
src/Virastar.ts:391:39
     }
 
     // bringing back HTML comments
-    if (opts['preserveHtmlComments']) {
-      text = this.preserverFactory
-        .createPreserver('preserveHtmlComments')
-        .restore(text)
-    }
+    if (opts['preserveHtmlComments']) {}
 
     // bringing back HTML tags
killedBy: Virastar cleanup should preserve and restore HTML comments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  ↵
        <div>
-         <!-- This is a comment -->

[Killed] ConditionalExpression
src/Virastar.ts:398:9
     }
 
     // bringing back HTML tags
-    if (opts['preserveHtmlTags']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveHtmlTags')
killedBy: Virastar #cleanup(): Additional should preserve all HTML tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<strong title=\"نباید تغییر کند!!!!!\">سلام جهان</strong>"
Received: "__HTML__PRESERVER__ سلام جهان __HTML__PRESERVER__"

[Killed] BlockStatement
src/Virastar.ts:398:35
     }
 
     // bringing back HTML tags
-    if (opts['preserveHtmlTags']) {
-      text = this.preserverFactory
-        .createPreserver('preserveHtmlTags')
-        .restore(text)
-    }
+    if (opts['preserveHtmlTags']) {}
 
     // bringing back frontmatter
killedBy: Virastar #cleanup(): Additional should preserve all HTML tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<strong title=\"نباید تغییر کند!!!!!\">سلام جهان</strong>"
Received: "__HTML__PRESERVER__ سلام جهان __HTML__PRESERVER__"

[Survived] ConditionalExpression
src/Virastar.ts:405:9
     }
 
     // bringing back frontmatter
-    if (opts['preserveFrontMatter']) {
+    if (true) {
       text = this.preserverFactory
         .createPreserver('preserveFrontMatter')

[Survived] ConditionalExpression
src/Virastar.ts:405:9
     }
 
     // bringing back frontmatter
-    if (opts['preserveFrontMatter']) {
+    if (false) {
       text = this.preserverFactory
         .createPreserver('preserveFrontMatter')

[Killed] ConditionalExpression
src/Virastar.ts:411:9
         .restore(text)
     }
 
-    if (opts['removeLeadingAndTrailingSpaces']) {
+    if (false) {
       text = this.processorFactory
         .createProcessor('removeLeadingAndTrailingSpaces')
killedBy: Virastar #cleanup() should replace more than one space with just a single one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام جهان، من ویراستار هستم!"
Received: " سلام جهان، من ویراستار هستم!"

[Killed] ConditionalExpression
src/Virastar.ts:411:9
         .restore(text)
     }
 
-    if (opts['removeLeadingAndTrailingSpaces']) {
+    if (true) {
       text = this.processorFactory
         .createProcessor('removeLeadingAndTrailingSpaces')
killedBy: Virastar cleanup should preserve and restore HTML comments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 7
+ Received  + 5

-
-       <div>
-         <!-- This is a comment -->

[Killed] BlockStatement
src/Virastar.ts:415:12
       text = this.processorFactory
         .createProcessor('removeLeadingAndTrailingSpaces')
         .process(text)
-    } else {
-      // removes single space paddings around the string
-      text = text.replace(/^ /g, '').replace(/ $/g, '')
-    }
+    } else {}
 
     return text
killedBy: Virastar cleanup should return the same string when all cleanup options are disabled
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&nbsp;امروز&nbsp;۲۰&nbsp;مرداد&nbsp;۱۴۰۰&nbsp;"
Received: " &nbsp;امروز&nbsp;۲۰&nbsp;مرداد&nbsp;۱۴۰۰&nbsp; "

[Killed] Regex
src/Virastar.ts:417:46
         .process(text)
     } else {
       // removes single space paddings around the string
-      text = text.replace(/^ /g, '').replace(/ $/g, '')
+      text = text.replace(/^ /g, '').replace(/ /g, '')
     }
 
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{سلام}، این {جمله} یک {تست} است."
Received: "{سلام}،این{جمله}یک{تست}است."

[Killed] Regex
src/Virastar.ts:424:7
   }
   private wordTokenizer(text: string, opts: Record<string, any>) {
     return text.replace(
-      /(^|\s+)([[({"'“«]?)(\S+)([\])}"'”»]?)(?=($|\s+))/g,
+      /(^|\s+)([[({"'“«]?)(\S+)([\])}"'”»]?)(?!($|\s+))/g,
       (matched, _before, _leadings, word, trailings, after) => {
         // should not replace to persian chars in english phrases
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمك مي کند تا متون فارسي زیباتر و درست تري بنویسید."

[Killed] Regex
src/Virastar.ts:424:7
   }
   private wordTokenizer(text: string, opts: Record<string, any>) {
     return text.replace(
-      /(^|\s+)([[({"'“«]?)(\S+)([\])}"'”»]?)(?=($|\s+))/g,
+      /(^|\S+)([[({"'“«]?)(\S+)([\])}"'”»]?)(?=($|\s+))/g,
       (matched, _before, _leadings, word, trailings, after) => {
         // should not replace to persian chars in english phrases
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه», {آکولاد}, [کروشه] و (پرانتز) تنظیم می‌کند."

[Killed] ConditionalExpression
src/Virastar.ts:427:13
       /(^|\s+)([[({"'“«]?)(\S+)([\])}"'”»]?)(?=($|\s+))/g,
       (matched, _before, _leadings, word, trailings, after) => {
         // should not replace to persian chars in english phrases
-        if (word.match(/[a-zA-Z\-_]{2,}/g)) {
+        if (true) {
           return matched
         }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."

[Killed] ConditionalExpression
src/Virastar.ts:427:13
       /(^|\s+)([[({"'“«]?)(\S+)([\])}"'”»]?)(?=($|\s+))/g,
       (matched, _before, _leadings, word, trailings, after) => {
         // should not replace to persian chars in english phrases
-        if (word.match(/[a-zA-Z\-_]{2,}/g)) {
+        if (false) {
           return matched
         }
killedBy: Virastar #cleanup() should not replace English numbers in English phrases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عزیز ATM74 در IBM-96 ۰۸۵ B 95BCS"
Received: "عزیز ATM۷۴ در IBM-۹۶ ۰۸۵ B ۹۵BCS"

[Killed] ConditionalExpression
src/Virastar.ts:434:11
         // should not touch sprintf directives
         // @source: https://stackoverflow.com/a/8915445/
         if (
-          word.match(
-            /%(?:\d+\$)?[+-]?(?:[ 0]|'.)?-?\d*(?:\.\d+)?[bcdeEufFgGosxX]/g,
-          )
+          true
         ) {
           return matched
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."
