[Killed] ConditionalExpression
src/Virastar.ts:434:11
         // should not touch sprintf directives
         // @source: https://stackoverflow.com/a/8915445/
         if (
-          word.match(
-            /%(?:\d+\$)?[+-]?(?:[ 0]|'.)?-?\d*(?:\.\d+)?[bcdeEufFgGosxX]/g,
-          )
+          false
         ) {
           return matched
killedBy: Virastar #cleanup() should not replace sprintf directives
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این افزونه به php نسخه «%1$s» نیاز دارد. شما از نسخه (%2$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."
Received: "این افزونه به php نسخه «%۱$s» نیاز دارد. شما از نسخه (%۲$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."

[Killed] Regex
src/Virastar.ts:435:13
         // @source: https://stackoverflow.com/a/8915445/
         if (
           word.match(
-            /%(?:\d+\$)?[+-]?(?:[ 0]|'.)?-?\d*(?:\.\d+)?[bcdeEufFgGosxX]/g,
+            /%(?:\d+\$)?[+-]?(?:[ 0]|'.)?-\d*(?:\.\d+)?[bcdeEufFgGosxX]/g,
           )
         ) {
killedBy: Virastar #cleanup() should not replace sprintf directives
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این افزونه به php نسخه «%1$s» نیاز دارد. شما از نسخه (%2$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."
Received: "این افزونه به php نسخه «%۱$s» نیاز دارد. شما از نسخه (%۲$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."

[Killed] Regex
src/Virastar.ts:435:13
         // @source: https://stackoverflow.com/a/8915445/
         if (
           word.match(
-            /%(?:\d+\$)?[+-]?(?:[ 0]|'.)?-?\d*(?:\.\d+)?[bcdeEufFgGosxX]/g,
+            /%(?:\D+\$)?[+-]?(?:[ 0]|'.)?-?\d*(?:\.\d+)?[bcdeEufFgGosxX]/g,
           )
         ) {
killedBy: Virastar #cleanup() should not replace sprintf directives
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این افزونه به php نسخه «%1$s» نیاز دارد. شما از نسخه (%2$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."
Received: "این افزونه به php نسخه «%۱$s» نیاز دارد. شما از نسخه (%۲$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."

[Killed] BlockStatement
src/Virastar.ts:437:11
           word.match(
             /%(?:\d+\$)?[+-]?(?:[ 0]|'.)?-?\d*(?:\.\d+)?[bcdeEufFgGosxX]/g,
           )
-        ) {
-          return matched
-        }
+        ) {}
 
         // should not touch numbers in html entities
killedBy: Virastar #cleanup() should not replace sprintf directives
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این افزونه به php نسخه «%1$s» نیاز دارد. شما از نسخه (%2$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."
Received: "این افزونه به php نسخه «%۱$s» نیاز دارد. شما از نسخه (%۲$s) استفاده می‌کنید. لطفاً پس از ارتقا دوباره تلاش کنید."

[Killed] ConditionalExpression
src/Virastar.ts:442:13
         }
 
         // should not touch numbers in html entities
-        if (word.match(/&#\d+;/g)) {
+        if (true) {
           return matched
         }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."

[NoCoverage] BlockStatement
src/Virastar.ts:442:36
         }
 
         // should not touch numbers in html entities
-        if (word.match(/&#\d+;/g)) {
-          return matched
-        }
+        if (word.match(/&#\d+;/g)) {}
 
         // skips converting english numbers of ordered lists in markdown

[Killed] ConditionalExpression
src/Virastar.ts:448:11
 
         // skips converting english numbers of ordered lists in markdown
         if (
-          opts['skip_markdown_ordered_lists_numbers_conversion'] &&
-          (matched + trailings + after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
+          true
         ) {
           return matched
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."

[Survived] LogicalOperator
src/Virastar.ts:448:11
 
         // skips converting english numbers of ordered lists in markdown
         if (
-          opts['skip_markdown_ordered_lists_numbers_conversion'] &&
-          (matched + trailings + after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
+          opts['skip_markdown_ordered_lists_numbers_conversion'] || (matched + trailings + after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
         ) {
           return matched

[Killed] ArithmeticOperator
src/Virastar.ts:449:12
         // skips converting english numbers of ordered lists in markdown
         if (
           opts['skip_markdown_ordered_lists_numbers_conversion'] &&
-          (matched + trailings + after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
+          (matched + trailings - after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
         ) {
           return matched
killedBy: Virastar cleanup should return matched text when skip_markdown_ordered_lists_numbers_conversion is true
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).match is not a function

[Survived] ArithmeticOperator
src/Virastar.ts:449:12
         // skips converting english numbers of ordered lists in markdown
         if (
           opts['skip_markdown_ordered_lists_numbers_conversion'] &&
-          (matched + trailings + after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
+          (matched - trailings + after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
         ) {
           return matched

[Survived] BlockStatement
src/Virastar.ts:450:11
         if (
           opts['skip_markdown_ordered_lists_numbers_conversion'] &&
           (matched + trailings + after).match(/(?:\r?\n|\r\n?|(?:^|\n))\d+\.\s/)
-        ) {
-          return matched
-        }
+        ) {}
 
         if (opts['replaceEnglishNumbers']) {

[Killed] BlockStatement
src/Virastar.ts:454:44
           return matched
         }
 
-        if (opts['replaceEnglishNumbers']) {
-          matched = this.processorFactory
-            .createProcessor('replaceEnglishNumbers')
-            .process(matched)
-        }
+        if (opts['replaceEnglishNumbers']) {}
 
         if (opts['replaceNumeralSymbols']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "1. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] ConditionalExpression
src/Virastar.ts:454:13
           return matched
         }
 
-        if (opts['replaceEnglishNumbers']) {
+        if (true) {
           matched = this.processorFactory
             .createProcessor('replaceEnglishNumbers')
killedBy: Virastar markdownNormalizeLists should remove extra line between two items list for bulleted lists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

- * item 1
+ * item ۱
- * item 2

[Killed] BlockStatement
src/Virastar.ts:460:44
             .process(matched)
         }
 
-        if (opts['replaceNumeralSymbols']) {
-          matched = this.processorFactory
-            .createProcessor('replaceNumeralSymbols')
-            .process(matched)
-        }
+        if (opts['replaceNumeralSymbols']) {}
 
         if (opts['replacePunctuations']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲% ۴۵۶"

[Killed] ConditionalExpression
src/Virastar.ts:460:13
             .process(matched)
         }
 
-        if (opts['replaceNumeralSymbols']) {
+        if (false) {
           matched = this.processorFactory
             .createProcessor('replaceNumeralSymbols')
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲% ۴۵۶"

[Killed] ConditionalExpression
src/Virastar.ts:466:13
             .process(matched)
         }
 
-        if (opts['replacePunctuations']) {
+        if (false) {
           matched = this.processorFactory
             .createProcessor('replacePunctuations')
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند, مثلا تبدیل کامای انگلیسی به ویرگول (,), یا نق

[Killed] BlockStatement
src/Virastar.ts:466:42
             .process(matched)
         }
 
-        if (opts['replacePunctuations']) {
-          matched = this.processorFactory
-            .createProcessor('replacePunctuations')
-            .process(matched)
-        }
+        if (opts['replacePunctuations']) {}
 
         if (opts['replaceMiscNonPersianChars']) {
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند, مثلا تبدیل کامای انگلیسی به ویرگول (,), یا نق

[Killed] ConditionalExpression
src/Virastar.ts:472:13
             .process(matched)
         }
 
-        if (opts['replaceMiscNonPersianChars']) {
+        if (false) {
           matched = this.processorFactory
             .createProcessor('replaceMiscNonPersianChars')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."

[Killed] ConditionalExpression
src/Virastar.ts:472:13
             .process(matched)
         }
 
-        if (opts['replaceMiscNonPersianChars']) {
+        if (true) {
           matched = this.processorFactory
             .createProcessor('replaceMiscNonPersianChars')
killedBy: Virastar removeDiacritics should remove all diacritic characters from the input text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "درخت قديمي زيرآب"
Received: "درخت قدیمی زیرآب"

[Killed] StringLiteral
src/Virastar.ts:474:30
 
         if (opts['replaceMiscNonPersianChars']) {
           matched = this.processorFactory
-            .createProcessor('replaceMiscNonPersianChars')
+            .createProcessor("")
             .process(matched)
         }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] BlockStatement
src/Virastar.ts:478:43
             .process(matched)
         }
 
-        if (opts['replaceQuestionMarks']) {
-          matched = this.processorFactory
-            .createProcessor('replaceQuestionMarks')
-            .process(matched)
-        }
+        if (opts['replaceQuestionMarks']) {}
 
         return matched
killedBy: Virastar #cleanup(): Additional should normalize question/exclamation marks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست؟!"
Received: "عادت به تنهایی… این دیگر از آن حرف‌هاست?!"

[Killed] ConditionalExpression
src/Virastar.ts:478:13
             .process(matched)
         }
 
-        if (opts['replaceQuestionMarks']) {
+        if (false) {
           matched = this.processorFactory
             .createProcessor('replaceQuestionMarks')
killedBy: Virastar #cleanup(): Additional should normalize question/exclamation marks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست؟!"
Received: "عادت به تنهایی… این دیگر از آن حرف‌هاست?!"

[Killed] BlockStatement
src/Virastar.ts:494:80
    * @param options - The options to parse.
    * @returns An object with default options overridden by the given options.
    */
-  private parseOptions(options: Record<string, any> = {}): Record<string, any> {
-    // Initialize an object with default options.
-    const parsed: Record<string, any> = { ...this.defaultOptions }
-
-    // Override default options with given options.
-    for (const key in options) {
-      if (Object.prototype.hasOwnProperty.call(options, key)) {
-        parsed[key] = options[key]
-      }
-    }
-
-    // Return the parsed options object.
-    return parsed
-  }
+  private parseOptions(options: Record<string, any> = {}): Record<string, any> {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'preserveFrontMatter')

[Killed] BlockStatement
src/Virastar.ts:499:32
     const parsed: Record<string, any> = { ...this.defaultOptions }
 
     // Override default options with given options.
-    for (const key in options) {
-      if (Object.prototype.hasOwnProperty.call(options, key)) {
-        parsed[key] = options[key]
-      }
-    }
+    for (const key in options) {}
 
     // Return the parsed options object.
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه‌ٔ پدری"

[Killed] BlockStatement
src/Virastar.ts:500:63
 
     // Override default options with given options.
     for (const key in options) {
-      if (Object.prototype.hasOwnProperty.call(options, key)) {
-        parsed[key] = options[key]
-      }
+      if (Object.prototype.hasOwnProperty.call(options, key)) {}
     }
 
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه‌ٔ پدری"

[Killed] ConditionalExpression
src/Virastar.ts:500:11
 
     // Override default options with given options.
     for (const key in options) {
-      if (Object.prototype.hasOwnProperty.call(options, key)) {
+      if (false) {
         parsed[key] = options[key]
       }
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه‌ٔ پدری"
