[NoCoverage] BlockStatement
src/index.ts:6:53
 
 export { Virastar } from './Virastar'
 
-export default function (options?: VirastarOptions) {
-  return new Virastar(options)
-}
+export default function (options?: VirastarOptions) {}
 
