[Killed] BooleanLiteral
src/preservers/PreserverFactory.ts:29:9
     const { preservers } = PreserverFactory
     let preserver = preservers[type]
 
-    if (!preserver) {
+    if (preserver) {
       switch (type) {
         case 'preserveCurlyBraces':
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of null (reading 'prepare')

[Killed] ConditionalExpression
src/preservers/PreserverFactory.ts:29:9
     const { preservers } = PreserverFactory
     let preserver = preservers[type]
 
-    if (!preserver) {
+    if (true) {
       switch (type) {
         case 'preserveCurlyBraces':
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "![alt name](undefined)"

[Survived] ConditionalExpression
src/preservers/PreserverFactory.ts:31:9
 
     if (!preserver) {
       switch (type) {
-        case 'preserveCurlyBraces':
-          preserver = new CurlyBracesPreserver()
-          break
+        case 'preserveCurlyBraces':
         case 'preserveFrontMatter':
           preserver = new FrontMatterPreserver()

[Killed] StringLiteral
src/preservers/PreserverFactory.ts:31:14
 
     if (!preserver) {
       switch (type) {
-        case 'preserveCurlyBraces':
+        case "":
           preserver = new CurlyBracesPreserver()
           break
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: Error: Invalid preserver type

[Survived] ConditionalExpression
src/preservers/PreserverFactory.ts:34:9
         case 'preserveCurlyBraces':
           preserver = new CurlyBracesPreserver()
           break
-        case 'preserveFrontMatter':
-          preserver = new FrontMatterPreserver()
-          break
+        case 'preserveFrontMatter':
         case 'preserveHtmlComments':
           preserver = new HtmlCommentPreserver()

[Survived] ConditionalExpression
src/preservers/PreserverFactory.ts:37:9
         case 'preserveFrontMatter':
           preserver = new FrontMatterPreserver()
           break
-        case 'preserveHtmlComments':
-          preserver = new HtmlCommentPreserver()
-          break
+        case 'preserveHtmlComments':
         case 'preserveHtmlEntities':
           preserver = new HtmlEntityPreserver()

[Survived] ConditionalExpression
src/preservers/PreserverFactory.ts:40:9
         case 'preserveHtmlComments':
           preserver = new HtmlCommentPreserver()
           break
-        case 'preserveHtmlEntities':
-          preserver = new HtmlEntityPreserver()
-          break
+        case 'preserveHtmlEntities':
         case 'preserveHtmlTags':
           preserver = new HtmlPreserver()

[Killed] StringLiteral
src/preservers/PreserverFactory.ts:40:14
         case 'preserveHtmlComments':
           preserver = new HtmlCommentPreserver()
           break
-        case 'preserveHtmlEntities':
+        case "":
           preserver = new HtmlEntityPreserver()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid preserver type

[Survived] ConditionalExpression
src/preservers/PreserverFactory.ts:43:9
         case 'preserveHtmlEntities':
           preserver = new HtmlEntityPreserver()
           break
-        case 'preserveHtmlTags':
-          preserver = new HtmlPreserver()
-          break
+        case 'preserveHtmlTags':
         case 'preserveNonBreakingSpaces':
           preserver = new NonBreakingSpacePreserver()

[Killed] ConditionalExpression
src/preservers/PreserverFactory.ts:46:9
         case 'preserveHtmlTags':
           preserver = new HtmlPreserver()
           break
-        case 'preserveNonBreakingSpaces':
-          preserver = new NonBreakingSpacePreserver()
-          break
+        case 'preserveNonBreakingSpaces':
         case 'preserveSquareBrackets':
           preserver = new SquareBracketsPreserver()
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [   کروشه  ] و (پرانتز) تنظیم می‌کند."

[Survived] ConditionalExpression
src/preservers/PreserverFactory.ts:49:9
         case 'preserveNonBreakingSpaces':
           preserver = new NonBreakingSpacePreserver()
           break
-        case 'preserveSquareBrackets':
-          preserver = new SquareBracketsPreserver()
-          break
+        case 'preserveSquareBrackets':
         case 'preserveUris':
           preserver = new UriPreserver()

[Killed] StringLiteral
src/preservers/PreserverFactory.ts:49:14
         case 'preserveNonBreakingSpaces':
           preserver = new NonBreakingSpacePreserver()
           break
-        case 'preserveSquareBrackets':
+        case "":
           preserver = new SquareBracketsPreserver()
           break
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: Error: Invalid preserver type

[Survived] ConditionalExpression
src/preservers/PreserverFactory.ts:52:9
         case 'preserveSquareBrackets':
           preserver = new SquareBracketsPreserver()
           break
-        case 'preserveUris':
-          preserver = new UriPreserver()
-          break
+        case 'preserveUris':
         case 'preserveMarkDownCodeBlocks':
           preserver = new MarkDownCodeBlockPreserver()

[Killed] ConditionalExpression
src/preservers/PreserverFactory.ts:55:9
         case 'preserveUris':
           preserver = new UriPreserver()
           break
-        case 'preserveMarkDownCodeBlocks':
-          preserver = new MarkDownCodeBlockPreserver()
-          break
+        case 'preserveMarkDownCodeBlocks':
         default:
           throw new Error('Invalid preserver type')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid preserver type

[Killed] StringLiteral
src/preservers/PreserverFactory.ts:55:14
         case 'preserveUris':
           preserver = new UriPreserver()
           break
-        case 'preserveMarkDownCodeBlocks':
+        case "":
           preserver = new MarkDownCodeBlockPreserver()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid preserver type

[NoCoverage] ConditionalExpression
src/preservers/PreserverFactory.ts:58:9
         case 'preserveMarkDownCodeBlocks':
           preserver = new MarkDownCodeBlockPreserver()
           break
-        default:
-          throw new Error('Invalid preserver type')
+        default:
       }
 

[NoCoverage] StringLiteral
src/preservers/PreserverFactory.ts:59:27
           preserver = new MarkDownCodeBlockPreserver()
           break
         default:
-          throw new Error('Invalid preserver type')
+          throw new Error("")
       }
 
