[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:9:15
 export class DecodeHtmlEntitiesProcessor extends BaseProcessor {
   // Object that contains the HTML entities and their corresponding decoded values
   private readonly htmlEntities: { [key: string]: string | number } = {
-    'sbquo;': '\u201a',
+    'sbquo;': "",
     'lsquo;': '\u2018',
     'lsquor;': '\u201a',

[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:10:15
   // Object that contains the HTML entities and their corresponding decoded values
   private readonly htmlEntities: { [key: string]: string | number } = {
     'sbquo;': '\u201a',
-    'lsquo;': '\u2018',
+    'lsquo;': "",
     'lsquor;': '\u201a',
     'ldquo;': '\u201c',

[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:11:16
   private readonly htmlEntities: { [key: string]: string | number } = {
     'sbquo;': '\u201a',
     'lsquo;': '\u2018',
-    'lsquor;': '\u201a',
+    'lsquor;': "",
     'ldquo;': '\u201c',
     'ldquor;': '\u201e',

[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:12:15
     'sbquo;': '\u201a',
     'lsquo;': '\u2018',
     'lsquor;': '\u201a',
-    'ldquo;': '\u201c',
+    'ldquo;': "",
     'ldquor;': '\u201e',
     'rdquo;': '\u201d',

[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:13:16
     'lsquo;': '\u2018',
     'lsquor;': '\u201a',
     'ldquo;': '\u201c',
-    'ldquor;': '\u201e',
+    'ldquor;': "",
     'rdquo;': '\u201d',
     'rdquor;': '\u201d',

[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:15:16
     'ldquo;': '\u201c',
     'ldquor;': '\u201e',
     'rdquo;': '\u201d',
-    'rdquor;': '\u201d',
+    'rdquor;': "",
     'rsquo;': '\u2019',
     'rsquor;': '\u2019',

[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:16:15
     'ldquor;': '\u201e',
     'rdquo;': '\u201d',
     'rdquor;': '\u201d',
-    'rsquo;': '\u2019',
+    'rsquo;': "",
     'rsquor;': '\u2019',
     'apos;': "'",

[Survived] StringLiteral
src/processors/DecodeHtmlEntitiesProcessor.ts:23:13
     QUOT: '"',
     'quot;': '"',
     quot: '"',
-    'zwj;': '\u200d',
+    'zwj;': "",
     'ZWNJ;': '\u200c',
     'zwnj;': '\u200c',

[Killed] Regex
src/processors/DecodeHtmlEntitiesProcessor.ts:36:7
    */
   public process(text: string): string {
     return text.replace(
-      /&(#?[^;\W]+;?)/g,
+      /&(#?[^;\W];?)/g,
       // Replaced the anonymous function with an arrow function for better readability
       (_matched: string, match: string): string => {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] Regex
src/processors/DecodeHtmlEntitiesProcessor.ts:36:7
    */
   public process(text: string): string {
     return text.replace(
-      /&(#?[^;\W]+;?)/g,
+      /&(#[^;\W]+;?)/g,
       // Replaced the anonymous function with an arrow function for better readability
       (_matched: string, match: string): string => {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:41:14
       (_matched: string, match: string): string => {
         let n: RegExpExecArray | null
 
-        if ((n = /^#(\d+);?$/.exec(match))) {
+        if ((false)) {
           // Decodes numeric entities
           return String.fromCharCode(parseInt(n[1]!, 10))
killedBy: Virastar decodeHTMLEntities should decode HTML entities in the given text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "یک نمایش‌نامه معروف به مرد خانه‌دار و دوبله‌ی فیلم‌های بلند لنگری"

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:41:14
       (_matched: string, match: string): string => {
         let n: RegExpExecArray | null
 
-        if ((n = /^#(\d+);?$/.exec(match))) {
+        if ((true)) {
           // Decodes numeric entities
           return String.fromCharCode(parseInt(n[1]!, 10))
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:44:21
         if ((n = /^#(\d+);?$/.exec(match))) {
           // Decodes numeric entities
           return String.fromCharCode(parseInt(n[1]!, 10))
-        } else if ((n = /^#[Xx]([A-Fa-f0-9]+);?/.exec(match))) {
+        } else if ((true)) {
           // Decodes hexadecimal entities
           return String.fromCharCode(parseInt(n[1]!, 16))
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:44:21
         if ((n = /^#(\d+);?$/.exec(match))) {
           // Decodes numeric entities
           return String.fromCharCode(parseInt(n[1]!, 10))
-        } else if ((n = /^#[Xx]([A-Fa-f0-9]+);?/.exec(match))) {
+        } else if ((false)) {
           // Decodes hexadecimal entities
           return String.fromCharCode(parseInt(n[1]!, 16))
killedBy: Virastar decodeHTMLEntities should handle hexadecimal entities
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام دنیا"
Received: "&#x633;&#x644;&#x627;&#x645;&#x20;&#x62f;&#x646;&#x6cc;&#x627;"

[Killed] BlockStatement
src/processors/DecodeHtmlEntitiesProcessor.ts:47:16
         } else if ((n = /^#[Xx]([A-Fa-f0-9]+);?/.exec(match))) {
           // Decodes hexadecimal entities
           return String.fromCharCode(parseInt(n[1]!, 16))
-        } else {
-          const hasSemi = /;$/.test(match)
-          const withoutSemi = hasSemi ? match.replace(/;$/, '') : match
-          const target =
-            this.htmlEntities[withoutSemi] ||
-            (hasSemi && this.htmlEntities[match])
-
-          if (typeof target === 'number') {
-            // Converts number to character
-            return String.fromCharCode(target)
-          } else if (typeof target === 'string') {
-            return target
-          } else {
-            return `&${match}`
-          }
-        }
+        } else {}
       },
     )
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "undefinedگيومه‌های فارسيundefined"

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:51:13
           const hasSemi = /;$/.test(match)
           const withoutSemi = hasSemi ? match.replace(/;$/, '') : match
           const target =
-            this.htmlEntities[withoutSemi] ||
-            (hasSemi && this.htmlEntities[match])
+            false
 
           if (typeof target === 'number') {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:51:13
           const hasSemi = /;$/.test(match)
           const withoutSemi = hasSemi ? match.replace(/;$/, '') : match
           const target =
-            this.htmlEntities[withoutSemi] ||
-            (hasSemi && this.htmlEntities[match])
+            true
 
           if (typeof target === 'number') {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:52:14
           const withoutSemi = hasSemi ? match.replace(/;$/, '') : match
           const target =
             this.htmlEntities[withoutSemi] ||
-            (hasSemi && this.htmlEntities[match])
+            (false)
 
           if (typeof target === 'number') {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&apos;گیومه‌های فارسی&apos;"

[Killed] LogicalOperator
src/processors/DecodeHtmlEntitiesProcessor.ts:52:14
           const withoutSemi = hasSemi ? match.replace(/;$/, '') : match
           const target =
             this.htmlEntities[withoutSemi] ||
-            (hasSemi && this.htmlEntities[match])
+            (hasSemi || this.htmlEntities[match])
 
           if (typeof target === 'number') {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&apos;گیومه‌های فارسی&apos;"

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:54:15
             this.htmlEntities[withoutSemi] ||
             (hasSemi && this.htmlEntities[match])
 
-          if (typeof target === 'number') {
+          if (true) {
             // Converts number to character
             return String.fromCharCode(target)
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: " گیومه‌های فارسی "

[Killed] EqualityOperator
src/processors/DecodeHtmlEntitiesProcessor.ts:54:15
             this.htmlEntities[withoutSemi] ||
             (hasSemi && this.htmlEntities[match])
 
-          if (typeof target === 'number') {
+          if (typeof target !== 'number') {
             // Converts number to character
             return String.fromCharCode(target)
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: " گیومه‌های فارسی "

[Killed] ConditionalExpression
src/processors/DecodeHtmlEntitiesProcessor.ts:57:22
           if (typeof target === 'number') {
             // Converts number to character
             return String.fromCharCode(target)
-          } else if (typeof target === 'string') {
+          } else if (false) {
             return target
           } else {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] EqualityOperator
src/processors/DecodeHtmlEntitiesProcessor.ts:57:22
           if (typeof target === 'number') {
             // Converts number to character
             return String.fromCharCode(target)
-          } else if (typeof target === 'string') {
+          } else if (typeof target !== 'string') {
             return target
           } else {
killedBy: Virastar #cleanup() should converts back html named character references
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«گیومه‌های فارسی»"
Received: "&quot;گیومه‌های فارسی&quot;"

[Killed] BlockStatement
src/processors/DecodeHtmlEntitiesProcessor.ts:59:18
             return String.fromCharCode(target)
           } else if (typeof target === 'string') {
             return target
-          } else {
-            return `&${match}`
-          }
+          } else {}
         }
       },
killedBy: Virastar decodeHTMLEntities should handle invalid HTML entities
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک متن با entity های نامعتبر &invalid; است."
Received: "این یک متن با entity های نامعتبر undefined است."
