[NoCoverage] ArrayDeclaration
src/processors/FlipPunctuationProcessor.ts:16:17
    * @returns The processed text
    */
   public process(text: string): string {
-    const end = ['-']
+    const end = []
     const start = ['!', '.', '،', '…', '"']
     const before = []

[NoCoverage] ArrayDeclaration
src/processors/FlipPunctuationProcessor.ts:17:19
    */
   public process(text: string): string {
     const end = ['-']
-    const start = ['!', '.', '،', '…', '"']
+    const start = []
     const before = []
     const after = []

[NoCoverage] StringLiteral
src/processors/FlipPunctuationProcessor.ts:17:20
    */
   public process(text: string): string {
     const end = ['-']
-    const start = ['!', '.', '،', '…', '"']
+    const start = ["", '.', '،', '…', '"']
     const before = []
     const after = []

[NoCoverage] ArrayDeclaration
src/processors/FlipPunctuationProcessor.ts:18:20
   public process(text: string): string {
     const end = ['-']
     const start = ['!', '.', '،', '…', '"']
-    const before = []
+    const before = ["Stryker was here"]
     const after = []
 

[NoCoverage] ConditionalExpression
src/processors/FlipPunctuationProcessor.ts:23:26
 
     text = this.fixThreeDots(text)
 
-    for (let iStart = 0; iStart < start.length; iStart++) {
+    for (let iStart = 0; false; iStart++) {
       const sElement = start[iStart]
       const sReg = new RegExp(`^\\${sElement}`, 'i')

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:23:59
 
     text = this.fixThreeDots(text)
 
-    for (let iStart = 0; iStart < start.length; iStart++) {
-      const sElement = start[iStart]
-      const sReg = new RegExp(`^\\${sElement}`, 'i')
-      if (sReg.test(text)) {
-        text = text.replace(sReg, '').trim()
-        after.push(sElement)
-      }
-    }
+    for (let iStart = 0; iStart < start.length; iStart++) {}
 
     for (let iEnd = 0; iEnd < end.length; iEnd++) {

[NoCoverage] ConditionalExpression
src/processors/FlipPunctuationProcessor.ts:26:11
     for (let iStart = 0; iStart < start.length; iStart++) {
       const sElement = start[iStart]
       const sReg = new RegExp(`^\\${sElement}`, 'i')
-      if (sReg.test(text)) {
+      if (true) {
         text = text.replace(sReg, '').trim()
         after.push(sElement)

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:26:28
     for (let iStart = 0; iStart < start.length; iStart++) {
       const sElement = start[iStart]
       const sReg = new RegExp(`^\\${sElement}`, 'i')
-      if (sReg.test(text)) {
-        text = text.replace(sReg, '').trim()
-        after.push(sElement)
-      }
+      if (sReg.test(text)) {}
     }
 

[NoCoverage] MethodExpression
src/processors/FlipPunctuationProcessor.ts:27:16
       const sElement = start[iStart]
       const sReg = new RegExp(`^\\${sElement}`, 'i')
       if (sReg.test(text)) {
-        text = text.replace(sReg, '').trim()
+        text = text.replace(sReg, '')
         after.push(sElement)
       }

[NoCoverage] StringLiteral
src/processors/FlipPunctuationProcessor.ts:27:35
       const sElement = start[iStart]
       const sReg = new RegExp(`^\\${sElement}`, 'i')
       if (sReg.test(text)) {
-        text = text.replace(sReg, '').trim()
+        text = text.replace(sReg, "Stryker was here!").trim()
         after.push(sElement)
       }

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:32:51
       }
     }
 
-    for (let iEnd = 0; iEnd < end.length; iEnd++) {
-      const eElement = end[iEnd]
-      const eReg = new RegExp(`\\${eElement}$`, 'i')
-      if (eReg.test(text)) {
-        text = text.replace(eReg, '').trim()
-        before.push(eElement)
-      }
-    }
+    for (let iEnd = 0; iEnd < end.length; iEnd++) {}
 
     for (let iBefore = 0; iBefore < before.length; iBefore++) {

[NoCoverage] UpdateOperator
src/processors/FlipPunctuationProcessor.ts:32:43
       }
     }
 
-    for (let iEnd = 0; iEnd < end.length; iEnd++) {
+    for (let iEnd = 0; iEnd < end.length; iEnd--) {
       const eElement = end[iEnd]
       const eReg = new RegExp(`\\${eElement}$`, 'i')

[NoCoverage] StringLiteral
src/processors/FlipPunctuationProcessor.ts:34:31
 
     for (let iEnd = 0; iEnd < end.length; iEnd++) {
       const eElement = end[iEnd]
-      const eReg = new RegExp(`\\${eElement}$`, 'i')
+      const eReg = new RegExp(``, 'i')
       if (eReg.test(text)) {
         text = text.replace(eReg, '').trim()

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:35:28
     for (let iEnd = 0; iEnd < end.length; iEnd++) {
       const eElement = end[iEnd]
       const eReg = new RegExp(`\\${eElement}$`, 'i')
-      if (eReg.test(text)) {
-        text = text.replace(eReg, '').trim()
-        before.push(eElement)
-      }
+      if (eReg.test(text)) {}
     }
 

[NoCoverage] ConditionalExpression
src/processors/FlipPunctuationProcessor.ts:35:11
     for (let iEnd = 0; iEnd < end.length; iEnd++) {
       const eElement = end[iEnd]
       const eReg = new RegExp(`\\${eElement}$`, 'i')
-      if (eReg.test(text)) {
+      if (true) {
         text = text.replace(eReg, '').trim()
         before.push(eElement)

[NoCoverage] MethodExpression
src/processors/FlipPunctuationProcessor.ts:36:16
       const eElement = end[iEnd]
       const eReg = new RegExp(`\\${eElement}$`, 'i')
       if (eReg.test(text)) {
-        text = text.replace(eReg, '').trim()
+        text = text.replace(eReg, '')
         before.push(eElement)
       }

[NoCoverage] StringLiteral
src/processors/FlipPunctuationProcessor.ts:36:35
       const eElement = end[iEnd]
       const eReg = new RegExp(`\\${eElement}$`, 'i')
       if (eReg.test(text)) {
-        text = text.replace(eReg, '').trim()
+        text = text.replace(eReg, "Stryker was here!").trim()
         before.push(eElement)
       }

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:41:63
       }
     }
 
-    for (let iBefore = 0; iBefore < before.length; iBefore++) {
-      text = `${before[iBefore]} ${text}`
-    }
+    for (let iBefore = 0; iBefore < before.length; iBefore++) {}
 
     for (let iAfter = 0; iAfter < after.length; iAfter++) {

[NoCoverage] EqualityOperator
src/processors/FlipPunctuationProcessor.ts:41:27
       }
     }
 
-    for (let iBefore = 0; iBefore < before.length; iBefore++) {
+    for (let iBefore = 0; iBefore <= before.length; iBefore++) {
       text = `${before[iBefore]} ${text}`
     }

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:45:59
       text = `${before[iBefore]} ${text}`
     }
 
-    for (let iAfter = 0; iAfter < after.length; iAfter++) {
-      text += after[iAfter]
-    }
+    for (let iAfter = 0; iAfter < after.length; iAfter++) {}
 
     return this.normalizeEllipsis(text)

[NoCoverage] ConditionalExpression
src/processors/FlipPunctuationProcessor.ts:45:26
       text = `${before[iBefore]} ${text}`
     }
 
-    for (let iAfter = 0; iAfter < after.length; iAfter++) {
+    for (let iAfter = 0; false; iAfter++) {
       text += after[iAfter]
     }

[NoCoverage] AssignmentOperator
src/processors/FlipPunctuationProcessor.ts:46:7
     }
 
     for (let iAfter = 0; iAfter < after.length; iAfter++) {
-      text += after[iAfter]
+      text -= after[iAfter]
     }
 

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:59:46
    * @param text The input text to fix punctuation spacing.
    * @returns The text with fixed punctuation spacing for three dots.
    */
-  private fixThreeDots(text: string): string {
-    return new ThreeDotsProcessor().process(text)
-  }
+  private fixThreeDots(text: string): string {}
 
   /**

[NoCoverage] BlockStatement
src/processors/FlipPunctuationProcessor.ts:68:51
    * @param text The text to normalize.
    * @returns The normalized text.
    */
-  private normalizeEllipsis(text: string): string {
-    return new EllipsisProcessor().process(text)
-  }
+  private normalizeEllipsis(text: string): string {}
 }
 
