[NoCoverage] BlockStatement
src/processors/PersianNumbersProcessor.ts:10:40
 
    * @returns The string with Persian numbers converted to Arabic numbers.
    */
-  public process(text: string): string {
-    // Using regex to match Persian numbers and replacing them with Arabic numbers
-    return text.replace(/[\u0660-\u0669\u06f0-\u06f9]/g, function (char) {
-      // Converting each matched Persian number to an Arabic number
-      return (char.charCodeAt(0) & 0xf).toString()
-    })
-  }
+  public process(text: string): string {}
 }
 

[NoCoverage] BlockStatement
src/processors/PersianNumbersProcessor.ts:12:74
    */
   public process(text: string): string {
     // Using regex to match Persian numbers and replacing them with Arabic numbers
-    return text.replace(/[\u0660-\u0669\u06f0-\u06f9]/g, function (char) {
-      // Converting each matched Persian number to an Arabic number
-      return (char.charCodeAt(0) & 0xf).toString()
-    })
+    return text.replace(/[\u0660-\u0669\u06f0-\u06f9]/g, function (char) {})
   }
 }
