[Killed] BooleanLiteral
src/processors/ProcessorFactory.ts:84:9
     const { processors } = ProcessorFactory
     let processor = processors[type]
 
-    if (!processor) {
+    if (processor) {
       switch (type) {
         case 'removeLeadingAndTrailingSpaces':
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of null (reading 'process')

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:84:9
     const { processors } = ProcessorFactory
     let processor = processors[type]
 
-    if (!processor) {
+    if (false) {
       switch (type) {
         case 'removeLeadingAndTrailingSpaces':
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of null (reading 'process')

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:86:9
 
     if (!processor) {
       switch (type) {
-        case 'removeLeadingAndTrailingSpaces':
-          processor = new LeadingAndTrailingSpaceProcessor()
-          break
+        case 'removeLeadingAndTrailingSpaces':
         case 'cleanupExtraMarks':
           processor = new ExtraMarksProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: " ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید. "

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:89:9
         case 'removeLeadingAndTrailingSpaces':
           processor = new LeadingAndTrailingSpaceProcessor()
           break
-        case 'cleanupExtraMarks':
-          processor = new ExtraMarksProcessor()
-          break
+        case 'cleanupExtraMarks':
         case 'cleanupKashidas':
           processor = new KashidasProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟؟؟!!!!!!!"

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:92:9
         case 'cleanupExtraMarks':
           processor = new ExtraMarksProcessor()
           break
-        case 'cleanupKashidas':
-          processor = new KashidasProcessor()
-          break
+        case 'cleanupKashidas':
         case 'cleanupLineBreaks':
           processor = new LineBreakProcessor()

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:92:14
         case 'cleanupExtraMarks':
           processor = new ExtraMarksProcessor()
           break
-        case 'cleanupKashidas':
+        case "":
           processor = new KashidasProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:95:9
         case 'cleanupKashidas':
           processor = new KashidasProcessor()
           break
-        case 'cleanupLineBreaks':
-          processor = new LineBreakProcessor()
-          break
+        case 'cleanupLineBreaks':
         case 'cleanupRightToLeftMarks':
           processor = new RightToLeftMarkProcessor()

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:95:14
         case 'cleanupKashidas':
           processor = new KashidasProcessor()
           break
-        case 'cleanupLineBreaks':
+        case "":
           processor = new LineBreakProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:98:9
         case 'cleanupLineBreaks':
           processor = new LineBreakProcessor()
           break
-        case 'cleanupRightToLeftMarks':
-          processor = new RightToLeftMarkProcessor()
-          break
+        case 'cleanupRightToLeftMarks':
         case 'cleanupSpacing':
           processor = new SpacingProcessor()

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:101:9
         case 'cleanupRightToLeftMarks':
           processor = new RightToLeftMarkProcessor()
           break
-        case 'cleanupSpacing':
-          processor = new SpacingProcessor()
-          break
+        case 'cleanupSpacing':
         case 'cleanupZeroWidthNonJoiners':
           processor = new ZeroWidthNonJoinerProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪  ۴۵۶"

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:101:14
         case 'cleanupRightToLeftMarks':
           processor = new RightToLeftMarkProcessor()
           break
-        case 'cleanupSpacing':
+        case "":
           processor = new SpacingProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:104:9
         case 'cleanupSpacing':
           processor = new SpacingProcessor()
           break
-        case 'cleanupZeroWidthNonJoiners':
-          processor = new ZeroWidthNonJoinerProcessor()
-          break
+        case 'cleanupZeroWidthNonJoiners':
         case 'decodeHtmlEntities':
           processor = new DecodeHtmlEntitiesProcessor()

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:107:9
         case 'cleanupZeroWidthNonJoiners':
           processor = new ZeroWidthNonJoinerProcessor()
           break
-        case 'decodeHtmlEntities':
-          processor = new DecodeHtmlEntitiesProcessor()
-          break
+        case 'decodeHtmlEntities':
         case 'normalizeEllipsis':
           processor = new EllipsisProcessor()

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:110:9
         case 'decodeHtmlEntities':
           processor = new DecodeHtmlEntitiesProcessor()
           break
-        case 'normalizeEllipsis':
-          processor = new EllipsisProcessor()
-          break
+        case 'normalizeEllipsis':
         case 'normalizeEndOfLines':
           processor = new EndOfLineProcessor()

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:113:9
         case 'normalizeEllipsis':
           processor = new EllipsisProcessor()
           break
-        case 'normalizeEndOfLines':
-          processor = new EndOfLineProcessor()
-          break
+        case 'normalizeEndOfLines':
         case 'normalizeJalaliDates':
           processor = new DateNormalizerProcessor()

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:113:14
         case 'normalizeEllipsis':
           processor = new EllipsisProcessor()
           break
-        case 'normalizeEndOfLines':
+        case "":
           processor = new EndOfLineProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:116:9
         case 'normalizeEndOfLines':
           processor = new EndOfLineProcessor()
           break
-        case 'normalizeJalaliDates':
-          processor = new DateNormalizerProcessor()
-          break
+        case 'normalizeJalaliDates':
         case 'normalizeKashidas':
           processor = new KashidasAsParentheticProcessor()

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:119:9
         case 'normalizeJalaliDates':
           processor = new DateNormalizerProcessor()
           break
-        case 'normalizeKashidas':
-          processor = new KashidasAsParentheticProcessor()
-          break
+        case 'normalizeKashidas':
         case 'normalizeMarkDownBraces':
           processor = new MarkdownNormalizerProcessor()

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:122:9
         case 'normalizeKashidas':
           processor = new KashidasAsParentheticProcessor()
           break
-        case 'normalizeMarkDownBraces':
-          processor = new MarkdownNormalizerProcessor()
-          break
+        case 'normalizeMarkDownBraces':
         case 'normalizeMarkDownLists':
           processor = new MarkdownListProcessor()

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:125:9
         case 'normalizeMarkDownBraces':
           processor = new MarkdownNormalizerProcessor()
           break
-        case 'normalizeMarkDownLists':
-          processor = new MarkdownListProcessor()
-          break
+        case 'normalizeMarkDownLists':
         case 'normalizeThreeDots':
           processor = new ThreeDotsProcessor()

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:128:9
         case 'normalizeMarkDownLists':
           processor = new MarkdownListProcessor()
           break
-        case 'normalizeThreeDots':
-          processor = new ThreeDotsProcessor()
-          break
+        case 'normalizeThreeDots':
         case 'removeDiacritics':
           processor = new RemoveDiacriticsProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند…"
Received: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند. . ."

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:131:9
         case 'normalizeThreeDots':
           processor = new ThreeDotsProcessor()
           break
-        case 'removeDiacritics':
-          processor = new RemoveDiacriticsProcessor()
-          break
+        case 'removeDiacritics':
         case 'removeSpacingForPunctuations':
           processor = new PunctuationSpacingProcessor()
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "اذا عمت البلدان الفتن فعلیکم بقم وحوالیها ونواحیها فان البلاء مدفوع عنها"
Received: "اذا عَمَّتِ الْبُلْدانَ الْفِتَنُ فَعَلَیکمْ بِقُمْ وَحَوالیها وَنَواحیها فَانَ الْبَلاءَ مَدْفُوعٌ عَنْها"

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:131:14
         case 'normalizeThreeDots':
           processor = new ThreeDotsProcessor()
           break
-        case 'removeDiacritics':
+        case "":
           processor = new RemoveDiacriticsProcessor()
           break
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:134:9
         case 'removeDiacritics':
           processor = new RemoveDiacriticsProcessor()
           break
-        case 'removeSpacingForPunctuations':
-          processor = new PunctuationSpacingProcessor()
-          break
+        case 'removeSpacingForPunctuations':
         case 'replaceArabicNumbers':
           processor = new ArabicNumbersProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید ."

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:137:9
         case 'removeSpacingForPunctuations':
           processor = new PunctuationSpacingProcessor()
           break
-        case 'replaceArabicNumbers':
-          processor = new ArabicNumbersProcessor()
-          break
+        case 'replaceArabicNumbers':
         case 'replaceDashes':
           processor = new DashProcessor()

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:137:14
         case 'removeSpacingForPunctuations':
           processor = new PunctuationSpacingProcessor()
           break
-        case 'replaceArabicNumbers':
+        case "":
           processor = new ArabicNumbersProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:140:9
         case 'replaceArabicNumbers':
           processor = new ArabicNumbersProcessor()
           break
-        case 'replaceDashes':
-          processor = new DashProcessor()
-          break
+        case 'replaceDashes':
         case 'replaceDiacritics':
           processor = new DiacriticsProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (–) و سه علامت منهای پی در پی را به خط کشیده بلند (—) تبدیل می‌کند."
Received: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (--) و سه علامت منهای پی در پی را به خط کشیده بلند (---) تبدیل می‌کند."

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:143:9
         case 'replaceDashes':
           processor = new DashProcessor()
           break
-        case 'replaceDiacritics':
-          processor = new DiacriticsProcessor()
-          break
+        case 'replaceDiacritics':
         case 'replaceEnglishNumbers':
           processor = new EnglishNumbersProcessor()

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:146:9
         case 'replaceDiacritics':
           processor = new DiacriticsProcessor()
           break
-        case 'replaceEnglishNumbers':
-          processor = new EnglishNumbersProcessor()
-          break
+        case 'replaceEnglishNumbers':
         case 'replaceEnglishQuotes':
           processor = new EnglishQuotesProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "1. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:146:14
         case 'replaceDiacritics':
           processor = new DiacriticsProcessor()
           break
-        case 'replaceEnglishNumbers':
+        case "":
           processor = new EnglishNumbersProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:149:9
         case 'replaceEnglishNumbers':
           processor = new EnglishNumbersProcessor()
           break
-        case 'replaceEnglishQuotes':
-          processor = new EnglishQuotesProcessor()
-          break
+        case 'replaceEnglishQuotes':
         case 'replaceEnglishQuotesPairs':
           processor = new EnglishQuotesPairsProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نق

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:149:14
         case 'replaceEnglishNumbers':
           processor = new EnglishNumbersProcessor()
           break
-        case 'replaceEnglishQuotes':
+        case "":
           processor = new EnglishQuotesProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:152:9
         case 'replaceEnglishQuotes':
           processor = new EnglishQuotesProcessor()
           break
-        case 'replaceEnglishQuotesPairs':
-          processor = new EnglishQuotesPairsProcessor()
-          break
+        case 'replaceEnglishQuotesPairs':
         case 'replaceHamzeh':
           processor = new HamzehProcessor()

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:155:9
         case 'replaceEnglishQuotesPairs':
           processor = new EnglishQuotesPairsProcessor()
           break
-        case 'replaceHamzeh':
-          processor = new HamzehProcessor()
-          break
+        case 'replaceHamzeh':
         case 'replaceHamzehArabic':
           processor = new HamzehArabicProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام می‌شوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
Received: "۵. در ترکیباتی مانند «خانه ی پدری» که با «ه» تمام می‌شوند نشانه «ی» کسره ی اضافه را به «هٔ» تبدیل می‌کند."

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:158:9
         case 'replaceHamzeh':
           processor = new HamzehProcessor()
           break
-        case 'replaceHamzehArabic':
-          processor = new HamzehArabicProcessor()
-          break
+        case 'replaceHamzehArabic':
         case 'replaceMiscNonPersianChars':
           processor = new MiscNonPersianCharsProcessor()
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کنندهٔ انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کنندة انتهای جمله"

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:158:14
         case 'replaceHamzeh':
           processor = new HamzehProcessor()
           break
-        case 'replaceHamzehArabic':
+        case "":
           processor = new HamzehArabicProcessor()
           break
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: Invalid processor type

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:161:9
         case 'replaceHamzehArabic':
           processor = new HamzehArabicProcessor()
           break
-        case 'replaceMiscNonPersianChars':
-          processor = new MiscNonPersianCharsProcessor()
-          break
+        case 'replaceMiscNonPersianChars':
         case 'replaceMiscSpacing':
           processor = new MiscSpacingProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."

[Killed] StringLiteral
src/processors/ProcessorFactory.ts:161:14
         case 'replaceHamzehArabic':
           processor = new HamzehArabicProcessor()
           break
-        case 'replaceMiscNonPersianChars':
+        case "":
           processor = new MiscNonPersianCharsProcessor()
           break
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:164:9
         case 'replaceMiscNonPersianChars':
           processor = new MiscNonPersianCharsProcessor()
           break
-        case 'replaceMiscSpacing':
-          processor = new MiscSpacingProcessor()
-          break
+        case 'replaceMiscSpacing':
         case 'replaceNumeralSymbols':
           processor = new NumeralSymbolProcessor()

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:167:9
         case 'replaceMiscSpacing':
           processor = new MiscSpacingProcessor()
           break
-        case 'replaceNumeralSymbols':
-          processor = new NumeralSymbolProcessor()
-          break
+        case 'replaceNumeralSymbols':
         case 'replacePersianGlyphs':
           processor = new GlyphsProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲% ۴۵۶"

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:170:9
         case 'replaceNumeralSymbols':
           processor = new NumeralSymbolProcessor()
           break
-        case 'replacePersianGlyphs':
-          processor = new GlyphsProcessor()
-          break
+        case 'replacePersianGlyphs':
         case 'replacePrefixSpacing':
           processor = new PrefixSpacingProcessor()

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:173:9
         case 'replacePersianGlyphs':
           processor = new GlyphsProcessor()
           break
-        case 'replacePrefixSpacing':
-          processor = new PrefixSpacingProcessor()
-          break
+        case 'replacePrefixSpacing':
         case 'replacePunctuations':
           processor = new PunctuationProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می کند تا متون فارسی زیباتر و درست‌تری بنویسید."

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:176:9
         case 'replacePrefixSpacing':
           processor = new PrefixSpacingProcessor()
           break
-        case 'replacePunctuations':
-          processor = new PunctuationProcessor()
-          break
+        case 'replacePunctuations':
         case 'replaceQuestionMarks':
           processor = new QuestionMarkProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند, مثلا تبدیل کامای انگلیسی به ویرگول (,), یا نق

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:179:9
         case 'replacePunctuations':
           processor = new PunctuationProcessor()
           break
-        case 'replaceQuestionMarks':
-          processor = new QuestionMarkProcessor()
-          break
+        case 'replaceQuestionMarks':
         case 'replaceSpacingForBracesAndQuotes':
           processor = new BracesSpacingProcessor()

[NoCoverage] ConditionalExpression
src/processors/ProcessorFactory.ts:182:9
         case 'replaceQuestionMarks':
           processor = new QuestionMarkProcessor()
           break
-        case 'replaceSpacingForBracesAndQuotes':
-          processor = new BracesSpacingProcessor()
-          break
+        case 'replaceSpacingForBracesAndQuotes':
         case 'replaceSuffixMisc':
           processor = new SuffixSpacingMiscProcessor()

[Survived] ConditionalExpression
src/processors/ProcessorFactory.ts:185:9
         case 'replaceSpacingForBracesAndQuotes':
           processor = new BracesSpacingProcessor()
           break
-        case 'replaceSuffixMisc':
-          processor = new SuffixSpacingMiscProcessor()
-          break
+        case 'replaceSuffixMisc':
         case 'replacesSpacesInsideBraces':
           processor = new BracesSpacingInsideProcessor()

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:188:9
         case 'replaceSuffixMisc':
           processor = new SuffixSpacingMiscProcessor()
           break
-        case 'replacesSpacesInsideBraces':
-          processor = new BracesSpacingInsideProcessor()
-          break
+        case 'replacesSpacesInsideBraces':
         case 'replacesExtraSpacesAroundBraces':
           processor = new BracesSpacingProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،) ، یا ن

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:191:9
         case 'replacesSpacesInsideBraces':
           processor = new BracesSpacingInsideProcessor()
           break
-        case 'replacesExtraSpacesAroundBraces':
-          processor = new BracesSpacingProcessor()
-          break
+        case 'replacesExtraSpacesAroundBraces':
        case 'replaceSuffixSpacing':
           processor = new SuffixSpacingProcessor()
killedBy: Virastar #cleanup() should cleanup simple sentences #7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۷. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می»، «تر» و «ترین» یک نیم فاصله قرار می‌دهد. بین ویرگول یا نقطه و کلمه قبل آن فاصله را حذف می‌کند."
Received: "۷. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می»، «تر»و«ترین» یک نیم فاصله قرار

[Killed] ConditionalExpression
src/processors/ProcessorFactory.ts:194:8
         case 'replacesExtraSpacesAroundBraces':
           processor = new BracesSpacingProcessor()
           break
-       case 'replaceSuffixSpacing':
-          processor = new SuffixSpacingProcessor()
-          break
+       case 'replaceSuffixSpacing':
         default:
           throw new Error('Invalid processor type')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: Invalid processor type

[NoCoverage] ConditionalExpression
src/processors/ProcessorFactory.ts:197:9
        case 'replaceSuffixSpacing':
           processor = new SuffixSpacingProcessor()
           break
-        default:
-          throw new Error('Invalid processor type')
+        default:
       }
 

[NoCoverage] StringLiteral
src/processors/ProcessorFactory.ts:198:27
           processor = new SuffixSpacingProcessor()
           break
         default:
-          throw new Error('Invalid processor type')
+          throw new Error("")
       }
 
