[NoCoverage] BlockStatement
src/processors/SwapQuotesProcessor.ts:13:40
 
    * @returns The processed text.
    */
-  public process(text: string): string {
-    return text.replace(/(»)(.+?)(«)/g, '«$2»').replace(/(”)(.+?)(“)/g, '“$2”')
-  }
+  public process(text: string): string {}
 }
 
