[Killed] BlockStatement
src/preservers/CurlyBracesPreserver.ts:10:33
    * @param text - The text to prepare.
    * @returns The modified text with curly braces replaced.
    */
-  prepare(text: string): string {
-    const curlyBracesRegex = /(\{.*?})/g
-    return text.replace(curlyBracesRegex, (matched: string) => {
-      this.preserves.push(matched)
-      return ' __BRACES__PRESERVER__ '
-    })
-  }
+  prepare(text: string): string {}
 
   /**
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/CurlyBracesPreserver.ts:12:64
    */
   prepare(text: string): string {
     const curlyBracesRegex = /(\{.*?})/g
-    return text.replace(curlyBracesRegex, (matched: string) => {
-      this.preserves.push(matched)
-      return ' __BRACES__PRESERVER__ '
-    })
+    return text.replace(curlyBracesRegex, (matched: string) => {})
   }
 
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{سلام}، این {جمله} یک {تست} است."
Received: "undefined، این undefined یک undefined است."

[Killed] StringLiteral
src/preservers/CurlyBracesPreserver.ts:14:14
     const curlyBracesRegex = /(\{.*?})/g
     return text.replace(curlyBracesRegex, (matched: string) => {
       this.preserves.push(matched)
-      return ' __BRACES__PRESERVER__ '
+      return ""
     })
   }
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{سلام}، این {جمله} یک {تست} است."
Received: "، این  یک  است."

[Killed] BlockStatement
src/preservers/CurlyBracesPreserver.ts:24:33
    * @param text - The text to restore.
    * @returns The modified text with curly braces restored.
    */
-  restore(text: string): string {
-    const preservedStringRegex = / ?__BRACES__PRESERVER__ ?/g
-    return text.replace(
-      preservedStringRegex,
-      () => this.preserves.shift() as string,
-    )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar cleanup should preserve strings inside curly braces when preserveCurlyBraces is true
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Survived] Regex
src/preservers/CurlyBracesPreserver.ts:25:34
    * @returns The modified text with curly braces restored.
    */
   restore(text: string): string {
-    const preservedStringRegex = / ?__BRACES__PRESERVER__ ?/g
+    const preservedStringRegex = / ?__BRACES__PRESERVER__ /g
     return text.replace(
       preservedStringRegex,

[Killed] ArrowFunction
src/preservers/CurlyBracesPreserver.ts:28:7
     const preservedStringRegex = / ?__BRACES__PRESERVER__ ?/g
     return text.replace(
       preservedStringRegex,
-      () => this.preserves.shift() as string,
+      () => undefined,
     )
   }
killedBy: CurlyBracesPreserver restore should restore previously preserved curly braces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "hello {world}"
Received: "hello undefined"
