[Killed] BlockStatement
src/preservers/FrontMatterPreserver.ts:4:25
 import { BasePreserver } from './BasePreserver'
 
 export class FrontMatterPreserver extends BasePreserver {
-  prepare(text: string) {
-    return text.replace(/^---[\S\s]*?---\n/g, (matched) => {
-      this.preserves.push(matched)
-      return '__FRONTMATTER__PRESERVER__'
-    })
-  }
+  prepare(text: string) {}
 
   restore(text: string): string {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/FrontMatterPreserver.ts:5:60
 
 export class FrontMatterPreserver extends BasePreserver {
   prepare(text: string) {
-    return text.replace(/^---[\S\s]*?---\n/g, (matched) => {
-      this.preserves.push(matched)
-      return '__FRONTMATTER__PRESERVER__'
-    })
+    return text.replace(/^---[\S\s]*?---\n/g, (matched) => {})
   }
 
killedBy: FrontMatterPreserver should correctly preserve front matter and restore it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- __FRONTMATTER__PRESERVER__
+ undefined
  This is some text.

[Killed] Regex
src/preservers/FrontMatterPreserver.ts:5:25
 
 export class FrontMatterPreserver extends BasePreserver {
   prepare(text: string) {
-    return text.replace(/^---[\S\s]*?---\n/g, (matched) => {
+    return text.replace(/^---[\s\s]*?---\n/g, (matched) => {
       this.preserves.push(matched)
       return '__FRONTMATTER__PRESERVER__'
killedBy: FrontMatterPreserver should correctly preserve front matter and restore it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 4

- __FRONTMATTER__PRESERVER__
+ ---
+ title: Example

[Killed] BlockStatement
src/preservers/FrontMatterPreserver.ts:11:33
     })
   }
 
-  restore(text: string): string {
-    return text.replace(
-      / ?__FRONTMATTER__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
-    )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/preservers/FrontMatterPreserver.ts:13:7
 
   restore(text: string): string {
     return text.replace(
-      / ?__FRONTMATTER__PRESERVER__ ?/g,
+      / __FRONTMATTER__PRESERVER__ ?/g,
       () => this.preserves.shift() as string,
     )
killedBy: FrontMatterPreserver should correctly preserve front matter and restore it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 1

- ---
- title: Example
- ---

[Killed] ArrowFunction
src/preservers/FrontMatterPreserver.ts:14:7
   restore(text: string): string {
     return text.replace(
       / ?__FRONTMATTER__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
+      () => undefined,
     )
   }
killedBy: FrontMatterPreserver should correctly preserve front matter and restore it
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 4
+ Received  + 1

- ---
- title: Example
- ---
