[Killed] BlockStatement
src/preservers/BasePreserver.ts:16:52
    * Retrieves the next preserved Markdown code block from the `preserves` array.
    * @returns The next preserved code block, or undefined if none remain.
    */
-  protected getNextPreserved(): string | undefined {
-    return this.preserves.shift()
-  }
+  protected getNextPreserved(): string | undefined {}
 
   /**
killedBy: MarkDownCodeBlockPreserver preserves Markdown code blocks
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  2

  ↵
        This is some text.
