[Killed] BlockStatement
src/preservers/HtmlCommentPreserver.ts:4:33
 import { BasePreserver } from './BasePreserver'
 
 export class HtmlCommentPreserver extends BasePreserver {
-  prepare(text: string): string {
-    return text.replace(/<!--[\s\S]*?-->/g, (matched) => {
-      this.preserves.push(matched)
-      return ' __COMMENT__PRESERVER__ '
-    })
-  }
+  prepare(text: string): string {}
 
   restore(text: string): string {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/HtmlCommentPreserver.ts:5:58
 
 export class HtmlCommentPreserver extends BasePreserver {
   prepare(text: string): string {
-    return text.replace(/<!--[\s\S]*?-->/g, (matched) => {
-      this.preserves.push(matched)
-      return ' __COMMENT__PRESERVER__ '
-    })
+    return text.replace(/<!--[\s\S]*?-->/g, (matched) => {})
   }
 
killedBy: Virastar cleanup should preserve and restore HTML comments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  ↵
        <div>
-         <!-- This is a comment -->

[Killed] Regex
src/preservers/HtmlCommentPreserver.ts:5:25
 
 export class HtmlCommentPreserver extends BasePreserver {
   prepare(text: string): string {
-    return text.replace(/<!--[\s\S]*?-->/g, (matched) => {
+    return text.replace(/<!--[^\s\S]*?-->/g, (matched) => {
       this.preserves.push(matched)
       return ' __COMMENT__PRESERVER__ '
killedBy: HtmlCommentPreserver should preserve HTML comments in the input text
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: " __COMMENT__PRESERVER__ "
Received: "<!-- This is a comment -->"

[Killed] BlockStatement
src/preservers/HtmlCommentPreserver.ts:11:33
     })
   }
 
-  restore(text: string): string {
-    return text.replace(
-      / ?__COMMENT__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
-    )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Survived] Regex
src/preservers/HtmlCommentPreserver.ts:13:7
 
   restore(text: string): string {
     return text.replace(
-      / ?__COMMENT__PRESERVER__ ?/g,
+      / __COMMENT__PRESERVER__ ?/g,
       () => this.preserves.shift() as string,
     )

[Killed] ArrowFunction
src/preservers/HtmlCommentPreserver.ts:14:7
   restore(text: string): string {
     return text.replace(
       / ?__COMMENT__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
+      () => undefined,
     )
   }
killedBy: Virastar cleanup should preserve and restore HTML comments
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  ↵
        <div>
-         <!-- This is a comment -->
