[Killed] BlockStatement
src/preservers/HtmlEntityPreserver.ts:4:33
 import { BasePreserver } from './BasePreserver'
 
 export class HtmlEntityPreserver extends BasePreserver {
-  prepare(text: string): string {
-    return text.replace(/&(#?[^;\W]+;?)/g, (matched) => {
-      this.preserves.push(matched)
-      return ' __ENTITIES__PRESERVER__ '
-    })
-  }
+  prepare(text: string): string {}
 
   restore(text: string): string {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/HtmlEntityPreserver.ts:5:57
 
 export class HtmlEntityPreserver extends BasePreserver {
   prepare(text: string): string {
-    return text.replace(/&(#?[^;\W]+;?)/g, (matched) => {
-      this.preserves.push(matched)
-      return ' __ENTITIES__PRESERVER__ '
-    })
+    return text.replace(/&(#?[^;\W]+;?)/g, (matched) => {})
   }
 
killedBy: Virastar cleanup should bring back all preserved html entities
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام &nbsp; جهان"
Received: "سلام undefined جهان"

[Killed] Regex
src/preservers/HtmlEntityPreserver.ts:5:25
 
 export class HtmlEntityPreserver extends BasePreserver {
   prepare(text: string): string {
-    return text.replace(/&(#?[^;\W]+;?)/g, (matched) => {
+    return text.replace(/&(#?[;\W]+;?)/g, (matched) => {
       this.preserves.push(matched)
       return ' __ENTITIES__PRESERVER__ '
killedBy: HtmlEntityPreserver prepare should replace HTML entities with a unique string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: " __ENTITIES__PRESERVER__ "
Received: "&lsquo;"

[Killed] StringLiteral
src/preservers/HtmlEntityPreserver.ts:7:14
   prepare(text: string): string {
     return text.replace(/&(#?[^;\W]+;?)/g, (matched) => {
       this.preserves.push(matched)
-      return ' __ENTITIES__PRESERVER__ '
+      return ""
     })
   }
killedBy: Virastar cleanup should bring back all preserved html entities
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام &nbsp; جهان"
Received: "سلام  جهان"

[Killed] BlockStatement
src/preservers/HtmlEntityPreserver.ts:11:33
     })
   }
 
-  restore(text: string): string {
-    return text.replace(
-      / ?__ENTITIES__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
-    )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
src/preservers/HtmlEntityPreserver.ts:14:7
   restore(text: string): string {
     return text.replace(
       / ?__ENTITIES__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
+      () => undefined,
     )
   }
killedBy: Virastar cleanup should bring back all preserved html entities
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام &nbsp; جهان"
Received: "سلام undefined جهان"
