[Killed] BlockStatement
src/preservers/HtmlPreserver.ts:14:40
    * @param text The text to prepare.
    * @returns The prepared text.
    */
-  public prepare(text: string): string {
-    return text.replace(/<\/?[a-z][^>]*?>/gi, (matched) => {
-      this.preserves.push(matched)
-      return ' __HTML__PRESERVER__ '
-    })
-  }
+  public prepare(text: string): string {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/HtmlPreserver.ts:15:60
    * @returns The prepared text.
    */
   public prepare(text: string): string {
-    return text.replace(/<\/?[a-z][^>]*?>/gi, (matched) => {
-      this.preserves.push(matched)
-      return ' __HTML__PRESERVER__ '
-    })
+    return text.replace(/<\/?[a-z][^>]*?>/gi, (matched) => {})
   }
 
killedBy: Virastar #cleanup(): Additional should preserve all HTML tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<strong title=\"نباید تغییر کند!!!!!\">سلام جهان</strong>"
Received: "undefinedسلام جهانundefined"

[Killed] BlockStatement
src/preservers/HtmlPreserver.ts:27:33
    * @param text The text to restore.
    * @returns The restored text.
    */
-  restore(text: string): string {
-    return text.replace(
-      / ?__HTML__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
-    )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
src/preservers/HtmlPreserver.ts:30:7
   restore(text: string): string {
     return text.replace(
       / ?__HTML__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
+      () => undefined,
     )
   }
killedBy: Virastar #cleanup(): Additional should preserve all HTML tags
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "<strong title=\"نباید تغییر کند!!!!!\">سلام جهان</strong>"
Received: "undefinedسلام جهانundefined"
