[Killed] Regex
src/preservers/MarkDownCodeBlockPreserver.ts:7:47
  * A preserver for Markdown code blocks.
  */
 export class MarkDownCodeBlockPreserver extends BasePreserver {
-  private readonly codeBlockPattern: RegExp = /```([\s\S]*?)```/gm
+  private readonly codeBlockPattern: RegExp = /```([^\s\S]*?)```/gm
   private readonly placeholder: string = '__MD_CODE_BLOCK__PRESERVER__'
 
killedBy: MarkDownCodeBlockPreserver preserves Markdown code blocks
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "__MD_CODE_BLOCK__PRESERVER__"
Received string:    "
      This is some text.·
      ```
      const foo = 'bar'
      console.log(foo)

[Killed] BlockStatement
src/preservers/MarkDownCodeBlockPreserver.ts:15:33
    * @param text The text to be prepared.
    * @returns The text with Markdown code blocks replaced by the placeholder string.
    */
-  prepare(text: string): string {
-    return text.replace(this.codeBlockPattern, (codeBlock: string) => {
-      this.preserves.push(codeBlock)
-      return this.placeholder
-    })
-  }
+  prepare(text: string): string {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/MarkDownCodeBlockPreserver.ts:16:71
    * @returns The text with Markdown code blocks replaced by the placeholder string.
    */
   prepare(text: string): string {
-    return text.replace(this.codeBlockPattern, (codeBlock: string) => {
-      this.preserves.push(codeBlock)
-      return this.placeholder
-    })
+    return text.replace(this.codeBlockPattern, (codeBlock: string) => {})
   }
 
killedBy: MarkDownCodeBlockPreserver preserves Markdown code blocks
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "__MD_CODE_BLOCK__PRESERVER__"
Received string:    "
      This is some text.·
      undefined·
      More text.·
      undefined

[Killed] BlockStatement
src/preservers/MarkDownCodeBlockPreserver.ts:27:33
    * @param text The text to be restored.
    * @returns The text with Markdown code blocks restored.
    */
-  restore(text: string): string {
-    let preservedCodeBlock: string | undefined
-    while ((preservedCodeBlock = this.getNextPreserved())) {
-      text = text.replace(this.placeholder, preservedCodeBlock)
-    }
-    return text
-  }
+  restore(text: string): string {}
 }
 
killedBy: MarkDownCodeBlockPreserver preserves Markdown code blocks
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "
      This is some text.·
      ```
      const foo = 'bar'
      console.log(foo)
      ```·

[Killed] BlockStatement
src/preservers/MarkDownCodeBlockPreserver.ts:29:60
    */
   restore(text: string): string {
     let preservedCodeBlock: string | undefined
-    while ((preservedCodeBlock = this.getNextPreserved())) {
-      text = text.replace(this.placeholder, preservedCodeBlock)
-    }
+    while ((preservedCodeBlock = this.getNextPreserved())) {}
     return text
   }
killedBy: MarkDownCodeBlockPreserver preserves Markdown code blocks
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  2

  ↵
        This is some text.

[Killed] ConditionalExpression
src/preservers/MarkDownCodeBlockPreserver.ts:29:13
    */
   restore(text: string): string {
     let preservedCodeBlock: string | undefined
-    while ((preservedCodeBlock = this.getNextPreserved())) {
+    while ((false)) {
       text = text.replace(this.placeholder, preservedCodeBlock)
     }
killedBy: MarkDownCodeBlockPreserver preserves Markdown code blocks
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  2

  ↵
        This is some text.
