[Killed] BlockStatement
src/preservers/NonBreakingSpacePreserver.ts:4:33
 import { BasePreserver } from './BasePreserver'
 
 export class NonBreakingSpacePreserver extends BasePreserver {
-  prepare(text: string): string {
-    return text.replace(/&nbsp;|&#160;/gi, (matched) => {
-      this.preserves.push(matched)
-      return ' __NBSPS__PRESERVER__ '
-    })
-  }
+  prepare(text: string): string {}
 
   restore(text: string): string {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/NonBreakingSpacePreserver.ts:5:57
 
 export class NonBreakingSpacePreserver extends BasePreserver {
   prepare(text: string): string {
-    return text.replace(/&nbsp;|&#160;/gi, (matched) => {
-      this.preserves.push(matched)
-      return ' __NBSPS__PRESERVER__ '
-    })
+    return text.replace(/&nbsp;|&#160;/gi, (matched) => {})
   }
 
killedBy: Virastar cleanup should preserve all no-break space entities when `preserveNonBreakingSpaces` is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک &nbsp; متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."
Received: "این یک undefined متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."

[Killed] StringLiteral
src/preservers/NonBreakingSpacePreserver.ts:7:14
   prepare(text: string): string {
     return text.replace(/&nbsp;|&#160;/gi, (matched) => {
       this.preserves.push(matched)
-      return ' __NBSPS__PRESERVER__ '
+      return ""
     })
   }
killedBy: Virastar cleanup should preserve all no-break space entities when `preserveNonBreakingSpaces` is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک &nbsp; متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."
Received: "این یک  متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."

[Killed] BlockStatement
src/preservers/NonBreakingSpacePreserver.ts:11:33
     })
   }
 
-  restore(text: string): string {
-    return text.replace(
-      / ?__NBSPS__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
-    )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Survived] Regex
src/preservers/NonBreakingSpacePreserver.ts:13:7
 
   restore(text: string): string {
     return text.replace(
-      / ?__NBSPS__PRESERVER__ ?/g,
+      / ?__NBSPS__PRESERVER__ /g,
       () => this.preserves.shift() as string,
     )

[Killed] ArrowFunction
src/preservers/NonBreakingSpacePreserver.ts:14:7
   restore(text: string): string {
     return text.replace(
       / ?__NBSPS__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
+      () => undefined,
     )
   }
killedBy: Virastar cleanup should preserve all no-break space entities when `preserveNonBreakingSpaces` is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک &nbsp; متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."
Received: "این یک undefined متن است که شامل فضای بین‌کلمه‌ای نیز می‌باشد."
