[Killed] BlockStatement
src/preservers/SquareBracketsPreserver.ts:4:33
 import { BasePreserver } from './BasePreserver'
 
 export class SquareBracketsPreserver extends BasePreserver {
-  prepare(text: string): string {
-    return text.replace(/(\[.*?])/g, (matched) => {
-      this.preserves.push(matched)
-      return ' __BRACKETS__PRESERVER__ '
-    })
-  }
+  prepare(text: string): string {}
 
   restore(text: string): string {
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/SquareBracketsPreserver.ts:5:51
 
 export class SquareBracketsPreserver extends BasePreserver {
   prepare(text: string): string {
-    return text.replace(/(\[.*?])/g, (matched) => {
-      this.preserves.push(matched)
-      return ' __BRACKETS__PRESERVER__ '
-    })
+    return text.replace(/(\[.*?])/g, (matched) => {})
   }
 
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[سلام]، این [جمله] یک [تست] است."
Received: "undefined، این undefined یک undefined است."

[Survived] Regex
src/preservers/SquareBracketsPreserver.ts:5:25
 
 export class SquareBracketsPreserver extends BasePreserver {
   prepare(text: string): string {
-    return text.replace(/(\[.*?])/g, (matched) => {
+    return text.replace(/(\[.])/g, (matched) => {
       this.preserves.push(matched)
       return ' __BRACKETS__PRESERVER__ '

[Killed] BlockStatement
src/preservers/SquareBracketsPreserver.ts:11:33
     })
   }
 
-  restore(text: string): string {
-    return text.replace(
-      / ?__BRACKETS__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
-    )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
src/preservers/SquareBracketsPreserver.ts:14:7
   restore(text: string): string {
     return text.replace(
       / ?__BRACKETS__PRESERVER__ ?/g,
-      () => this.preserves.shift() as string,
+      () => undefined,
     )
   }
killedBy: Virastar cleanup should preserve strings inside brackets when preserveSquareBrackets is true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[سلام]، این [جمله] یک [تست] است."
Received: "undefined، این undefined یک undefined است."
