[Killed] StringLiteral
src/preservers/UriPreserver.ts:7:5
   // @source: https://github.com/jhermsmeier/uri.regex
   private readonly patternURI: string =
     `([A-Za-z][A-Za-z0-9+\\-.]*):(?:(//)(?:((?:[A-Za-z0-9\\-._~!$&'()*+,;=:]|` +
-    `%[0-9A-Fa-f]{2})*)@)?((?:\\[(?:(?:(?:(?:[0-9A-Fa-f]{1,4}:){6}|` +
+    `` +
     `::(?:[0-9A-Fa-f]{1,4}:){5}|(?:[0-9A-Fa-f]{1,4})?::(?:[0-9A-Fa-f]{1,4}:){4}|` +
     `(?:(?:[0-9A-Fa-f]{1,4}:){0,1}[0-9A-Fa-f]{1,4})?::(?:[0-9A-Fa-f]{1,4}:){3}|` +
killedBy: Virastar #cleanup() should cleanup simple sentences

[Killed] StringLiteral
src/preservers/UriPreserver.ts:17:5
     `(?:(?:[0-9A-Fa-f]{1,4}:){0,5}[0-9A-Fa-f]{1,4})?::[0-9A-Fa-f]{1,4}|` +
     `(?:(?:[0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})?::)|` +
     `[Vv][0-9A-Fa-f]+\\.[A-Za-z0-9\\-._~!$&'()*+,;=:]+)\\]|` +
-    `(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.){3}(?:25[0-5]|` +
+    `` +
     `2[0-4][0-9]|[01]?[0-9][0-9]?)|(?:[A-Za-z0-9\\-._~!$&'()*+,;=]|` +
     `%[0-9A-Fa-f]{2})*))(?::([0-9]*))?((?:/(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +
killedBy: Virastar #cleanup() should cleanup simple sentences

[Survived] StringLiteral
src/preservers/UriPreserver.ts:18:5
     `(?:(?:[0-9A-Fa-f]{1,4}:){0,6}[0-9A-Fa-f]{1,4})?::)|` +
     `[Vv][0-9A-Fa-f]+\\.[A-Za-z0-9\\-._~!$&'()*+,;=:]+)\\]|` +
     `(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.){3}(?:25[0-5]|` +
-    `2[0-4][0-9]|[01]?[0-9][0-9]?)|(?:[A-Za-z0-9\\-._~!$&'()*+,;=]|` +
+    `` +
     `%[0-9A-Fa-f]{2})*))(?::([0-9]*))?((?:/(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +
     `%[0-9A-Fa-f]{2})*)*)|/((?:(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +

[Survived] StringLiteral
src/preservers/UriPreserver.ts:19:5
     `[Vv][0-9A-Fa-f]+\\.[A-Za-z0-9\\-._~!$&'()*+,;=:]+)\\]|` +
     `(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.){3}(?:25[0-5]|` +
     `2[0-4][0-9]|[01]?[0-9][0-9]?)|(?:[A-Za-z0-9\\-._~!$&'()*+,;=]|` +
-    `%[0-9A-Fa-f]{2})*))(?::([0-9]*))?((?:/(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +
+    `` +
     `%[0-9A-Fa-f]{2})*)*)|/((?:(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +
     `%[0-9A-Fa-f]{2})+(?:/(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +

[Killed] StringLiteral
src/preservers/UriPreserver.ts:24:5
     `%[0-9A-Fa-f]{2})+(?:/(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +
     `%[0-9A-Fa-f]{2})*)*)?)|((?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +
     `%[0-9A-Fa-f]{2})+(?:/(?:[A-Za-z0-9\\-._~!$&'()*+,;=:@]|` +
-    `%[0-9A-Fa-f]{2})*)*)|)(?:\\?((?:[A-Za-z0-9\\-._~!$&'()*+,;=:@/?]|` +
+    `` +
     `%[0-9A-Fa-f]{2})*))?(?:\\#((?:[A-Za-z0-9\\-._~!$&'()*+,;=:@/?]|%[0-9A-Fa-f]{2})*))?`
 
killedBy: Virastar #cleanup() should cleanup simple sentences

[Survived] ArrayDeclaration
src/preservers/UriPreserver.ts:27:36
     `%[0-9A-Fa-f]{2})*)*)|)(?:\\?((?:[A-Za-z0-9\\-._~!$&'()*+,;=:@/?]|` +
     `%[0-9A-Fa-f]{2})*))?(?:\\#((?:[A-Za-z0-9\\-._~!$&'()*+,;=:@/?]|%[0-9A-Fa-f]{2})*))?`
 
-  private regularLinks: string[] = []
+  private regularLinks: string[] = ["Stryker was here"]
   private markDownLinks: string[] = []
 

[Killed] BlockStatement
src/preservers/UriPreserver.ts:30:33
   private regularLinks: string[] = []
   private markDownLinks: string[] = []
 
-  prepare(text: string): string {
-    return text
-      .replace(/]\((.*?)\)/g, (matched, link) => {
-        if (link) {
-          this.markDownLinks.push(link.trim())
-          return '](__MD_LINK__PRESERVER__)' // No padding!
-        }
-        return matched
-      })
-      .replace(new RegExp(this.patternURI), (matched) => {
-        this.regularLinks.push(matched)
-        return ' __URI__PRESERVER__ '
-      })
-  }
+  prepare(text: string): string {}
 
   restore(text: string): string {
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/preservers/UriPreserver.ts:32:50
 
   prepare(text: string): string {
     return text
-      .replace(/]\((.*?)\)/g, (matched, link) => {
-        if (link) {
-          this.markDownLinks.push(link.trim())
-          return '](__MD_LINK__PRESERVER__)' // No padding!
-        }
-        return matched
-      })
+      .replace(/]\((.*?)\)/g, (matched, link) => {})
       .replace(new RegExp(this.patternURI), (matched) => {
         this.regularLinks.push(matched)
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt nameundefined"

[Killed] Regex
src/preservers/UriPreserver.ts:32:16
 
   prepare(text: string): string {
     return text
-      .replace(/]\((.*?)\)/g, (matched, link) => {
+      .replace(/]\((.)\)/g, (matched, link) => {
         if (link) {
           this.markDownLinks.push(link.trim())
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name] (https://example.com/media/image.jpg)"

[Killed] ConditionalExpression
src/preservers/UriPreserver.ts:33:13
   prepare(text: string): string {
     return text
       .replace(/]\((.*?)\)/g, (matched, link) => {
-        if (link) {
+        if (false) {
           this.markDownLinks.push(link.trim())
           return '](__MD_LINK__PRESERVER__)' // No padding!
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name] (https://example.com/media/image.jpg)"

[Killed] BlockStatement
src/preservers/UriPreserver.ts:33:19
   prepare(text: string): string {
     return text
       .replace(/]\((.*?)\)/g, (matched, link) => {
-        if (link) {
-          this.markDownLinks.push(link.trim())
-          return '](__MD_LINK__PRESERVER__)' // No padding!
-        }
+        if (link) {}
         return matched
       })
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name] (https://example.com/media/image.jpg)"

[Survived] MethodExpression
src/preservers/UriPreserver.ts:34:35
     return text
       .replace(/]\((.*?)\)/g, (matched, link) => {
         if (link) {
-          this.markDownLinks.push(link.trim())
+          this.markDownLinks.push(link)
           return '](__MD_LINK__PRESERVER__)' // No padding!
         }

[Killed] StringLiteral
src/preservers/UriPreserver.ts:35:18
       .replace(/]\((.*?)\)/g, (matched, link) => {
         if (link) {
           this.markDownLinks.push(link.trim())
-          return '](__MD_LINK__PRESERVER__)' // No padding!
+          return "" // No padding!
         }
         return matched
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name"

[Killed] BlockStatement
src/preservers/UriPreserver.ts:39:58
         }
         return matched
       })
-      .replace(new RegExp(this.patternURI), (matched) => {
-        this.regularLinks.push(matched)
-        return ' __URI__PRESERVER__ '
-      })
+      .replace(new RegExp(this.patternURI), (matched) => {})
   }
 
killedBy: Virastar cleanup should bring back URIs in text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "جستجوی در اینترنت: https://fa.wikipedia.org"
Received: "جستجوی در اینترنت: undefined"

[Killed] StringLiteral
src/preservers/UriPreserver.ts:41:16
       })
       .replace(new RegExp(this.patternURI), (matched) => {
         this.regularLinks.push(matched)
-        return ' __URI__PRESERVER__ '
+        return ""
       })
   }
killedBy: Virastar cleanup should bring back URIs in text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "جستجوی در اینترنت: https://fa.wikipedia.org"
Received: "جستجوی در اینترنت: "

[Killed] BlockStatement
src/preservers/UriPreserver.ts:45:33
       })
   }
 
-  restore(text: string): string {
-    return text
-      .replace(
-        / ?__URI__PRESERVER__ ?/g,
-        () => this.regularLinks.shift() as string,
-      )
-      .replace(
-        /__MD_LINK__PRESERVER__/g,
-        () => this.markDownLinks.shift() as string,
-      )
-  }
+  restore(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
src/preservers/UriPreserver.ts:49:9
     return text
       .replace(
         / ?__URI__PRESERVER__ ?/g,
-        () => this.regularLinks.shift() as string,
+        () => undefined,
       )
       .replace(
killedBy: Virastar cleanup should bring back URIs in text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "جستجوی در اینترنت: https://fa.wikipedia.org"
Received: "جستجوی در اینترنت: undefined"

[Killed] ArrowFunction
src/preservers/UriPreserver.ts:53:9
       )
       .replace(
         /__MD_LINK__PRESERVER__/g,
-        () => this.markDownLinks.shift() as string,
+        () => undefined,
       )
   }
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "![alt name](undefined)"
