[Killed] StringLiteral
src/processors/ArabicNumbersProcessor.ts:11:5
   private readonly persianDigits: string =
     '\u06F1' + // Persian digit 1
     '\u06F2' + // Persian digit 2
-    '\u06F3' + // Persian digit 3
+    "" + // Persian digit 3
     '\u06F4' + // Persian digit 4
     '\u06F5' + // Persian digit 5
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "۱۲۴۵۶۷۸۹۰"

[Killed] StringLiteral
src/processors/ArabicNumbersProcessor.ts:12:5
     '\u06F1' + // Persian digit 1
     '\u06F2' + // Persian digit 2
     '\u06F3' + // Persian digit 3
-    '\u06F4' + // Persian digit 4
+    "" + // Persian digit 4
     '\u06F5' + // Persian digit 5
     '\u06F6' + // Persian digit 6
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "۱۲۳۵۶۷۸۹۰"

[Killed] StringLiteral
src/processors/ArabicNumbersProcessor.ts:18:5
     '\u06F7' + // Persian digit 7
     '\u06F8' + // Persian digit 8
     '\u06F9' + // Persian digit 9
-    '\u06F0' // Persian digit 0
+    "" // Persian digit 0
 
   private arabicDigits =
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "۱۲۳۴۵۶۷۸۹"

[Killed] StringLiteral
src/processors/ArabicNumbersProcessor.ts:24:5
     '\u0661' +
     '\u0662' +
     '\u0663' +
-    '\u0664' +
+    "" +
     '\u0665' +
     '\u0666' +
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "۹۱۲۳٤۴۵۶۷۸"

[Killed] StringLiteral
src/processors/ArabicNumbersProcessor.ts:27:5
     '\u0664' +
     '\u0665' +
     '\u0666' +
-    '\u0667' +
+    "" +
     '\u0668' +
     '\u0669' +
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "۹۱۲۳۴۵۶٧۷۸"

[Killed] BlockStatement
src/processors/ArabicNumbersProcessor.ts:38:40
    * @param text - The input text.
    * @returns The text with Arabic numbers replaced with their Persian equivalent.
    */
-  public process(text: string): string {
-    return text
-      .split('')
-      .map((char) =>
-        this.arabicDigits.includes(char)
-          ? this.persianDigits.charAt(this.arabicDigits.indexOf(char))
-          : char,
-      )
-      .join('')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
src/processors/ArabicNumbersProcessor.ts:41:12
   public process(text: string): string {
     return text
       .split('')
-      .map((char) =>
-        this.arabicDigits.includes(char)
-          ? this.persianDigits.charAt(this.arabicDigits.indexOf(char))
-          : char,
+      .map(() => undefined,
       )
       .join('')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: ""

[Killed] MethodExpression
src/processors/ArabicNumbersProcessor.ts:43:13
       .split('')
       .map((char) =>
         this.arabicDigits.includes(char)
-          ? this.persianDigits.charAt(this.arabicDigits.indexOf(char))
+          ? this.persianDigits
           : char,
       )
killedBy: Virastar #cleanup() should replace Arabic numbers with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۰۱۲۳۴۵۶۷۸۹"
Received: "۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰۱۲۳۴۵۶۷۸۹۰"
