[Killed] BlockStatement
src/processors/BracesSpacingInsideProcessor.ts:12:40
    * @param {string} text - The input string to fix.
    * @returns {string} The fixed string with no spaces inside the braces.
    */
-  public process(text: string): string {
-    const replacement = '$1$2$3'
-
-    return (
-      text
-        // Remove inside spaces for `()`, `[]`, `{}`, `“”`, and `«»`.
-        .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
-        .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
-        .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
-        .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
-        .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
-
-        // Remove Markdown link spaces inside normal ().
-        .replace(/(\(\[.*?]\(.*?\))\s+(\))/g, '$1$2')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/BracesSpacingInsideProcessor.ts:18:18
     return (
       text
         // Remove inside spaces for `()`, `[]`, `{}`, `“”`, and `«»`.
-        .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
+        .replace(/(\()\s*([^)])\s*?(\))/g, replacement)
         .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
         .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
killedBy: BracesSpacingInsideProcessor replaces spaces inside () with no spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This (is) a (test)"
Received: "This ( is ) a (test)"

[Survived] Regex
src/processors/BracesSpacingInsideProcessor.ts:18:18
     return (
       text
         // Remove inside spaces for `()`, `[]`, `{}`, `“”`, and `«»`.
-        .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
+        .replace(/(\()\s*([^)]+?)\s(\))/g, replacement)
         .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
         .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)

[Killed] Regex
src/processors/BracesSpacingInsideProcessor.ts:19:18
       text
         // Remove inside spaces for `()`, `[]`, `{}`, `“”`, and `«»`.
         .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
-        .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
+        .replace(/(\[)\s*([\]]+?)\s*?(])/g, replacement)
         .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
         .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
killedBy: BracesSpacingInsideProcessor replaces spaces inside [] with no spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This [is] a [test]"
Received: "This [ is ] a [test]"

[Killed] Regex
src/processors/BracesSpacingInsideProcessor.ts:19:18
       text
         // Remove inside spaces for `()`, `[]`, `{}`, `“”`, and `«»`.
         .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
-        .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
+        .replace(/(\[)\S*([^\]]+?)\s*?(])/g, replacement)
         .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
         .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [ه] و (پرانتز) تنظیم می‌کند."

[Killed] Regex
src/processors/BracesSpacingInsideProcessor.ts:20:18
         // Remove inside spaces for `()`, `[]`, `{}`, `“”`, and `«»`.
         .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
         .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
-        .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
+        .replace(/(\{)\S*([^}]+?)\s*?(})/g, replacement)
         .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
         .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
killedBy: Virastar #cleanup() should cleanup simple sentences #8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۸. فاصله گذاری را برای متون بین «گیومه»، {آکولاد}، [کروشه] و (پرانتز) تنظیم می‌کند."
Received: "۸. فاصله گذاری را برای متون بین «گیومه»، {د}، [کروشه] و (پرانتز) تنظیم می‌کند."

[Killed] Regex
src/processors/BracesSpacingInsideProcessor.ts:20:18
         // Remove inside spaces for `()`, `[]`, `{}`, `“”`, and `«»`.
         .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
         .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
-        .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
+        .replace(/(\{)\s*([}]+?)\s*?(})/g, replacement)
         .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
         .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
killedBy: BracesSpacingInsideProcessor replaces spaces inside {} with no spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This {is} a {test}"
Received: "This { is } a {test}"

[Killed] Regex
src/processors/BracesSpacingInsideProcessor.ts:21:18
         .replace(/(\()\s*([^)]+?)\s*?(\))/g, replacement)
         .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
         .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
-        .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
+        .replace(/(“)\s*([”]+?)\s*?(”)/g, replacement)
         .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
 
killedBy: BracesSpacingInsideProcessor replaces spaces inside “” with no spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This “is” a “test”"
Received: "This “ is ” a “test”"

[Killed] Regex
src/processors/BracesSpacingInsideProcessor.ts:22:18
         .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
         .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
         .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
-        .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
+        .replace(/(«)\s*([^»])\s*?(»)/g, replacement)
 
         // Remove Markdown link spaces inside normal ().
killedBy: BracesSpacingInsideProcessor replaces spaces inside «» with no spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "This «is» a «test»"
Received: "This « is » a «test»"

[Survived] Regex
src/processors/BracesSpacingInsideProcessor.ts:22:18
         .replace(/(\[)\s*([^\]]+?)\s*?(])/g, replacement)
         .replace(/(\{)\s*([^}]+?)\s*?(})/g, replacement)
         .replace(/(“)\s*([^”]+?)\s*?(”)/g, replacement)
-        .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
+        .replace(/(«)\s([^»]+?)\s*?(»)/g, replacement)
 
         // Remove Markdown link spaces inside normal ().

[Survived] Regex
src/processors/BracesSpacingInsideProcessor.ts:25:18
         .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
 
         // Remove Markdown link spaces inside normal ().
-        .replace(/(\(\[.*?]\(.*?\))\s+(\))/g, '$1$2')
+        .replace(/(\(\[.*?]\(.*?\))\S+(\))/g, '$1$2')
     )
   }

[Survived] Regex
src/processors/BracesSpacingInsideProcessor.ts:25:18
         .replace(/(«)\s*([^»]+?)\s*?(»)/g, replacement)
 
         // Remove Markdown link spaces inside normal ().
-        .replace(/(\(\[.*?]\(.*?\))\s+(\))/g, '$1$2')
+        .replace(/(\(\[.*?]\(.*?\))\s(\))/g, '$1$2')
     )
   }
