[Killed] BlockStatement
src/processors/BracesSpacingProcessor.ts:10:40
    * @param text - The input text.
    * @returns The input text with extra spaces around braces removed.
    */
-  public process(text: string): string {
-    const patterns: RegExp[] = [
-      /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
-      /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
-      /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
-      /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
-      /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[ \t\u200c]*/g, // matches "«...»"
-    ]
-
-    const replacement = ' $1$2$3 '
-    return patterns.reduce((result, pattern) => {
-      return result.replace(pattern, replacement)
-    }, text)
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:12:7
    */
   public process(text: string): string {
     const patterns: RegExp[] = [
-      /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
+      /[ \t\u200c]*(\()\s*([^)]+?)\s(\))[ \t\u200c]*/g, // matches "(...)"
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
killedBy: Virastar #cleanup() should fix spacing for () [] {}  “” «» (one space outside, no space inside)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "this is (a test)"
Received: "this is(a test)"

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:12:7
    */
   public process(text: string): string {
     const patterns: RegExp[] = [
-      /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
+      /[ \t\u200c]*(\()\S*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (یا نقطه و

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:13:7
   public process(text: string): string {
     const patterns: RegExp[] = [
       /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
-      /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
+      /[ \t\u200c]*(\[)\S*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
       /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
killedBy: Virastar #cleanup() should fix spacing for () [] {}  “” «» (one space outside, no space inside)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "this is [a test] yeah!"
Received: "this is [test] yeah!"

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:13:7
   public process(text: string): string {
     const patterns: RegExp[] = [
       /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
-      /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
+      /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
       /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
killedBy: BracesSpacingProcessor should remove spaces around braces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "The quick (brown) fox jumps [over] the {lazy} dog."
Received: "The quick (brown) fox jumps [over]  the {lazy} dog."

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:14:7
     const patterns: RegExp[] = [
       /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
-      /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
+      /[ \t\u200c]*(\{)\s*([^}]+?)\S*?(})[ \t\u200c]*/g, // matches "{...}"
       /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
       /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[ \t\u200c]*/g, // matches "«...»"
killedBy: BracesSpacingProcessor should remove spaces inside braces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "The quick (brown) fox jumps [over] the {lazy} dog."
Received: "The quick (brown) fox jumps [over] the {lazy } dog."

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:14:7
     const patterns: RegExp[] = [
       /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
-      /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
+      /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]/g, // matches "{...}"
       /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
       /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[ \t\u200c]*/g, // matches "«...»"
killedBy: BracesSpacingProcessor should remove spaces around braces
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "The quick (brown) fox jumps [over] the {lazy} dog."
Received: "The quick (brown) fox jumps [over] the {lazy}  dog."

[Survived] Regex
src/processors/BracesSpacingProcessor.ts:15:7
       /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
-      /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
+      /[ \t\u200c]*(“)\s*([”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
       /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[ \t\u200c]*/g, // matches "«...»"
     ]

[Survived] Regex
src/processors/BracesSpacingProcessor.ts:15:7
       /[ \t\u200c]*(\()\s*([^)]+?)\s*?(\))[ \t\u200c]*/g, // matches "(...)"
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
-      /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
+      /[ \t\u200c]*(“)\s*([^”]+?)\S*?(”)[ \t\u200c]*/g, // matches "“...”"
       /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[ \t\u200c]*/g, // matches "«...»"
     ]

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:16:7
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
       /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
-      /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[ \t\u200c]*/g, // matches "«...»"
+      /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[^ \t\u200c]*/g, // matches "«...»"
     ]
 
killedBy: Virastar #cleanup() should cleanup simple sentences #7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۷. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می»، «تر» و «ترین» یک نیم فاصله قرار می‌دهد. بین ویرگول یا نقطه و کلمه قبل آن فاصله را حذف می‌کند."
Received: "۷. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می» یک نیم فاصله قرار می‌دهد. بین

[Killed] Regex
src/processors/BracesSpacingProcessor.ts:16:7
       /[ \t\u200c]*(\[)\s*([^\]]+?)\s*?(])[ \t\u200c]*/g, // matches "[...]"
       /[ \t\u200c]*(\{)\s*([^}]+?)\s*?(})[ \t\u200c]*/g, // matches "{...}"
       /[ \t\u200c]*(“)\s*([^”]+?)\s*?(”)[ \t\u200c]*/g, // matches "“...”"
-      /[ \t\u200c]*(«)\s*([^»]+?)\s*?(»)[ \t\u200c]*/g, // matches "«...»"
+      /[ \t\u200c]*(«)\s*([^»]+?)\S*?(»)[ \t\u200c]*/g, // matches "«...»"
     ]
 
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نق

[Killed] BlockStatement
src/processors/BracesSpacingProcessor.ts:20:49
     ]
 
     const replacement = ' $1$2$3 '
-    return patterns.reduce((result, pattern) => {
-      return result.replace(pattern, replacement)
-    }, text)
+    return patterns.reduce((result, pattern) => {}, text)
   }
 }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')
