[Killed] BlockStatement
src/processors/DashProcessor.ts:12:40
    * @param text The text to fix.
    * @returns The fixed text.
    */
-  public process(text: string): string {
-    return (
-      text
-        // Replaces triple dash with mdash.
-        .replace(/-{3}/g, '\u2014')
-
-        // Replaces double dash with ndash.
-        .replace(/-{2}/g, '\u2013')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/DashProcessor.ts:19:18
         .replace(/-{3}/g, '\u2014')
 
         // Replaces double dash with ndash.
-        .replace(/-{2}/g, '\u2013')
+        .replace(/-/g, '\u2013')
     )
   }
killedBy: Virastar #cleanup() should cleanup simple sentences #6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (–) و سه علامت منهای پی در پی را به خط کشیده بلند (—) تبدیل می‌کند."
Received: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (––) و سه علامت منهای پی در پی را به خط کشیده بلند (—) تبدیل می‌کند."

[Killed] StringLiteral
src/processors/DashProcessor.ts:19:27
         .replace(/-{3}/g, '\u2014')
 
         // Replaces double dash with ndash.
-        .replace(/-{2}/g, '\u2013')
+        .replace(/-{2}/g, "")
     )
   }
killedBy: Virastar #cleanup() should cleanup simple sentences #6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه (–) و سه علامت منهای پی در پی را به خط کشیده بلند (—) تبدیل می‌کند."
Received: "۶. دو علامت منهای پی در پی را به خط کشیده کوتاه () و سه علامت منهای پی در پی را به خط کشیده بلند (—) تبدیل می‌کند."
