[Killed] BlockStatement
src/processors/DateNormalizerProcessor.ts:13:40
    * @param {string} text - The text to normalize.
    * @returns {string} The normalized text.
    */
-  public process(text: string): string {
-    return text.replace(
-      /([0-9۰-۹]{1,2})([/-])([0-9۰-۹]{1,2})\2([0-9۰-۹]{4})/g,
-      function (_matched, day, _delimiter, month, year) {
-        return `${year}/${month}/${day}`
-      },
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/DateNormalizerProcessor.ts:15:7
    */
   public process(text: string): string {
     return text.replace(
-      /([0-9۰-۹]{1,2})([/-])([0-9۰-۹]{1,2})\2([0-9۰-۹]{4})/g,
+      /([0-9۰-۹]{1,2})([/-])([0-9۰-۹])\2([0-9۰-۹]{4})/g,
       function (_matched, day, _delimiter, month, year) {
         return `${year}/${month}/${day}`
killedBy: Virastar #cleanup(): Additional extra: normalizeDates(): reorders date parts with slash as delimiter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۳۵۵/۱۰/۲۳"
Received: "۲۳/۱۰/۱۳۵۵"

[Killed] Regex
src/processors/DateNormalizerProcessor.ts:15:7
    */
   public process(text: string): string {
     return text.replace(
-      /([0-9۰-۹]{1,2})([/-])([0-9۰-۹]{1,2})\2([0-9۰-۹]{4})/g,
+      /([0-9۰-۹])([/-])([0-9۰-۹]{1,2})\2([0-9۰-۹]{4})/g,
       function (_matched, day, _delimiter, month, year) {
         return `${year}/${month}/${day}`
killedBy: Virastar #cleanup(): Additional extra: normalizeDates(): reorders date parts with slash as delimiter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۳۵۵/۱۰/۲۳"
Received: "۲۱۳۵۵/۱۰/۳"

[Killed] BlockStatement
src/processors/DateNormalizerProcessor.ts:16:57
   public process(text: string): string {
     return text.replace(
       /([0-9۰-۹]{1,2})([/-])([0-9۰-۹]{1,2})\2([0-9۰-۹]{4})/g,
-      function (_matched, day, _delimiter, month, year) {
-        return `${year}/${month}/${day}`
-      },
+      function (_matched, day, _delimiter, month, year) {},
     )
   }
killedBy: Virastar #cleanup(): Additional extra: normalizeDates(): reorders date parts with slash as delimiter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۳۵۵/۱۰/۲۳"
Received: "undefined"

[Killed] StringLiteral
src/processors/DateNormalizerProcessor.ts:17:16
     return text.replace(
       /([0-9۰-۹]{1,2})([/-])([0-9۰-۹]{1,2})\2([0-9۰-۹]{4})/g,
       function (_matched, day, _delimiter, month, year) {
-        return `${year}/${month}/${day}`
+        return ``
       },
     )
killedBy: Virastar #cleanup(): Additional extra: normalizeDates(): reorders date parts with slash as delimiter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۳۵۵/۱۰/۲۳"
Received: ""
