[Survived] StringLiteral
src/processors/DiacriticsProcessor.ts:12:5
     '\u0652' +
     '\u064C' +
     '\u064D' +
-    '\u064B' +
+    "" +
     '\u064F' +
     '\u0650' +

[Survived] StringLiteral
src/processors/DiacriticsProcessor.ts:14:5
     '\u064D' +
     '\u064B' +
     '\u064F' +
-    '\u0650' +
+    "" +
     '\u064E' +
     '\u0651'

[Survived] StringLiteral
src/processors/DiacriticsProcessor.ts:16:5
     '\u064F' +
     '\u0650' +
     '\u064E' +
-    '\u0651'
+    ""
 
   /**

[Killed] BlockStatement
src/processors/DiacriticsProcessor.ts:24:40
 
    * @returns The text with diacritic characters replaced
    */
-  public process(text: string): string {
-    return (
-      text
-        // cleans zwnj before diacritic characters
-        .replace(new RegExp(`\u200c([${this.diacriticChars}])`, 'g'), '$1')
-
-        // cleans more than one diacritic characters
-        // props @languagetool-org
-        .replace(
-          new RegExp(`(.*)([${this.diacriticChars}]){2,}(.*)`, 'g'),
-          '$1$2$3',
-        )
-
-        // cleans spaces before diacritic characters
-        .replace(new RegExp(`(\\S) +([${this.diacriticChars}])`, 'g'), '$1$2')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Survived] StringLiteral
src/processors/DiacriticsProcessor.ts:33:64
         // cleans more than one diacritic characters
         // props @languagetool-org
         .replace(
-          new RegExp(`(.*)([${this.diacriticChars}]){2,}(.*)`, 'g'),
+          new RegExp(`(.*)([${this.diacriticChars}]){2,}(.*)`, ""),
           '$1$2$3',
         )

[Killed] StringLiteral
src/processors/DiacriticsProcessor.ts:34:11
         // props @languagetool-org
         .replace(
           new RegExp(`(.*)([${this.diacriticChars}]){2,}(.*)`, 'g'),
-          '$1$2$3',
+          "",
         )
 
killedBy: Virastar #cleanup(): Additional extra: fixDiacritics():‌ cleans more than one diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "لطفاً"
Received: ""

[Killed] StringLiteral
src/processors/DiacriticsProcessor.ts:38:29
         )
 
         // cleans spaces before diacritic characters
-        .replace(new RegExp(`(\\S) +([${this.diacriticChars}])`, 'g'), '$1$2')
+        .replace(new RegExp(``, 'g'), '$1$2')
     )
   }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."

[Survived] StringLiteral
src/processors/DiacriticsProcessor.ts:38:72
         )
 
         // cleans spaces before diacritic characters
-        .replace(new RegExp(`(\\S) +([${this.diacriticChars}])`, 'g'), '$1$2')
+        .replace(new RegExp(`(\\S) +([${this.diacriticChars}])`, 'g'), "")
     )
   }
