[Killed] BlockStatement
src/processors/EllipsisProcessor.ts:9:40
    * @param text The text to normalize.
    * @returns The normalized text.
    */
-  public process(text: string): string {
-    return (
-      text
-        // Replaces more than one ellipsis with one.
-        .replace(/(…){2,}/g, '…')
-        // Adds a space after ellipsis if needed.
-        .replace(/…([ \t\u200c]*)/g, '… ')
-        // Removes spaces before ellipsis.
-        .replace(/[ \t]+…/g, '…')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/EllipsisProcessor.ts:15:18
         // Replaces more than one ellipsis with one.
         .replace(/(…){2,}/g, '…')
         // Adds a space after ellipsis if needed.
-        .replace(/…([ \t\u200c]*)/g, '… ')
+        .replace(/…([^ \t\u200c]*)/g, '… ')
         // Removes spaces before ellipsis.
         .replace(/[ \t]+…/g, '…')
killedBy: Virastar normalizeEllipsis should replace more than one ellipsis with one
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام…"
Received: "سلام… "

[Killed] StringLiteral
src/processors/EllipsisProcessor.ts:15:38
         // Replaces more than one ellipsis with one.
         .replace(/(…){2,}/g, '…')
         // Adds a space after ellipsis if needed.
-        .replace(/…([ \t\u200c]*)/g, '… ')
+        .replace(/…([ \t\u200c]*)/g, "")
         // Removes spaces before ellipsis.
         .replace(/[ \t]+…/g, '…')
killedBy: Virastar #cleanup() should cleanup simple sentences #4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند…"
Received: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند"
