[Killed] BlockStatement
src/processors/EndOfLineProcessor.ts:13:40
    * @param text - The input text to be normalized.
    * @returns The normalized text with all Windows-style and Mac-style end of line characters replaced with Unix-style end of line character.
    */
-  public process(text: string): string {
-    // Replace all Windows-style and Mac-style end of line characters with Unix-style end of line character (\n)
-    return text.replace(/\r?\n|\r/g, '\n')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')
