[Killed] StringLiteral
src/processors/EnglishNumbersProcessor.ts:8:5
  */
 export class EnglishNumbersProcessor extends BaseProcessor {
   private readonly persianDigits: string =
-    '\u06F1' + // Persian digit 1
+    "" + // Persian digit 1
     '\u06F2' + // Persian digit 2
     '\u06F3' + // Persian digit 3
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "۲. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] StringLiteral
src/processors/EnglishNumbersProcessor.ts:12:5
     '\u06F2' + // Persian digit 2
     '\u06F3' + // Persian digit 3
     '\u06F4' + // Persian digit 4
-    '\u06F5' + // Persian digit 5
+    "" + // Persian digit 5
     '\u06F6' + // Persian digit 6
     '\u06F7' + // Persian digit 7
killedBy: Virastar #cleanup() should cleanup simple sentences #3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۵۶"
Received: "۳. اعداد عربی و انگلیسی و علائم ریاضی را به معادل فارسی آن‌ها تبدیل می‌کند. مثلا: ۱۲٪ ۴۶۷"

[Killed] StringLiteral
src/processors/EnglishNumbersProcessor.ts:14:5
     '\u06F4' + // Persian digit 4
     '\u06F5' + // Persian digit 5
     '\u06F6' + // Persian digit 6
-    '\u06F7' + // Persian digit 7
+    "" + // Persian digit 7
     '\u06F8' + // Persian digit 8
     '\u06F9' + // Persian digit 9
killedBy: Virastar #cleanup() should cleanup simple sentences #7
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۷. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می»، «تر» و «ترین» یک نیم فاصله قرار می‌دهد. بین ویرگول یا نقطه و کلمه قبل آن فاصله را حذف می‌کند."
Received: "۸. فاصله گذاری را تصحیح می‌کند. بین هر کلمه تنها یک فاصله و بین پیشوندها و پسوندهای مانند «می»، «تر» و «ترین» یک نیم فاصله قر

[Killed] StringLiteral
src/processors/EnglishNumbersProcessor.ts:16:5
     '\u06F6' + // Persian digit 6
     '\u06F7' + // Persian digit 7
     '\u06F8' + // Persian digit 8
-    '\u06F9' + // Persian digit 9
+    "" + // Persian digit 9
     '\u06F0' // Persian digit 0
 
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۰. علامت تعحب و سوال اضافی را حذف می‌کند؟!"

[Killed] BlockStatement
src/processors/EnglishNumbersProcessor.ts:27:40
    * @param text - The input text to be processed.
    * @returns The processed text with Persian numbers.
    */
-  public process(text: string): string {
-    return text
-      .split('')
-      .map((char) =>
-        this.englishDigits.includes(char)
-          ? this.persianDigits.charAt(this.englishDigits.indexOf(char))
-          : char,
-      )
-      .join('')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/EnglishNumbersProcessor.ts:29:14
    */
   public process(text: string): string {
     return text
-      .split('')
+      .split("Stryker was here!")
       .map((char) =>
         this.englishDigits.includes(char)
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "1. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] ArrowFunction
src/processors/EnglishNumbersProcessor.ts:30:12
   public process(text: string): string {
     return text
       .split('')
-      .map((char) =>
-        this.englishDigits.includes(char)
-          ? this.persianDigits.charAt(this.englishDigits.indexOf(char))
-          : char,
+      .map(() => undefined,
       )
       .join('')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: ""

[Killed] MethodExpression
src/processors/EnglishNumbersProcessor.ts:32:13
       .split('')
       .map((char) =>
         this.englishDigits.includes(char)
-          ? this.persianDigits.charAt(this.englishDigits.indexOf(char))
+          ? this.persianDigits
           : char,
       )
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "۱۲۳۴۵۶۷۸۹۰. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
