[Killed] BlockStatement
src/processors/EnglishQuotesPairsProcessor.ts:10:40
    * @param text The text to fix.
    * @returns The fixed text.
    */
-  public process(text: string): string {
-    return text.replace(/“(.+?)”/g, '«$1»')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/EnglishQuotesPairsProcessor.ts:11:37
    * @returns The fixed text.
    */
   public process(text: string): string {
-    return text.replace(/“(.+?)”/g, '«$1»')
+    return text.replace(/“(.+?)”/g, "")
   }
 }
killedBy: Virastar fixEnglishQuotesPairs should replace English quote pairs with their Persian equivalent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "«Hello, World!»"
Received: ""
