[Killed] BlockStatement
src/processors/EnglishQuotesProcessor.ts:9:40
    * @param text The input string in Persian to be fixed.
    * @returns Returns a string with English quote marks replaced with their Persian equivalent.
    */
-  public process(text: string): string {
-    return text.replace(/(["'`]+)(.+?)(\1)/g, '«$2»')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/EnglishQuotesProcessor.ts:10:25
    * @returns Returns a string with English quote marks replaced with their Persian equivalent.
    */
   public process(text: string): string {
-    return text.replace(/(["'`]+)(.+?)(\1)/g, '«$2»')
+    return text.replace(/(["'`]+)(.)(\1)/g, '«$2»')
   }
 }
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نق

[Killed] Regex
src/processors/EnglishQuotesProcessor.ts:10:25
    * @returns Returns a string with English quote marks replaced with their Persian equivalent.
    */
   public process(text: string): string {
-    return text.replace(/(["'`]+)(.+?)(\1)/g, '«$2»')
+    return text.replace(/([^"'`]+)(.+?)(\1)/g, '«$2»')
   }
 }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "«یراستار به شما کمک می‌کند تا متون فارسی زیباتر» «درست» تر «بنو» سید «.»"
