[Killed] BlockStatement
src/processors/ExtraMarksProcessor.ts:10:40
    * @param text The input text to clean up.
    * @returns The cleaned text.
    */
-  public process(text: string): string {
-    // remove extra marks
-    text = this.cleanupExtraMarks(text)
-
-    return text
-  }
+  public process(text: string): string {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/processors/ExtraMarksProcessor.ts:23:43
    * @param text The input text to clean up.
    * @returns The cleaned text.
    */
-  private cleanupExtraMarks(text: string) {
-    // remove space between different/same marks
-    text = text.replace(/([؟?!])([ ]+)(?=[؟?!])/g, '$1')
-
-    // replace more than one exclamation mark with just one
-    text = text.replace(/(!){2,}/g, '$1')
-
-    // replace more than one english or persian question mark with just one
-    text = text.replace(/([\u061F?]){2,}/g, '$1')
-
-    // re-order consecutive marks
-    text = text.replace(/(!)([ \t]*)([\u061F?])/g, '$3$1')
-
-    // `?!` --> `!?`
-    return text
-  }
+  private cleanupExtraMarks(text: string) {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/ExtraMarksProcessor.ts:25:25
    */
   private cleanupExtraMarks(text: string) {
     // remove space between different/same marks
-    text = text.replace(/([؟?!])([ ]+)(?=[؟?!])/g, '$1')
+    text = text.replace(/([؟?!])([ ]+)(?![؟?!])/g, '$1')
 
     // replace more than one exclamation mark with just one
killedBy: Virastar cleanupExtraMarks should remove extra marks from the text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام؟! چطورید؟!"
Received: "سلام؟!چطورید؟!"

[Killed] Regex
src/processors/ExtraMarksProcessor.ts:25:25
    */
   private cleanupExtraMarks(text: string) {
     // remove space between different/same marks
-    text = text.replace(/([؟?!])([ ]+)(?=[؟?!])/g, '$1')
+    text = text.replace(/([؟?!])([ ]+)(?=[^؟?!])/g, '$1')
 
     // replace more than one exclamation mark with just one
killedBy: Virastar cleanupExtraMarks should remove extra marks from the text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام؟! چطورید؟!"
Received: "سلام؟!چطورید؟!"

[Killed] Regex
src/processors/ExtraMarksProcessor.ts:28:25
     text = text.replace(/([؟?!])([ ]+)(?=[؟?!])/g, '$1')
 
     // replace more than one exclamation mark with just one
-    text = text.replace(/(!){2,}/g, '$1')
+    text = text.replace(/(!)/g, '$1')
 
     // replace more than one english or persian question mark with just one
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!!!!!!!"

[Killed] Regex
src/processors/ExtraMarksProcessor.ts:31:25
     text = text.replace(/(!){2,}/g, '$1')
 
     // replace more than one english or persian question mark with just one
-    text = text.replace(/([\u061F?]){2,}/g, '$1')
+    text = text.replace(/([^\u061F?]){2,}/g, '$1')
 
     // re-order consecutive marks
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: ""

[Killed] StringLiteral
src/processors/ExtraMarksProcessor.ts:34:52
     text = text.replace(/([\u061F?]){2,}/g, '$1')
 
     // re-order consecutive marks
-    text = text.replace(/(!)([ \t]*)([\u061F?])/g, '$3$1')
+    text = text.replace(/(!)([ \t]*)([\u061F?])/g, "")
 
     // `?!` --> `!?`
killedBy: Virastar #cleanup(): Additional should normalize question/exclamation marks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست؟!"
Received: "عادت به تنهایی… این دیگر از آن حرف‌هاست"

[Killed] Regex
src/processors/ExtraMarksProcessor.ts:34:25
     text = text.replace(/([\u061F?]){2,}/g, '$1')
 
     // re-order consecutive marks
-    text = text.replace(/(!)([ \t]*)([\u061F?])/g, '$3$1')
+    text = text.replace(/(!)([ \t]*)([^\u061F?])/g, '$3$1')
 
     // `?!` --> `!?`
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "[! alt name](https://example.com/media/image.jpg)"
