[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:24:15
     '\u0631': '\uFEAD\uFEAE', // Reh
     '\u0632': '\uFEAF\uFEB0', // Ze
     '\u0633': '\uFEB1\uFEB2\uFEB3\uFEB4', // Seen
-    '\u0634': '\uFEB5\uFEB6\uFEB7\uFEB8', // Sheen
+    '\u0634': "", // Sheen
     '\u0635': '\uFEB9\uFEBA\uFEBB\uFEBC', // Sad
     '\u0636': '\uFEBD\uFEBE\uFEBF\uFEC0', // Zad

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:27:15
     '\u0634': '\uFEB5\uFEB6\uFEB7\uFEB8', // Sheen
     '\u0635': '\uFEB9\uFEBA\uFEBB\uFEBC', // Sad
     '\u0636': '\uFEBD\uFEBE\uFEBF\uFEC0', // Zad
-    '\u0637': '\uFEC1\uFEC2\uFEC3\uFEC4', // Toh
+    '\u0637': "", // Toh
     '\u0638': '\uFEC5\uFEC6\uFEC7\uFEC8', // Zah
     '\u0639': '\uFEC9\uFECA\uFECB\uFECC', // Ain

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:29:15
     '\u0636': '\uFEBD\uFEBE\uFEBF\uFEC0', // Zad
     '\u0637': '\uFEC1\uFEC2\uFEC3\uFEC4', // Toh
     '\u0638': '\uFEC5\uFEC6\uFEC7\uFEC8', // Zah
-    '\u0639': '\uFEC9\uFECA\uFECB\uFECC', // Ain
+    '\u0639': "", // Ain
     '\u063A': '\uFECD\uFECE\uFECF\uFED0', // Ghain
     '\u0641': '\uFED1\uFED2\uFED3\uFED4', // Feh

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:30:15
     '\u0637': '\uFEC1\uFEC2\uFEC3\uFEC4', // Toh
     '\u0638': '\uFEC5\uFEC6\uFEC7\uFEC8', // Zah
     '\u0639': '\uFEC9\uFECA\uFECB\uFECC', // Ain
-    '\u063A': '\uFECD\uFECE\uFECF\uFED0', // Ghain
+    '\u063A': "", // Ghain
     '\u0641': '\uFED1\uFED2\uFED3\uFED4', // Feh
     '\u0642': '\uFED5\uFED6\uFED7\uFED8', // Ghaf

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:34:21
     '\u0641': '\uFED1\uFED2\uFED3\uFED4', // Feh
     '\u0642': '\uFED5\uFED6\uFED7\uFED8', // Ghaf
     '\u0644': '\uFEDD\uFEDE\uFEDF\uFEE0', // Lam
-    '\u0644\u0627': '\uFEFC', // La + Alef
+    '\u0644\u0627': "", // La + Alef
     '\u0645': '\uFEE1\uFEE2\uFEE3\uFEE4', // Mim
     '\u0646': '\uFEE5\uFEE6\uFEE7\uFEE8', // Noon

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:35:15
     '\u0642': '\uFED5\uFED6\uFED7\uFED8', // Ghaf
     '\u0644': '\uFEDD\uFEDE\uFEDF\uFEE0', // Lam
     '\u0644\u0627': '\uFEFC', // La + Alef
-    '\u0645': '\uFEE1\uFEE2\uFEE3\uFEE4', // Mim
+    '\u0645': "", // Mim
     '\u0646': '\uFEE5\uFEE6\uFEE7\uFEE8', // Noon
     '\u0647': '\uFEE9\uFEEA\uFEEB\uFEEC', // Heh

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:37:15
     '\u0644\u0627': '\uFEFC', // La + Alef
     '\u0645': '\uFEE1\uFEE2\uFEE3\uFEE4', // Mim
     '\u0646': '\uFEE5\uFEE6\uFEE7\uFEE8', // Noon
-    '\u0647': '\uFEE9\uFEEA\uFEEB\uFEEC', // Heh
+    '\u0647': "", // Heh
     '\u0647\u0654': '\uFBA4\uFBA5',
     '\u0648': '\uFEED\uFEEE',

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:38:21
     '\u0645': '\uFEE1\uFEE2\uFEE3\uFEE4', // Mim
     '\u0646': '\uFEE5\uFEE6\uFEE7\uFEE8', // Noon
     '\u0647': '\uFEE9\uFEEA\uFEEB\uFEEC', // Heh
-    '\u0647\u0654': '\uFBA4\uFBA5',
+    '\u0647\u0654': "",
     '\u0648': '\uFEED\uFEEE',
     '\u067E': '\uFB56\uFB57\uFB58\uFB59',

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:41:15
     '\u0647\u0654': '\uFBA4\uFBA5',
     '\u0648': '\uFEED\uFEEE',
     '\u067E': '\uFB56\uFB57\uFB58\uFB59',
-    '\u0686': '\uFB7A\uFB7B\uFB7C\uFB7D',
+    '\u0686': "",
     '\u0698': '\uFB8A\uFB8B',
     '\u06A9': '\uFB8E\uFB8F\uFB90\uFB91\uFED9\uFEDA\uFEDB\uFEDC',

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:52:15
     '\uFE83': '\uFE84\uFE83',
     '\uFE85': '\uFE85\uFE86',
     '\uFE87': '\uFE87\uFE88',
-    '\uFEF5': '\uFEF6',
+    '\uFEF5': "",
     '\uFEF7': '\uFEF8',
     '\uFEF9': '\uFEFA',

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:53:15
     '\uFE85': '\uFE85\uFE86',
     '\uFE87': '\uFE87\uFE88',
     '\uFEF5': '\uFEF6',
-    '\uFEF7': '\uFEF8',
+    '\uFEF7': "",
     '\uFEF9': '\uFEFA',
   }

[Survived] StringLiteral
src/processors/GlyphsProcessor.ts:54:15
     '\uFE87': '\uFE87\uFE88',
     '\uFEF5': '\uFEF6',
     '\uFEF7': '\uFEF8',
-    '\uFEF9': '\uFEFA',
+    '\uFEF9': "",
   }
 

[Killed] BlockStatement
src/processors/GlyphsProcessor.ts:64:40
    * @param array An object that maps characters to their standardized glyphs.
    * @returns A string with all incorrect glyphs replaced by their corresponding standard characters.
    */
-  public process(text: string): string {
-    return this.arrReplace(text, this.glyphs)
-  }
+  public process(text: string): string {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/processors/GlyphsProcessor.ts:74:70
    * @param array
    * @returns The modified text after replacing characters
    */
-  private arrReplace(text: string, array: { [key: string]: string }) {
-    for (const i in array) {
-      if (array.hasOwnProperty(i)) {
-        text = text.replace(new RegExp(`[${array[i]}]`, 'g'), i)
-      }
-    }
-    return text
-  }
+  private arrReplace(text: string, array: { [key: string]: string }) {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/processors/GlyphsProcessor.ts:75:28
    * @returns The modified text after replacing characters
    */
   private arrReplace(text: string, array: { [key: string]: string }) {
-    for (const i in array) {
-      if (array.hasOwnProperty(i)) {
-        text = text.replace(new RegExp(`[${array[i]}]`, 'g'), i)
-      }
-    }
+    for (const i in array) {}
     return text
   }
killedBy: Virastar fixPersianGlyphs should replace incorrect persian glyphs with standard characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پ ع خ ک ک ر ل"
Received: "ﭖ ﻉ ﺥ ﮎ ﻛ ﺭ ﻝ"

[Killed] BlockStatement
src/processors/GlyphsProcessor.ts:76:36
    */
   private arrReplace(text: string, array: { [key: string]: string }) {
     for (const i in array) {
-      if (array.hasOwnProperty(i)) {
-        text = text.replace(new RegExp(`[${array[i]}]`, 'g'), i)
-      }
+      if (array.hasOwnProperty(i)) {}
     }
     return text
killedBy: Virastar fixPersianGlyphs should replace incorrect persian glyphs with standard characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پ ع خ ک ک ر ل"
Received: "ﭖ ﻉ ﺥ ﮎ ﻛ ﺭ ﻝ"

[Killed] ConditionalExpression
src/processors/GlyphsProcessor.ts:76:11
    */
   private arrReplace(text: string, array: { [key: string]: string }) {
     for (const i in array) {
-      if (array.hasOwnProperty(i)) {
+      if (false) {
         text = text.replace(new RegExp(`[${array[i]}]`, 'g'), i)
       }
killedBy: Virastar fixPersianGlyphs should replace incorrect persian glyphs with standard characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پ ع خ ک ک ر ل"
Received: "ﭖ ﻉ ﺥ ﮎ ﻛ ﺭ ﻝ"

[Killed] StringLiteral
src/processors/GlyphsProcessor.ts:77:57
   private arrReplace(text: string, array: { [key: string]: string }) {
     for (const i in array) {
       if (array.hasOwnProperty(i)) {
-        text = text.replace(new RegExp(`[${array[i]}]`, 'g'), i)
+        text = text.replace(new RegExp(`[${array[i]}]`, ""), i)
       }
     }
killedBy: Virastar fixPersianGlyphs should replace incorrect persian glyphs with standard characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "پ ع خ ک ک ر ل"
Received: "پ ع خ ک ﻛ ر ل"
