[Killed] BlockStatement
src/processors/HamzehArabicAltProcessor.ts:9:40
    * @param text Input text in Persian
    * @returns Text with Hamzeh ة replaced with ه‌ی
    */
-  public process(text: string): string {
-    return text.replace(/(\S)ة([\s\u200c\u200e])/g, '$1ه‌ی$2')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/HamzehArabicAltProcessor.ts:10:25
    * @returns Text with Hamzeh ة replaced with ه‌ی
    */
   public process(text: string): string {
-    return text.replace(/(\S)ة([\s\u200c\u200e])/g, '$1ه‌ی$2')
+    return text.replace(/(\S)ة([\S\u200c\u200e])/g, '$1ه‌ی$2')
   }
 }
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کننده‌ی انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کنندة انتهای جمله"

[Killed] StringLiteral
src/processors/HamzehArabicAltProcessor.ts:10:53
    * @returns Text with Hamzeh ة replaced with ه‌ی
    */
   public process(text: string): string {
-    return text.replace(/(\S)ة([\s\u200c\u200e])/g, '$1ه‌ی$2')
+    return text.replace(/(\S)ة([\s\u200c\u200e])/g, "")
   }
 }
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کننده‌ی انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کننانتهای جمله"
