[Killed] BlockStatement
src/processors/HamzehArabicProcessor.ts:13:40
    * @param text - The input string to replace Arabic hamzeh in.
    * @returns The input string with Arabic hamzeh replaced with هٔ.
    */
-  public process(text: string): string {
-    return text.replace(/(\S)\u0629([\s\u200c\u200e])/g, '$1\u0647\u0654$2')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/HamzehArabicProcessor.ts:14:25
    * @returns The input string with Arabic hamzeh replaced with هٔ.
    */
   public process(text: string): string {
-    return text.replace(/(\S)\u0629([\s\u200c\u200e])/g, '$1\u0647\u0654$2')
+    return text.replace(/(\S)\u0629([\S\u200c\u200e])/g, '$1\u0647\u0654$2')
   }
 }
killedBy: Virastar #cleanup(): Additional extra: fixHamzehArabic(): converts arabic hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "آن دسته از علایم که مشخص‌کنندهٔ انتهای جمله"
Received: "آن دسته از علایم که مشخص‌کنندة انتهای جمله"
