[Killed] BlockStatement
src/processors/HamzehProcessor.ts:10:40
    * @param text The text to fix.
    * @returns The fixed text.
    */
-  public process(text: string): string {
-    const replacement = '$1هٔ$3'
-
-    return (
-      text
-        // replaces ه followed by (space|ZWNJ|lrm) follow by ی with هٔ
-        .replace(/(\S)(ه[\s\u200c\u200e]+[یي])([\s\u200c\u200e])/g, replacement)
-
-        // replaces ه followed by (space|ZWNJ|lrm|nothing) follow by ء with هٔ
-        .replace(
-          /(\S)(ه[\s\u200c\u200e]?\u0621)([\s\u200c\u200e])/g,
-          replacement,
-        )
-
-        // replaces هٓ or single-character ۀ with the standard هٔ
-        .replace(/(ۀ|هٓ)/g, 'هٔ')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/HamzehProcessor.ts:16:18
     return (
       text
         // replaces ه followed by (space|ZWNJ|lrm) follow by ی with هٔ
-        .replace(/(\S)(ه[\s\u200c\u200e]+[یي])([\s\u200c\u200e])/g, replacement)
+        .replace(/(\S)(ه[^\s\u200c\u200e]+[یي])([\s\u200c\u200e])/g, replacement)
 
         // replaces ه followed by (space|ZWNJ|lrm|nothing) follow by ء with هٔ
killedBy: Virastar #cleanup() should cleanup simple sentences #5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام می‌شوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
Received: "۵. در ترکیباتی مانند «خانه ی پدری» که با «ه» تمام می‌شوند نشانه «ی» کسره ی اضافه را به «هٔ» تبدیل می‌کند."

[Killed] Regex
src/processors/HamzehProcessor.ts:20:11
 
         // replaces ه followed by (space|ZWNJ|lrm|nothing) follow by ء with هٔ
         .replace(
-          /(\S)(ه[\s\u200c\u200e]?\u0621)([\s\u200c\u200e])/g,
+          /(\S)(ه[\s\u200c\u200e]\u0621)([\s\u200c\u200e])/g,
           replacement,
         )
killedBy: Virastar #cleanup(): Additional should fix heh plus standalone hamza
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "از غم به هر بهانهٔ ممکن عبور کن!"
Received: "از غم به هر بهانهء ممکن عبور کن!"
