[Killed] BlockStatement
src/processors/KashidasAsParentheticProcessor.ts:10:40
    * @param {string} text - The input text to replace kashidas in
    * @returns {string} The modified text with kashidas replaced with ndash
    */
-  public process(text: string): string {
-    // Replace kashidas preceded by whitespace with ndash
-    text = text.replace(/(\s)\u0640+/g, '$1–')
-    // Replace kashidas followed by whitespace with ndash
-    text = text.replace(/\u0640+(\s)/g, '–$1')
-    return text
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/KashidasAsParentheticProcessor.ts:12:41
    */
   public process(text: string): string {
     // Replace kashidas preceded by whitespace with ndash
-    text = text.replace(/(\s)\u0640+/g, '$1–')
+    text = text.replace(/(\s)\u0640+/g, "")
     // Replace kashidas followed by whitespace with ndash
     text = text.replace(/\u0640+(\s)/g, '–$1')
killedBy: Virastar #cleanup() should replace kashidas to ndash in parenthetic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "– که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم –"
Received: "که در واقع پدرخوانده‌ام بود ولی من او را جای پدرم می‌دانستم"

[Killed] Regex
src/processors/KashidasAsParentheticProcessor.ts:14:25
     // Replace kashidas preceded by whitespace with ndash
     text = text.replace(/(\s)\u0640+/g, '$1–')
     // Replace kashidas followed by whitespace with ndash
-    text = text.replace(/\u0640+(\s)/g, '–$1')
+    text = text.replace(/\u0640+(\S)/g, '–$1')
     return text
   }
killedBy: Virastar #cleanup() should remove all kashida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلامت"
Received: "سلام–ت"
