[Killed] BlockStatement
src/processors/KashidasProcessor.ts:10:40
    * @param {string} text - The text to clean up
    * @returns {string} The cleaned up text
    */
-  public process(text: string): string {
-    return (
-      text
-        // converts kashida between numbers to ndash
-        .replace(/([0-9۰-۹]+)ـ+([0-9۰-۹]+)/g, '$1–$2')
-
-        // removes all kashidas between non-whitespace characters
-        // MAYBE: more punctuations
-        .replace(/([^\s.])\u0640+(?![\s.])/g, '$1')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/KashidasProcessor.ts:14:47
     return (
       text
         // converts kashida between numbers to ndash
-        .replace(/([0-9۰-۹]+)ـ+([0-9۰-۹]+)/g, '$1–$2')
+        .replace(/([0-9۰-۹]+)ـ+([0-9۰-۹]+)/g, "")
 
         // removes all kashidas between non-whitespace characters
killedBy: Virastar #cleanup(): Additional extra: cleanupKashidas(): converts kashida between numbers to ndash
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۱–۲۳"
Received: ""

[Killed] Regex
src/processors/KashidasProcessor.ts:18:18
 
         // removes all kashidas between non-whitespace characters
         // MAYBE: more punctuations
-        .replace(/([^\s.])\u0640+(?![\s.])/g, '$1')
+        .replace(/([^\s.])\u0640+(?![\S.])/g, '$1')
     )
   }
killedBy: Virastar #cleanup() should remove all kashida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلامت"
Received: "سلامـــت"

[Killed] Regex
src/processors/KashidasProcessor.ts:18:18
 
         // removes all kashidas between non-whitespace characters
         // MAYBE: more punctuations
-        .replace(/([^\s.])\u0640+(?![\s.])/g, '$1')
+        .replace(/([\s.])\u0640+(?![\s.])/g, '$1')
     )
   }
killedBy: Virastar #cleanup() should remove all kashida
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلامت"
Received: "سلامـــت"
