[Killed] BlockStatement
src/processors/LeadingAndTrailingSpaceProcessor.ts:13:40
    * @param text - The text to process.
    * @returns The processed text.
    */
-  public process(text: string): string {
-    // Removes space/tab/zwnj/nbsp from the beginning of the new-lines.
-    text = text.replace(/(\n+)[ \t\u200c\u00a0]*/g, '$1')
-
-    // Removes spaces, tabs, zwnj, direction marks, and new lines from
-    // the beginning and end of text.
-    // Ref: https://stackoverflow.com/a/38490203
-    return text.replace(
-      /^[\s\u200c\u200e\u200f]+|[\s\u200c\u200e\u200f]+$/g,
-      '',
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: undefined

[Killed] StringLiteral
src/processors/LeadingAndTrailingSpaceProcessor.ts:15:53
    */
   public process(text: string): string {
     // Removes space/tab/zwnj/nbsp from the beginning of the new-lines.
-    text = text.replace(/(\n+)[ \t\u200c\u00a0]*/g, '$1')
+    text = text.replace(/(\n+)[ \t\u200c\u00a0]*/g, "")
 
     // Removes spaces, tabs, zwnj, direction marks, and new lines from
killedBy: Virastar #cleanup() should not replace line breaks and should remove spaces after line break
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- this is 
- a test
+ this is a test

[Killed] Regex
src/processors/LeadingAndTrailingSpaceProcessor.ts:15:25
    */
   public process(text: string): string {
     // Removes space/tab/zwnj/nbsp from the beginning of the new-lines.
-    text = text.replace(/(\n+)[ \t\u200c\u00a0]*/g, '$1')
+    text = text.replace(/(\n+)[^ \t\u200c\u00a0]*/g, '$1')
 
     // Removes spaces, tabs, zwnj, direction marks, and new lines from
killedBy: Virastar #cleanup() should not replace line breaks and should remove spaces after line break
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  this is 
- a test
+  a test

[Killed] Regex
src/processors/LeadingAndTrailingSpaceProcessor.ts:21:7
     // the beginning and end of text.
     // Ref: https://stackoverflow.com/a/38490203
     return text.replace(
-      /^[\s\u200c\u200e\u200f]+|[\s\u200c\u200e\u200f]+$/g,
+      /[\s\u200c\u200e\u200f]+|[\s\u200c\u200e\u200f]+$/g,
       '',
     )
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستاربهشماکمکمیکندتامتونفارسیزیباترودرستتریبنویسید."

[Killed] Regex
src/processors/LeadingAndTrailingSpaceProcessor.ts:21:7
     // the beginning and end of text.
     // Ref: https://stackoverflow.com/a/38490203
     return text.replace(
-      /^[\s\u200c\u200e\u200f]+|[\s\u200c\u200e\u200f]+$/g,
+      /^[\s\u200c\u200e\u200f]+|[\S\u200c\u200e\u200f]+$/g,
       '',
     )
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید. "
