[Killed] BlockStatement
src/processors/LineBreakProcessor.ts:13:40
 
    * @returns {string} - The cleaned text.
    */
-  public process(text: string): string {
-    // Cleans more than two contiguous line-breaks.
-    return text.replace(/\n{2,}/g, '\n\n')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')
