[Killed] BlockStatement
src/processors/MarkdownListProcessor.ts:13:40
 
    * @returns The normalized text
    */
-  public process(text: string): string {
-    // removes extra line between two items list
-    return text.replace(/([\*\-\#]\s+.+?)\n{2,}(?=(?:[\*\-\#]\s+)|$)/g, '$1\n')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/MarkdownListProcessor.ts:15:73
    */
   public process(text: string): string {
     // removes extra line between two items list
-    return text.replace(/([\*\-\#]\s+.+?)\n{2,}(?=(?:[\*\-\#]\s+)|$)/g, '$1\n')
+    return text.replace(/([\*\-\#]\s+.+?)\n{2,}(?=(?:[\*\-\#]\s+)|$)/g, "")
   }
 }
killedBy: Virastar markdownNormalizeLists should remove extra line between two items list for bulleted lists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 0

- * item 1
  * item 2

[Killed] Regex
src/processors/MarkdownListProcessor.ts:15:25
    */
   public process(text: string): string {
     // removes extra line between two items list
-    return text.replace(/([\*\-\#]\s+.+?)\n{2,}(?=(?:[\*\-\#]\s+)|$)/g, '$1\n')
+    return text.replace(/([\*\-\#]\s+.+?)\n{2,}(?=(?:[\*\-\#]\S+)|$)/g, '$1\n')
   }
 }
killedBy: Virastar markdownNormalizeLists should remove extra line between two items list for bulleted lists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

  * item 1
+
  * item 2
