[Killed] BlockStatement
src/processors/MarkdownNormalizerProcessor.ts:14:40
    * @param text - The input text to process.
    * @returns The processed output text.
    */
-  public process(text: string): string {
-    return (
-      text
-        // removes space between ! and opening brace on markdown images
-        // EXAMPLE: `! [alt] (src)` --> `![alt](src)`
-        .replace(/! (\[.*?])[ ]?(\(.*?\))[ ]?/g, '!$1$2')
-
-        // removes spaces between [] and ()
-        // EXAMPLE: `[text] (link)` --> `[text](link)`
-        .replace(/(\[.*?])[ \t]+(\(.*?\))/g, '$1$2')
-
-        // removes spaces inside double () [] {}
-        // EXAMPLE: `[[ text ]]` --> `[[text]]`
-        .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
-        .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
-        .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
-        .replace(/\{\{\{[ \t]*(.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
-
-        // removes spaces between double () [] {}
-        // EXAMPLE: `[[text] ]` --> `[[text]]`
-        .replace(/(\(\(.*\))[ \t]+(\))/g, '$1$2')
-        .replace(/(\[\[.*])[ \t]+(])/g, '$1$2')
-        .replace(/(\{\{.*})[ \t]+(})/g, '$1$2')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/MarkdownNormalizerProcessor.ts:19:18
       text
         // removes space between ! and opening brace on markdown images
         // EXAMPLE: `! [alt] (src)` --> `![alt](src)`
-        .replace(/! (\[.*?])[ ]?(\(.*?\))[ ]?/g, '!$1$2')
+        .replace(/! (\[.])[ ]?(\(.*?\))[ ]?/g, '!$1$2')
 
         // removes spaces between [] and ()
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "![alt name](https://example.com/media/image.jpg)"
Received: "! [alt name](https://example.com/media/image.jpg)"

[Killed] Regex
src/processors/MarkdownNormalizerProcessor.ts:19:18
       text
         // removes space between ! and opening brace on markdown images
         // EXAMPLE: `! [alt] (src)` --> `![alt](src)`
-        .replace(/! (\[.*?])[ ]?(\(.*?\))[ ]?/g, '!$1$2')
+        .replace(/! (\[.*?])[ ]?(\(.*?\))[^ ]?/g, '!$1$2')
 
         // removes spaces between [] and ()
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[![alt name](https://example.com/media/image.jpg)](https://example.com/media/image.jpg)"
Received: "[![alt name](https://example.com/media/image.jpg) ](https://example.com/media/image.jpg)"

[Killed] Regex
src/processors/MarkdownNormalizerProcessor.ts:23:18
 
         // removes spaces between [] and ()
         // EXAMPLE: `[text] (link)` --> `[text](link)`
-        .replace(/(\[.*?])[ \t]+(\(.*?\))/g, '$1$2')
+        .replace(/(\[.*?])[ \t]+(\(.\))/g, '$1$2')
 
         // removes spaces inside double () [] {}
killedBy: Virastar #cleanup(): Equals should preserve certain strings
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[![alt name](https://example.com/media/image.jpg)](https://example.com/media/image.jpg)"
Received: "[![alt name](https://example.com/media/image.jpg)] (https://example.com/media/image.jpg)"

[Survived] StringLiteral
src/processors/MarkdownNormalizerProcessor.ts:27:48
 
         // removes spaces inside double () [] {}
         // EXAMPLE: `[[ text ]]` --> `[[text]]`
-        .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
+        .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, "")
         .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
         .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')

[Killed] Regex
src/processors/MarkdownNormalizerProcessor.ts:28:18
         // removes spaces inside double () [] {}
         // EXAMPLE: `[[ text ]]` --> `[[text]]`
         .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
-        .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
+        .replace(/\[\[[ \t]*(.)[ \t]*]]/g, '[[$1]]')
         .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
         .replace(/\{\{\{[ \t]*(.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
killedBy: Virastar markdownNormalizeBraces should remove spaces inside double () [] {}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[[text]]"
Received: "[[ text ]]"

[Killed] Regex
src/processors/MarkdownNormalizerProcessor.ts:28:18
         // removes spaces inside double () [] {}
         // EXAMPLE: `[[ text ]]` --> `[[text]]`
         .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
-        .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
+        .replace(/\[\[[^ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
         .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
         .replace(/\{\{\{[ \t]*(.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
killedBy: Virastar markdownNormalizeBraces should remove spaces inside double () [] {}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[[text]]"
Received: "[[ text]]"

[Survived] Regex
src/processors/MarkdownNormalizerProcessor.ts:29:18
         // EXAMPLE: `[[ text ]]` --> `[[text]]`
         .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
         .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
-        .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
+        .replace(/\{\{[^ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
         .replace(/\{\{\{[ \t]*(.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
 

[Survived] Regex
src/processors/MarkdownNormalizerProcessor.ts:29:18
         // EXAMPLE: `[[ text ]]` --> `[[text]]`
         .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
         .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
-        .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
+        .replace(/\{\{[ \t]*(.*?)[ \t]}}/g, '{{$1}}')
         .replace(/\{\{\{[ \t]*(.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
 

[Survived] Regex
src/processors/MarkdownNormalizerProcessor.ts:30:18
         .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
         .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
         .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
-        .replace(/\{\{\{[ \t]*(.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
+        .replace(/\{\{\{[ \t]*(.)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
 
         // removes spaces between double () [] {}

[Survived] Regex
src/processors/MarkdownNormalizerProcessor.ts:30:18
         .replace(/\(\([ \t]*(.*?)[ \t]*\)\)/g, '(($1))')
         .replace(/\[\[[ \t]*(.*?)[ \t]*]]/g, '[[$1]]')
         .replace(/\{\{[ \t]*(.*?)[ \t]*}}/g, '{{$1}}')
-        .replace(/\{\{\{[ \t]*(.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
+        .replace(/\{\{\{[ \t](.*?)[ \t]*}}}/g, '{{{$1}}}') // mustache escape
 
         // removes spaces between double () [] {}

[Survived] Regex
src/processors/MarkdownNormalizerProcessor.ts:34:18
 
         // removes spaces between double () [] {}
         // EXAMPLE: `[[text] ]` --> `[[text]]`
-        .replace(/(\(\(.*\))[ \t]+(\))/g, '$1$2')
+        .replace(/(\(\(.*\))[^ \t]+(\))/g, '$1$2')
         .replace(/(\[\[.*])[ \t]+(])/g, '$1$2')
         .replace(/(\{\{.*})[ \t]+(})/g, '$1$2')

[Killed] StringLiteral
src/processors/MarkdownNormalizerProcessor.ts:35:41
         // removes spaces between double () [] {}
         // EXAMPLE: `[[text] ]` --> `[[text]]`
         .replace(/(\(\(.*\))[ \t]+(\))/g, '$1$2')
-        .replace(/(\[\[.*])[ \t]+(])/g, '$1$2')
+        .replace(/(\[\[.*])[ \t]+(])/g, "")
         .replace(/(\{\{.*})[ \t]+(})/g, '$1$2')
     )
killedBy: Virastar markdownNormalizeBraces should remove spaces between double () [] {}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[[text]]"
Received: ""

[Killed] Regex
src/processors/MarkdownNormalizerProcessor.ts:35:18
         // removes spaces between double () [] {}
         // EXAMPLE: `[[text] ]` --> `[[text]]`
         .replace(/(\(\(.*\))[ \t]+(\))/g, '$1$2')
-        .replace(/(\[\[.*])[ \t]+(])/g, '$1$2')
+        .replace(/(\[\[.*])[^ \t]+(])/g, '$1$2')
         .replace(/(\{\{.*})[ \t]+(})/g, '$1$2')
     )
killedBy: Virastar markdownNormalizeBraces should remove spaces between double () [] {}
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "[[text]]"
Received: "[[text] ]"
