[Killed] StringLiteral
src/processors/MiscNonPersianCharsProcessor.ts:8:23
  * Persian equivalents.
  */
 export class MiscNonPersianCharsProcessor extends BaseProcessor {
-  private fromBatch = '\u0643\u06A9\u064A\u0649\u06CD\u06D0\u06C1\u06D5'
+  private fromBatch = ""
   private toBatch = '\u06A9\u06A9\u06CC\u06CC\u06CC\u06CC\u0647\u0647'
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ويراستار به شما كمك مي كند تا متون فارسي زيباتر و درست تري بنويسيد."

[Killed] StringLiteral
src/processors/MiscNonPersianCharsProcessor.ts:9:21
  */
 export class MiscNonPersianCharsProcessor extends BaseProcessor {
   private fromBatch = '\u0643\u06A9\u064A\u0649\u06CD\u06D0\u06C1\u06D5'
-  private toBatch = '\u06A9\u06A9\u06CC\u06CC\u06CC\u06CC\u0647\u0647'
+  private toBatch = ""
   /**
    * Replaces misc. non-Persian characters with their Persian equivalent.
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "وراستار به شما م م ند تا متون فارس زباتر و درست‌تر بنوسد."

[Killed] BlockStatement
src/processors/MiscNonPersianCharsProcessor.ts:16:40
    * @param text - The text to fix.
    * @returns The fixed text.
    */
-  public process(text: string): string {
-    return text
-      .split('')
-      .map((char) =>
-        this.fromBatch.includes(char)
-          ? this.toBatch.charAt(this.fromBatch.indexOf(char))
-          : char,
-      )
-      .join('')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
src/processors/MiscNonPersianCharsProcessor.ts:19:12
   public process(text: string): string {
     return text
       .split('')
-      .map((char) =>
-        this.fromBatch.includes(char)
-          ? this.toBatch.charAt(this.fromBatch.indexOf(char))
-          : char,
+      .map(() => undefined,
       )
       .join('')
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: ""

[Killed] MethodExpression
src/processors/MiscNonPersianCharsProcessor.ts:21:13
       .split('')
       .map((char) =>
         this.fromBatch.includes(char)
-          ? this.toBatch.charAt(this.fromBatch.indexOf(char))
+          ? this.toBatch
           : char,
       )
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "وککییییههراستار به شما ککییییههمککییییهه مککییییهه ککییییههند تا متون فارسککییییهه زککییییههباتر و درست ترککییییهه بنوککییییههسککییییههد."
