[Killed] BlockStatement
src/processors/MiscSpacingProcessor.ts:13:40
 
    * @returns The cleaned text.
    */
-  public process(text: string): string {
-    // removes space before parentheses on misc cases
-    text = text.replace(/ \((ص|عج|س|ع|ره)\)/g, '($1)')
-
-    // removes space before braces containing numbers
-    text = text.replace(/ \[([0-9۰-۹]+)]/g, '[$1]')
-
-    return text
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/MiscSpacingProcessor.ts:15:48
    */
   public process(text: string): string {
     // removes space before parentheses on misc cases
-    text = text.replace(/ \((ص|عج|س|ع|ره)\)/g, '($1)')
+    text = text.replace(/ \((ص|عج|س|ع|ره)\)/g, "")
 
     // removes space before braces containing numbers
killedBy: Virastar fixMiscSpacing should remove space before parentheses when given misc cases
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "مثال(ص) جمله(س) کلمه(ع)"
Received: "مثال جمله کلمه"
