[Killed] BlockStatement
src/processors/NumeralSymbolProcessor.ts:10:40
 
    * @returns The text with fixed numerals
    */
-  public process(text: string): string {
-    return (
-      text
-        // replaces english percent signs (U+066A)
-        // props @ebraminio/persiantools
-        .replace(/([۰-۹]) ?%/g, '$1٪')
-
-        // replaces dots between numbers into decimal separator (U+066B)
-        // props @ebraminio/persiantools
-        .replace(/([۰-۹])\.(?=[۰-۹])/g, '$1٫')
-
-        // replaces commas between numbers into thousands separator (U+066C)
-        // props @languagetool-org
-        .replace(/([۰-۹]),(?=[۰-۹])/g, '$1٬')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] Regex
src/processors/NumeralSymbolProcessor.ts:19:18
 
         // replaces dots between numbers into decimal separator (U+066B)
         // props @ebraminio/persiantools
-        .replace(/([۰-۹])\.(?=[۰-۹])/g, '$1٫')
+        .replace(/([۰-۹])\.(?![۰-۹])/g, '$1٫')
 
         // replaces commas between numbers into thousands separator (U+066C)
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "۱٫ نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] Regex
src/processors/NumeralSymbolProcessor.ts:23:18
 
         // replaces commas between numbers into thousands separator (U+066C)
         // props @languagetool-org
-        .replace(/([۰-۹]),(?=[۰-۹])/g, '$1٬')
+        .replace(/([^۰-۹]),(?=[۰-۹])/g, '$1٬')
     )
   }
killedBy: Virastar #cleanup(): Additional extra: fixNumeralSymbols(): replaces commas between numbers into thousands separator
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۲٬۵۴۳"
Received: "۱۲، ۵۴۳"
