[Killed] BlockStatement
src/processors/PrefixSpacingProcessor.ts:10:40
    * @param text - The input text to process.
    * @returns The processed text with zwnj between the word and the prefix.
    */
-  public process(text: string): string {
-    return this.fixPrefixSpacing(text)
-  }
+  public process(text: string): string {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/processors/PrefixSpacingProcessor.ts:20:50
    * @param text - The input text to process.
    * @returns The processed text with zwnj between the word and the prefix.
    */
-  private fixPrefixSpacing(text: string): string {
-    const replacement = '$1\u200c$3'
-    return text
-      .replace(/((\s|^)ن?می) ([^ ])/g, replacement)
-      .replace(/((\s|^)بی) ([^ ])/g, replacement)
-  }
+  private fixPrefixSpacing(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/PrefixSpacingProcessor.ts:23:16
   private fixPrefixSpacing(text: string): string {
     const replacement = '$1\u200c$3'
     return text
-      .replace(/((\s|^)ن?می) ([^ ])/g, replacement)
+      .replace(/((\s|^)ن?می) ([ ])/g, replacement)
       .replace(/((\s|^)بی) ([^ ])/g, replacement)
   }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می کند تا متون فارسی زیباتر و درست‌تری بنویسید."

[Killed] Regex
src/processors/PrefixSpacingProcessor.ts:24:16
     const replacement = '$1\u200c$3'
     return text
       .replace(/((\s|^)ن?می) ([^ ])/g, replacement)
-      .replace(/((\s|^)بی) ([^ ])/g, replacement)
+      .replace(/((\S|^)بی) ([^ ])/g, replacement)
   }
 }
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "۱. نویسه‌های عربی‌را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] Regex
src/processors/PrefixSpacingProcessor.ts:24:16
     const replacement = '$1\u200c$3'
     return text
       .replace(/((\s|^)ن?می) ([^ ])/g, replacement)
-      .replace(/((\s|^)بی) ([^ ])/g, replacement)
+      .replace(/((\s|^)بی) ([ ])/g, replacement)
   }
 }
killedBy: Virastar fixPrefixSpacing should put zwnj between the word and the bi* prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "من بی‌خیال شدم"
Received: "من بی خیال شدم"
