[Killed] BlockStatement
src/processors/PunctuationProcessor.ts:16:40
    * @param text - The input text.
    * @returns The processed text.
    */
-  public process(text: string): string {
-    return this.fixPunctuations(text)
-  }
+  public process(text: string): string {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/processors/PunctuationProcessor.ts:26:49
    * @param text - The input text.
    * @returns The processed text.
    */
-  private fixPunctuations(text: string): string {
-    return text
-      .split('')
-      .map((char) =>
-        this.fromBatch.includes(char)
-          ? this.toBatch.charAt(this.fromBatch.indexOf(char))
-          : char,
-      )
-      .join('')
-  }
+  private fixPunctuations(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'split')
