[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:13:18
     return (
       text
         // removes space before punctuations
-        .replace(/[ \t\u200c]*([:;,؛،.؟?!]{1})/g, '$1')
+        .replace(/[ \t\u200c]*([^:;,؛،.؟?!]{1})/g, '$1')
 
         // removes more than one space after punctuations
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستاربهشماکمکمیکندتامتونفارسیزیباترودرستتریبنویسید ."

[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:17:18
 
         // removes more than one space after punctuations
         // except followed by new-lines (or preservers)
-        .replace(/([:;,؛،.؟?!]{1})[ \t\u200c]*(?!\n|_{2})/g, '$1 ')
+        .replace(/([^:;,؛،.؟?!]{1})[ \t\u200c]*(?!\n|_{2})/g, '$1 ')
 
         // removes space after colon that separates time parts
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "و ی ر ا س ت ا ر ب ه ش م ا ک م ک م ی ک ن د ت ا م ت و ن ف ا ر س ی ز ی ب ا ت ر و د ر س ت ت ر ی ب ن و ی س ی د ."

[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:20:18
         .replace(/([:;,؛،.؟?!]{1})[ \t\u200c]*(?!\n|_{2})/g, '$1 ')
 
         // removes space after colon that separates time parts
-        .replace(/([0-9۰-۹]+):\s+([0-9۰-۹]+)/g, '$1:$2')
+        .replace(/([0-9۰-۹]+):\s+([^0-9۰-۹]+)/g, '$1:$2')
 
         // removes space after dots in numbers
killedBy: Virastar #cleanup() should not puts space after time colon separator
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱۲:۳۴"
Received: "۱۲: ۳۴"

[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:23:18
         .replace(/([0-9۰-۹]+):\s+([0-9۰-۹]+)/g, '$1:$2')
 
         // removes space after dots in numbers
-        .replace(/([0-9۰-۹]+)\. ([0-9۰-۹]+)/g, '$1.$2')
+        .replace(/([0-9۰-۹]+)\. ([^0-9۰-۹]+)/g, '$1.$2')
 
         // removes space before common domain tlds
killedBy: Virastar #cleanup() should cleanup simple sentences #1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۱. نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."
Received: "۱.نویسه‌های عربی را به فارسی تبدیل می‌کند. مثلا کاف و یای عربی."

[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:23:18
         .replace(/([0-9۰-۹]+):\s+([0-9۰-۹]+)/g, '$1:$2')
 
         // removes space after dots in numbers
-        .replace(/([0-9۰-۹]+)\. ([0-9۰-۹]+)/g, '$1.$2')
+        .replace(/([^0-9۰-۹]+)\. ([0-9۰-۹]+)/g, '$1.$2')
 
         // removes space before common domain tlds
killedBy: Virastar fixPunctuationSpacing should remove space after dots in numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "قیمت: ۱۰.۵ دلار"
Received: "قیمت: ۱۰. ۵ دلار"

[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:27:11
 
         // removes space before common domain tlds
         .replace(
-          /([\w\-_]+)\. (ir|com|org|net|info|edu|me)([\s/\\\])»:;.])/g,
+          /([^\w\-_]+)\. (ir|com|org|net|info|edu|me)([\s/\\\])»:;.])/g,
           '$1.$2$3',
         )
killedBy: Virastar fixPunctuationSpacing should remove space before common domain tlds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "برای دسترسی به سایت‌های time.ir و google.com"
Received: "برای دسترسی به سایت‌های time. ir و google. com"

[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:27:11
 
         // removes space before common domain tlds
         .replace(
-          /([\w\-_]+)\. (ir|com|org|net|info|edu|me)([\s/\\\])»:;.])/g,
+          /([\w\-_]+)\. (ir|com|org|net|info|edu|me)([\S/\\\])»:;.])/g,
           '$1.$2$3',
         )
killedBy: Virastar fixPunctuationSpacing should remove space before common domain tlds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "برای دسترسی به سایت‌های time.ir و google.com"
Received: "برای دسترسی به سایت‌های time. ir و google. com"

[Killed] Regex
src/processors/PunctuationSpacingProcessor.ts:32:18
         )
 
         // removes space between different/same marks (double-check)
-        .replace(/([؟?!])([ ]+)(?=[؟?!])/g, '$1')
+        .replace(/([؟?!])([^ ]+)(?=[؟?!])/g, '$1')
     )
   }
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟ !"

[Killed] StringLiteral
src/processors/PunctuationSpacingProcessor.ts:32:45
         )
 
         // removes space between different/same marks (double-check)
-        .replace(/([؟?!])([ ]+)(?=[؟?!])/g, '$1')
+        .replace(/([؟?!])([ ]+)(?=[؟?!])/g, "")
     )
   }
killedBy: Virastar #cleanup() should cleanup simple sentences #9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۹. علامت تعحب و سوال اضافی را حذف می‌کند؟!"
Received: "۹. علامت تعحب و سوال اضافی را حذف می‌کند!"
