[Killed] BlockStatement
src/processors/QuestionMarkProcessor.ts:9:40
    * @param text - The text to fix
    * @returns The text with fixed question marks
    */
-  public process(text: string): string {
-    return this.fixQuestionMark(text)
-  }
+  public process(text: string): string {}
 
   /**
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "undefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefined"

[Killed] BlockStatement
src/processors/QuestionMarkProcessor.ts:18:49
    * @param text - The text to fix
    * @returns The text with fixed question marks
    */
-  private fixQuestionMark(text: string): string {
-    return text.replace(/(\?)/g, '\u061F') // \u061F = ؟
-  }
+  private fixQuestionMark(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "undefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefinedundefined"

[Killed] StringLiteral
src/processors/QuestionMarkProcessor.ts:19:34
    * @returns The text with fixed question marks
    */
   private fixQuestionMark(text: string): string {
-    return text.replace(/(\?)/g, '\u061F') // \u061F = ؟
+    return text.replace(/(\?)/g, "") // \u061F = ؟
   }
 }
killedBy: Virastar #cleanup(): Additional should normalize question/exclamation marks
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست؟!"
Received: "عادت به تنهایی… این دیگر از آن حرف‌هاست!"
