[Killed] StringLiteral
src/processors/RemoveDiacriticsProcessor.ts:12:5
    */
   private readonly diacriticChars =
     '\u0652' +
-    '\u064C' +
+    "" +
     '\u064D' +
     '\u064B' +
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "اذا عمت البلدان الفتن فعلیکم بقم وحوالیها ونواحیها فان البلاء مدفوع عنها"
Received: "اذا عمت البلدان الفتن فعلیکم بقم وحوالیها ونواحیها فان البلاء مدفوعٌ عنها"

[Killed] StringLiteral
src/processors/RemoveDiacriticsProcessor.ts:15:5
     '\u064C' +
     '\u064D' +
     '\u064B' +
-    '\u064F' +
+    "" +
     '\u0650' +
     '\u064E' +
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "اذا عمت البلدان الفتن فعلیکم بقم وحوالیها ونواحیها فان البلاء مدفوع عنها"
Received: "اذا عمت البُلدان الفتنُ فعلیکم بقُم وحوالیها ونواحیها فان البلاء مدفُوع عنها"

[Killed] StringLiteral
src/processors/RemoveDiacriticsProcessor.ts:17:5
     '\u064B' +
     '\u064F' +
     '\u0650' +
-    '\u064E' +
+    "" +
     '\u0651'
 
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "اذا عمت البلدان الفتن فعلیکم بقم وحوالیها ونواحیها فان البلاء مدفوع عنها"
Received: "اذا عَمَت البلدانَ الفتَن فَعَلَیکم بقم وَحَوالیها وَنَواحیها فَانَ البَلاءَ مَدفوع عَنها"

[Killed] BlockStatement
src/processors/RemoveDiacriticsProcessor.ts:27:40
 
    * @returns The input text with all diacritic characters removed.
    */
-  public process(text: string): string {
-    return text.replace(new RegExp(`[${this.diacriticChars}]+`, 'g'), '')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/RemoveDiacriticsProcessor.ts:28:65
    * @returns The input text with all diacritic characters removed.
    */
   public process(text: string): string {
-    return text.replace(new RegExp(`[${this.diacriticChars}]+`, 'g'), '')
+    return text.replace(new RegExp(`[${this.diacriticChars}]+`, ""), '')
   }
 }
killedBy: Virastar #cleanup(): Additional extra: removeDiacritics(): removes all diacritic characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "اذا عمت البلدان الفتن فعلیکم بقم وحوالیها ونواحیها فان البلاء مدفوع عنها"
Received: "اذا عمَّتِ الْبُلْدانَ الْفِتَنُ فَعَلَیکمْ بِقُمْ وَحَوالیها وَنَواحیها فَانَ الْبَلاءَ مَدْفُوعٌ عَنْها"
