[Killed] BlockStatement
src/processors/RightToLeftMarkProcessor.ts:9:40
    * @param text The input string to process.
    * @returns Returns the processed string.
    */
-  public process(text: string): string {
-    return text.replace(/([^a-zA-Z\-_])(\u200F)/g, '$1\u200c')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/RightToLeftMarkProcessor.ts:10:25
    * @returns Returns the processed string.
    */
   public process(text: string): string {
-    return text.replace(/([^a-zA-Z\-_])(\u200F)/g, '$1\u200c')
+    return text.replace(/([a-zA-Z\-_])(\u200F)/g, '$1\u200c')
   }
 }
killedBy: Virastar cleanupRLM should replace RLM followed by persian character with ZWNJ
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این‌یک متن فارسی است."
Received: "این‏یک متن فارسی است."
