[Killed] BlockStatement
src/processors/SpacingProcessor.ts:12:40
    * @param {string} text - The text to clean up spacing for.
    * @returns {string} The cleaned up text.
    */
-  public process(text: string): string {
-    return (
-      text
-
-        // replaces more than one space with just a single one
-        // except before/after preservers and before new-lines
-        // .replace(/(?<![_]{2})([ ]{2,})(?![_]{2}|\n)/g, ' ') // WORKS: using lookbehind
-        .replace(/([^_])([ ]{2,})(?![_]{2}|\n)/g, '$1 ')
-
-        // cleans tab/space/zwnj/zwj/nbsp between two new-lines(\n)
-        // @REF: https://stackoverflow.com/a/10965543/
-        .replace(/^\n([\t\u0020\u200c\u200d\u00a0]*)\n$/gm, '\n\n')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Survived] Regex
src/processors/SpacingProcessor.ts:23:18
 
         // cleans tab/space/zwnj/zwj/nbsp between two new-lines(\n)
         // @REF: https://stackoverflow.com/a/10965543/
-        .replace(/^\n([\t\u0020\u200c\u200d\u00a0]*)\n$/gm, '\n\n')
+        .replace(/^\n([^\t\u0020\u200c\u200d\u00a0]*)\n$/gm, '\n\n')
     )
   }
