[Killed] BlockStatement
src/processors/SuffixSpacingHamzehProcessor.ts:13:40
    * @param text The text to modify.
    * @returns The modified text with heh + ye/hamza replaced with heh-ye + ZWNJ.
    */
-  public process(text: string): string {
-    const replacement = '$1\u0647\u200c\u06cc$3'
-
-    // Replace heh + ye, heh + standalone hamza, and heh + hamza above with heh-ye + ZWNJ.
-    return text
-      .replace(/(\S)(ه[\s\u200c]+[یي])([\s\u200c])/g, replacement)
-      .replace(/(\S)(ه[\s\u200c]?\u0621)([\s\u200c])/g, replacement)
-      .replace(/(\S)(ه[\s\u200c]?\u0654)([\s\u200c])/g, replacement)
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/SuffixSpacingHamzehProcessor.ts:18:16
 
     // Replace heh + ye, heh + standalone hamza, and heh + hamza above with heh-ye + ZWNJ.
     return text
-      .replace(/(\S)(ه[\s\u200c]+[یي])([\s\u200c])/g, replacement)
+      .replace(/(\s)(ه[\s\u200c]+[یي])([\s\u200c])/g, replacement)
       .replace(/(\S)(ه[\s\u200c]?\u0621)([\s\u200c])/g, replacement)
       .replace(/(\S)(ه[\s\u200c]?\u0654)([\s\u200c])/g, replacement)
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه ی پدری"

[Killed] Regex
src/processors/SuffixSpacingHamzehProcessor.ts:18:16
 
     // Replace heh + ye, heh + standalone hamza, and heh + hamza above with heh-ye + ZWNJ.
     return text
-      .replace(/(\S)(ه[\s\u200c]+[یي])([\s\u200c])/g, replacement)
+      .replace(/(\S)(ه[\s\u200c]+[^یي])([\s\u200c])/g, replacement)
       .replace(/(\S)(ه[\s\u200c]?\u0621)([\s\u200c])/g, replacement)
       .replace(/(\S)(ه[\s\u200c]?\u0654)([\s\u200c])/g, replacement)
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه ی پدری"

[Killed] Regex
src/processors/SuffixSpacingHamzehProcessor.ts:19:16
     // Replace heh + ye, heh + standalone hamza, and heh + hamza above with heh-ye + ZWNJ.
     return text
       .replace(/(\S)(ه[\s\u200c]+[یي])([\s\u200c])/g, replacement)
-      .replace(/(\S)(ه[\s\u200c]?\u0621)([\s\u200c])/g, replacement)
+      .replace(/(\S)(ه[^\s\u200c]?\u0621)([\s\u200c])/g, replacement)
       .replace(/(\S)(ه[\s\u200c]?\u0654)([\s\u200c])/g, replacement)
   }
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه ء پدری"

[Killed] Regex
src/processors/SuffixSpacingHamzehProcessor.ts:20:16
     return text
       .replace(/(\S)(ه[\s\u200c]+[یي])([\s\u200c])/g, replacement)
       .replace(/(\S)(ه[\s\u200c]?\u0621)([\s\u200c])/g, replacement)
-      .replace(/(\S)(ه[\s\u200c]?\u0654)([\s\u200c])/g, replacement)
+      .replace(/(\S)(ه[\s\u200c]?\u0654)([\S\u200c])/g, replacement)
   }
 }
killedBy: Virastar #cleanup(): Additional should fix heh plus hamza into ye
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ی پدری"
Received: "خانه‌ٔ پدری"
