[Killed] BlockStatement
src/processors/SuffixSpacingMiscProcessor.ts:10:40
    * @param text - The input text to fix
    * @returns The text with fixed suffix misc
    */
-  public process(text: string): string {
-    return text.replace(
-      /(\S)ه[\u200c\u200e][ئی]ی([\s\u200c\u200e])/g,
-      '$1ه\u200cای$2',
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] StringLiteral
src/processors/SuffixSpacingMiscProcessor.ts:13:7
   public process(text: string): string {
     return text.replace(
       /(\S)ه[\u200c\u200e][ئی]ی([\s\u200c\u200e])/g,
-      '$1ه\u200cای$2',
+      "",
     )
   }
killedBy: Virastar #cleanup(): Additional extra: fixSuffixMisc()
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "خانه‌ای بر روی آب"
Received: "خابر روی آب"
