[Killed] StringLiteral
src/processors/SuffixSpacingProcessor.ts:6:5
 export class SuffixSpacingProcessor extends BaseProcessor {
   private readonly chars =
     '\u0621' +
-    '\u0627' +
+    "" +
     '\u0622' +
     '\u0623' +
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیبا تر و درست‌تری بنویسید."

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:9:5
     '\u0627' +
     '\u0622' +
     '\u0623' +
-    '\u0625' +
+    "" +
     '\u0626' +
     '\u0624' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:10:5
     '\u0622' +
     '\u0623' +
     '\u0625' +
-    '\u0626' +
+    "" +
     '\u0624' +
     '\u0628' +

[Killed] StringLiteral
src/processors/SuffixSpacingProcessor.ts:14:5
     '\u0624' +
     '\u0628' +
     '\u067E' +
-    '\u062A' +
+    "" +
     '\u062B' +
     '\u062C' +
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست تری بنویسید."

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:16:5
     '\u067E' +
     '\u062A' +
     '\u062B' +
-    '\u062C' +
+    "" +
     '\u0686' +
     '\u062D' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:19:5
     '\u062C' +
     '\u0686' +
     '\u062D' +
-    '\u062E' +
+    "" +
     '\u062F' +
     '\u0630' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:28:5
     '\u0633' +
     '\u0634' +
     '\u0635' +
-    '\u0636' +
+    "" +
     '\u0637' +
     '\u0638' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:30:5
     '\u0635' +
     '\u0636' +
     '\u0637' +
-    '\u0638' +
+    "" +
     '\u0639' +
     '\u063A' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:33:5
     '\u0638' +
     '\u0639' +
     '\u063A' +
-    '\u0641' +
+    "" +
     '\u0642' +
     '\u06A9' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:37:5
     '\u0642' +
     '\u06A9' +
     '\u06AF' +
-    '\u0644' +
+    "" +
     '\u0645' +
     '\u0646' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:40:5
     '\u0644' +
     '\u0645' +
     '\u0646' +
-    '\u0648' +
+    "" +
     '\u0647' +
     '\u06CC' +

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:49:5
 
   // @REF: https://en.wikipedia.org/wiki/Persian_alphabet#Diacritics
   private readonly diacriticChars =
-    '\u0652' +
+    "" +
     '\u064C' +
     '\u064D' +

[Killed] StringLiteral
src/processors/SuffixSpacingProcessor.ts:68:11
       .replace(
         new RegExp(
           `([${this.chars}${this.diacriticChars}]) (ها(ی)?[${this.patternAfter}])`,
-          'g',
+          "",
         ),
         replacement,
killedBy: Virastar #cleanup() should cleanup simple sentences #2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نقطه ویرگول به جای semicolon (؛) و یا استفاده از «گیومه‌های فارسی»"
Received: "۲. نویسه‌های انگلیسی رایج در تایپ فارسی را به معادل صحیح فارسی آن تبدیل می‌کند، مثلا تبدیل کامای انگلیسی به ویرگول (،)، یا نق

[Killed] StringLiteral
src/processors/SuffixSpacingProcessor.ts:82:11
       .replace(
         new RegExp(
           `([${this.chars}${this.diacriticChars}]) (تر((ی)|(ین))?[${this.patternAfter}])`,
-          'g',
+          "",
         ),
         replacement,
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست تری بنویسید."

[Killed] StringLiteral
src/processors/SuffixSpacingProcessor.ts:88:11
       )
       .replace(
         new RegExp(
-          `([${this.chars}${this.diacriticChars}]) ((هایی|هایم|هایت|هایش|هایمان|هایتان|هایشان)[${this.patternAfter}])`,
+          ``,
           'g',
         ),
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."

[Survived] StringLiteral
src/processors/SuffixSpacingProcessor.ts:89:11
       .replace(
         new RegExp(
           `([${this.chars}${this.diacriticChars}]) ((هایی|هایم|هایت|هایش|هایمان|هایتان|هایشان)[${this.patternAfter}])`,
-          'g',
+          "",
         ),
         replacement,
