[Killed] BlockStatement
src/processors/ThreeDotsProcessor.ts:11:40
    * @param text The input text to fix punctuation spacing.
    * @returns The text with fixed punctuation spacing for three dots.
    */
-  public process(text: string): string {
-    // Removes spaces between dots
-    text = text.replace(/\.( +)(?=[.])/g, '.')
-
-    // Replaces three dots with ellipsis character
-    return text.replace(/[ \t]*\.{3,}/g, '…')
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/ThreeDotsProcessor.ts:13:25
    */
   public process(text: string): string {
     // Removes spaces between dots
-    text = text.replace(/\.( +)(?=[.])/g, '.')
+    text = text.replace(/\.( )(?=[.])/g, '.')
 
     // Replaces three dots with ellipsis character
killedBy: Virastar fixThreeDots should remove spaces between dots
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "سلام… دنیا"
Received: "سلام.  .  . دنیا"

[Killed] StringLiteral
src/processors/ThreeDotsProcessor.ts:16:42
     text = text.replace(/\.( +)(?=[.])/g, '.')
 
     // Replaces three dots with ellipsis character
-    return text.replace(/[ \t]*\.{3,}/g, '…')
+    return text.replace(/[ \t]*\.{3,}/g, "")
   }
 }
killedBy: Virastar #cleanup() should cleanup simple sentences #4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند…"
Received: "۴. سه نقطه را به نویسه صحیح آن که تنها یک نویسه است تبدیل کرده و فاصله گذاری آن را اصلاح می‌کند"
