[Killed] BlockStatement
src/processors/ZeroWidthNonJoinerLateProcessor.ts:6:40
 export class ZeroWidthNonJoinerLateProcessor extends BaseProcessor {
   // props @ebraminio/persiantools
   // late checks for zwnjs
-  public process(text: string): string {
-    return (
-      text
-
-        // cleans zwnj after characters that don't connect to the next
-        .replace(/([إأةؤورزژاآدذ،؛,:«»\\/@#$٪×*()ـ\-=|])\u200c/g, '$1')
-    )
-  }
+  public process(text: string): string {}
 }
 
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] Regex
src/processors/ZeroWidthNonJoinerLateProcessor.ts:11:18
       text
 
         // cleans zwnj after characters that don't connect to the next
-        .replace(/([إأةؤورزژاآدذ،؛,:«»\\/@#$٪×*()ـ\-=|])\u200c/g, '$1')
+        .replace(/([^إأةؤورزژاآدذ،؛,:«»\\/@#$٪×*()ـ\-=|])\u200c/g, '$1')
     )
   }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک میکند تا متون فارسی زیبا‌تر و درستتری بنویسید."

[Killed] StringLiteral
src/processors/ZeroWidthNonJoinerLateProcessor.ts:11:67
       text
 
         // cleans zwnj after characters that don't connect to the next
-        .replace(/([إأةؤورزژاآدذ،؛,:«»\\/@#$٪×*()ـ\-=|])\u200c/g, '$1')
+        .replace(/([إأةؤورزژاآدذ،؛,:«»\\/@#$٪×*()ـ\-=|])\u200c/g, "")
     )
   }
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ویراستار به شما کمک می‌کند تا متون فارسی زیباتر و درست‌تری بنویسید."
Received: "ویراستار به شما کمک می‌کند تا متون فارسی زیبتر و درست‌تری بنویسید."
