[Killed] BlockStatement
src/processors/ZeroWidthNonJoinerProcessor.ts:11:40
    * @param text The input string to clean up.
    * @returns The cleaned up string.
    */
-  public process(text: string): string {
-    return (
-      text
-
-        // converts all soft hyphens (&shy;) into zwnj
-        .replace(/\u00ad/g, '\u200c')
-
-        // removes more than one zwnj
-        .replace(/\u200c{2,}/g, '\u200c')
-
-        // cleans zwnj before and after numbers, english words, spaces and punctuations
-        .replace(
-          /\u200c([\w\s0-9۰-۹[\](){}«»“”.…,:;?!$%@#*=+\-/\\،؛٫٬×٪؟ـ])/g,
-          '$1',
-        )
-        .replace(
-          /([\w\s0-9۰-۹[\](){}«»“”.…,:;?!$%@#*=+\-/\\،؛٫٬×٪؟ـ])\u200c/g,
-          '$1',
-        )
-
-        // removes unnecessary zwnj on start/end of each line
-        .replace(/(^\u200c|\u200c$)/gm, '')
-    )
-  }
+  public process(text: string): string {}
 
   // props @ebraminio/persiantools
killedBy: Virastar #cleanup() should cleanup simple sentences
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] StringLiteral
src/processors/ZeroWidthNonJoinerProcessor.ts:16:29
       text
 
         // converts all soft hyphens (&shy;) into zwnj
-        .replace(/\u00ad/g, '\u200c')
+        .replace(/\u00ad/g, "")
 
         // removes more than one zwnj
killedBy: Virastar #cleanup(): Additional should convert all soft hyphens into zwnj
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "عادت به تنهایی… این دیگر از آن حرف‌هاست!"
Received: "عادت به تنهایی… این دیگر از آن حرفهاست!"

[Killed] StringLiteral
src/processors/ZeroWidthNonJoinerProcessor.ts:19:33
         .replace(/\u00ad/g, '\u200c')
 
         // removes more than one zwnj
-        .replace(/\u200c{2,}/g, '\u200c')
+        .replace(/\u200c{2,}/g, "")
 
         // cleans zwnj before and after numbers, english words, spaces and punctuations
killedBy: Virastar cleanupZWNJ should cleanup soft hyphens and multiple zwnj
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "این یک‌متن است که زیاده‌استفاده از زوج نیم‌فاصله در آن صورت گرفته است."
Received: "این یک‌متن است که زیادهاستفاده از زوج نیم‌فاصله در آن صورت گرفته است."

[Killed] StringLiteral
src/processors/ZeroWidthNonJoinerProcessor.ts:24:11
         // cleans zwnj before and after numbers, english words, spaces and punctuations
         .replace(
           /\u200c([\w\s0-9۰-۹[\](){}«»“”.…,:;?!$%@#*=+\-/\\،؛٫٬×٪؟ـ])/g,
-          '$1',
+          "",
         )
         .replace(
killedBy: Virastar #cleanup(): Additional extra: kashidasAsParenthetic(): replaces kashidas to ndash in parenthetic
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ما مردم افغانستان –که همواره به فتوحات پادشاهان خویش در هند می‌بالیم– شاید حالا که دو دهه رنج تهاجم بیگانگان را چشیده‌ایم، بتوانیم درد و رنج مردم هند را در دوران لشکرکشی‌های اجدادمان دریابیم."
Received: "ما مردم افغانستان –که همواره به فتوحات پادشاهان خویش در هند می‌بالیم– شاید حالا که دو دهه رنج تهاجم بیگانگان را چشیده‌ایم ب

[Killed] Regex
src/processors/ZeroWidthNonJoinerProcessor.ts:27:11
           '$1',
         )
         .replace(
-          /([\w\s0-9۰-۹[\](){}«»“”.…,:;?!$%@#*=+\-/\\،؛٫٬×٪؟ـ])\u200c/g,
+          /([^\w\s0-9۰-۹[\](){}«»“”.…,:;?!$%@#*=+\-/\\،؛٫٬×٪؟ـ])\u200c/g,
           '$1',
         )
killedBy: Virastar #cleanup() should cleanup simple sentences #5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام می‌شوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
Received: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام میشوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."

[Killed] Regex
src/processors/ZeroWidthNonJoinerProcessor.ts:27:11
           '$1',
         )
         .replace(
-          /([\w\s0-9۰-۹[\](){}«»“”.…,:;?!$%@#*=+\-/\\،؛٫٬×٪؟ـ])\u200c/g,
+          /([\W\s0-9۰-۹[\](){}«»“”.…,:;?!$%@#*=+\-/\\،؛٫٬×٪؟ـ])\u200c/g,
           '$1',
         )
killedBy: Virastar #cleanup() should cleanup simple sentences #5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام می‌شوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
Received: "۵. در ترکیباتی مانند «خانهٔ پدری» که با «ه» تمام میشوند نشانه «ی» کسرهٔ اضافه را به «هٔ» تبدیل می‌کند."
